{
  "政治/任命事件": [
    "以蔡州顺化军指挥使王存俨权知军州事。",
    "嗣圣元年，以承嗣为礼部尚书。寻除太常卿、同中书门下三品。",
    "秋七月己丑，瓦剌也先寇大同，参将吴浩战死，下诏亲征。吏部尚书王直帅群臣谏，不听。癸巳，命郕王居守。",
    "弘治三年，以右副都御史巡抚苏、松诸府，尽心荒政。",
    "朕与卿等共治天下，事有可否，即当面陈。卿等致位卿相，正行道扬名之时，偷安自便，徼幸一时，如后世何？群臣皆称万岁。十二年，改沁南军节度使，召为翰林学士承旨。丞相石琚致仕，上问：谁可代卿者？琚对曰：伯雄可。",
    "昪将篡国，召景归金陵为副都统。昪立，封齐王。",
    "乃以为应州节度使。晋高祖入立，罢为右卫大将军。",
    "婴入见，固辞谢病不足任。太后亦惭。於是上曰：天下方有急，王孙宁可以让邪？乃拜婴为大将军，赐金千斤。婴乃言袁盎、栾布诸名将贤士在家者进之。",
    "敬嗣晖，字唐臣，易州人。登天眷二年进士第，调怀安丞，迁弘政令，补尚书省令史。有才辩，海陵为宰相，爱之，及篡立，擢起居注，历谏议大夫、吏部侍郎、左宣徽使。贞元三年八月，尚食烹饪失宜，庖官各杖二百，嗣晖与同知宣徽院事乌居仁各杖有差。",
    "癸丑，有贼兵犯京城，刑部郎中不花守西门，夜，开门击退之。己未，刘福通遣周全引兵攻洛阳，守将登城，以大义责全，全愧谢退兵，刘福通杀之。丙寅，以完卜花、脱脱帖木儿为中书平章政事。是月，京师大水，蝗，民大饥。",
    "克仁侍帷幄最久，故获闻太祖谋略居多。洪武二年四月，命克仁等授诸子经，功臣子弟亦令入学。",
    "二月己丑，从阿老瓦丁、燕公楠之请，以杨琏真加子宣政院使暗普为江浙行省左丞。诏：上都管仓库者无资品俸秩，故为盗诈，宜于六品、七品内委用，以俸给之。高丽国王王睶请易名曰昛，其签议府请升签议司，降二品印，从之。减河南、江浙海运米四十万石。",
    "戊戌，山陵使、司空兼门下侍郎、平章事冯道上表纳政，不允。五月庚子朔，御文明殿受朝贺。乙巳，以左龙武指挥使安审琦为左右捧圣都指挥使，以右千牛上将军符彦饶为左右严卫都指挥使。丙午，以端明殿学士韩昭允为枢密使；以庄宅使刘延朗为枢密副使；以权知枢密事房暠为宣徽北院使；以成德军节度使、大同彰国振武威塞等军蕃汉马步都部署、检校太尉、兼中书令、驸马都尉石敬瑭为北京留守、河东节度使，加检校太师、兼中书令，都部署如故。",
    "壬辰，以新除征虏将军江夏王宝玄为郢州刺史。永明中，御史中丞沈渊表百官年登七十，皆令致仕，并穷困私门。庚子，诏曰：日者百司耆齿，许以自陈，东西二省，犹沾微俸，辞事私庭，荣禄兼谢，兴言爱老，实有矜怀。自缙绅年及，可一遵永明七年以前铨叙之科。",
    "會加上玉皇聖號，表求陪預，即代還，以為參詳儀制副使，知禮儀院，判祕閣、太常寺。天禧二年冬，拜工部侍郎。",
    "娄师德薨。戊申，武三思为内史。",
    "戊午，以中书侍郎、平章事豆卢革判租庸使，兼诸道盐铁、转运等使。新罗王金朴英遣使贡方物。己未，以洛京留守、判六军诸卫事、守太尉、兼中书令、河南尹、魏王张全义为检校太师、守中书令，余如故；以荆南节度使、检校太师、守中书令、渤海王高季兴依前检校太师、守中书令，余如故。",
    "隆运总宿卫事，太后益宠任之。统和元年，加开府仪同三司，兼政事令。四年，宋遣曹彬、米信将十万众来侵，隆运从太后出师败之，加守司空，封楚国公。",
    "后桓谦走入蜀，蜀贼谯纵以谦为荆州刺史，使率兵而下，荆楚之众多应之。谦至枝江，荆州刺史刘道规斩之，梁州刺史傅歆又斩桓石绥，桓氏遂灭。",
    "沛公引兵击阳城，使张良以韩司徒降下韩故地，得信，以为韩将，将其兵从沛公入武关。",
    "二年，轉殿前都虞候、領涼州觀察使、鎮州副都部署。大破契丹三萬衆于徐河，斬首數千級。淳化二年，為平虜橋砦都部署，歷并代、環慶兩路副部署。至道中，遣將從五路討李繼遷，命廷召副李繼隆為環慶靈都部署。",
    "行次镇州，闻北主已毙，其党尚据镇阳，遂与李筠、白再荣之俦合谋力战，尽逐契丹，据有镇阳。时汉祖已建号于河东，诏以福进为北面行营马步都虞候，寻拜曹州防御使、检校太保。太祖出镇于鄴，将谋北伐，奏以福进自随。",
    "明宗立，益面縛請罪，明宗曰：爾盡忠節，又何罪也。改本直左廂都校。",
    "本名隆范，后避玄宗连名，改单称范。初封郑王，寻改封卫王。长寿二年，随例却入閤，徙封巴陵郡王，累授尚食奉御。",
    "九年，拜检校右仆射，兼兴元尹，充山南西道节度观察使，三岁受代。十二年，除太子少师。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "授左翼统军元帅。从征陈友谅，功多，进骠骑卫指挥使。从常遇春讨赣州，降熊天瑞，为赣州卫指挥使，节制岭南北新附诸郡。调兵克梅州、会昌、湘乡，悉平诸山寨。",
    "石熙載字凝績，河南洛陽人。周顯德中，進士登第。疏俊有量，居家嚴謹，有禮法。宋初，太宗以殿前都虞候領泰寧軍節制，辟為掌書記。",
    "以得功及中军游击祖大寿为前锋，令会秉忠赴援，廷弼亦遣使督渠进战，遇大清兵于平阳。得功怀异志，欲引去。乃分兵为左右翼，稍却，推渠、秉忠前。",
    "鄭丙為吏部尚書，相與叶力攻道學，熹由此得祠。其後慶元偽學之禁始於此。趙雄字溫叔，資州人。為隆興元年類省試第一。",
    "制才下，承宗以兵虏昌朝归镇州。丁卯，邠宁节度使、检校司空、同平章事高崇文卒。冬十月癸酉朔，以右羽林统军阎巨源为邠州刺史、邠宁庆节度使，以少府监崔颋为同州刺史、本州防御、长春宫等使、癸未，诏：成德军节度使王承宗顷在苫庐，潜窥戎镇。",
    "擢太府少卿，總領淮東軍馬錢糧，繼升為卿。尋除直龍圖閣，帥浙東，知紹興府。入對，奏：徽州、南康軍月樁不如期，朝廷科降額，比年曰『權免一次』，來年督促如初，適足啟吏姦、重民害，乞明詔示。",
    "壬子，以淮南王他为镇西大将军、仪同三司，镇凉州。六月，封繁阳侯李嶷为丹阳王，征东大将军冯熙为昌黎王。",
    "庚戌，帝至汴梁，伯颜等扈从北行。以前翰林学士承旨阿不海牙为河南行省平章政事。发平滦民堑迁民镇，以御辽东军。",
    "尚书左仆射、宋国公萧瑀为太子少师。丙午，诏：齐故尚书仆射崔季舒、给事黄门侍郎郭遵、尚书右丞封孝琰等，昔仕鄴中，名位通显，志存忠谠，抗表极言，无救社稷之亡，遂见龙逢之酷。其季舒子刚、遵子云、孝琰子君遵，并以门遭时谴，淫刑滥及。宜从褒奖，特异常伦，可免内侍，量才别叙。",
    "三月癸亥，诏内外衆官九品以上，各荐一人。又诏求忠谠，无所隐讳。己巳，以新除翊左将军永阳王伯智爲尚书仆射。夏四月丙申，立皇子永康公胤爲皇太子，赐天下爲父后者爵一级，王公以下赉帛各有差。",
    "十二月辛卯，以兰陵郡王萧挞不也为南院枢密使。",
    "太祖甚憐之，錄其子廷敏為殿直。",
    "戊午，以运漕不继，发王公已下千余丁，各运米六斛。二月己丑，以幽州刺史、大单于段辽为骠骑将军。三月壬戌朔，日有蚀之。",
    "辛酉，以许州节度使韩通兼侍卫马步军都虞候。壬戌，以右领军大将军、权判三司张美领三司使。壬申，以滑州节度使兼殿前都指挥使、驸马都尉张永德为殿前都点校。发陈、蔡、宋、亳、颍、曹、单等州丁夫城下蔡。",
    "明年，拜中书侍郎、同平章事，领度支、盐铁转运使。每宰相间日于延英召对，诸相皆出，参必居后久之，以度支为辞，实专大政。参无学术，但多引用亲党，使居要职，以为耳目，四方籓帅，皆畏惧之。",
    "废帝入立，以为户部郎中、翰林学士。久之，拜中书侍郎、同中书门下平章事。胤孙不通世务，故事多壅塞。是时，冯道罢匡国军节度使，拜司空。",
    "贞祐四年，急备京西，为陕州宣抚副使、兼西安军节度使。是岁，大元兵取潼关，戍卒皆溃，蒲鲁虎御战，兵败死焉。",
    "衍為太子中舍。孫何字漢公，蔡州汝陽人。祖鎰，唐末秦宗權據州，強以賓佐起之。",
    "典礼当告成之后，夙夜思即位之初，千秋万岁，永混车书。宰臣冯道之辞也。庚申，以左多吾上将军史敬熔为邓州节度使，以右金吾上将军符彦超为兗州节度使，以骁卫上将军张敬询为滑州节度使，以阆州防御使孙岳为凤州节度使。",
    "辛亥，立皇后杜氏，大赦，增文武位一等。",
    "神册三年，曷鲁薨，命觌烈为迭剌部夷离堇，属以南方事。会讨党项，皇太子为先锋，觌烈副之。",
    "秋七月辛亥朔，日有食之。甲寅，遣使视诸道禾稼。辛酉，南院枢密使室昉为中京留守，加尚父。",
    "延熹二年，大将军梁冀诛，广与司徒韩縯、司空孙朗坐不卫宫，皆减死一等，夺爵土，免为庶人。后拜太中大夫、太常。九年，复拜司徒。",
    "洪武元年诏以孟子五十四代孙思谅奉祀，世复其家。思谅，字友道，子克仁，字信夫。克仁子希文。",
    "六年，琬还住涪，拜平前监军、镇北大将军，统汉中。七年春，魏大将军曹爽率步骑十余万向汉川，前锋已在骆谷。时汉中守兵不满三万，诸将大惊。",
    "清泰中，改安州节度使。及高祖即位，与契丹敦好，文进以尝背契丹，居不自安。马令《南唐书》：文进居数镇，颇有善政，兵民爱之。",
    "时存孝骁勇冠绝，军中皆下之，惟存信与争功，由是相恶，有同水火。及平定潞州，存孝以功望领节度，既而康君立授旄钺，存孝怒，大剽潞民，烧邑屋，言发流涕，疑存信摈己故也。",
    "斜也、宗干当国，劝太宗改女直旧制，用汉官制度。天会四年，始定官制，立尚书省以下诸司府寺。十二年，以企先为尚书右丞相，召至上京。入见，太宗甚惊异曰：朕畴昔尝梦此人，今果见之。",
    "壬寅，出北院枢密魏王耶律乙辛为中京留守。",
    "甲午，以西京留守韩企先同中书门下平章事、知枢密院事。",
    "更命保定伯梁珤为平蛮将军，益兵二万人。侯琎自云南督之前，疾战，大破贼，尽解诸城围。",
    "二月庚辰，以尚书左仆射王僧虔为尚书令，尚书右仆射王延之为尚书左仆射。癸未，录公齐王加授太尉，卫将军褚渊为中书监、司空。",
    "出为武定军节度使，及代，军民请留。后同知枢密院事，兼南府宰相、门下侍郎、平章事。致仕，卒。追赠中书令，谥文宪。",
    "元祐三年，擢樞密直學士、簽書樞密院事。明年，以中大夫同知院事。因進對言：機政所急，人才而已。",
    "览此忠至，弥以慰怀。及萧铣将董景珍以长沙来降，命绍率兵应之。以破铣功，拜其子智仁为温州刺史，委以招慰。时萧铣遣其将杨道生围硖州，绍纵兵击破之。",
    "訃聞，榦持心喪三年畢，調監嘉興府石門酒庫。時韓侂冑方謀用兵，吳獵帥湖北，將赴鎮，訪以兵事。榦曰：聞議者謂今天下欲為大舉深入之謀，果爾，必敗。此何時而可進取哉？獵雅敬榦名德，辟為荊湖北路安撫司激賞酒庫兼準備差遣，事有未當，必輸忠款力爭。",
    "癸酉，以司徒、扬州刺史晋安王宝义为太尉，领司徒。",
    "思穆有度量，善谈论，工草隶，为当时所称。太和十七年，携家累自汉中归国，除步兵校尉。",
    "欢知逆状已露，稍怀旅拒，遂遣蔡俊拒代；令窦泰佐之。又遣侯景等云向白马，辅世珍等径趣石济，高隆之、及娄昭等屯据壶关，韩轨之徒拥众蒲坂。于是上书天子，数论得失，訾毁乘舆，威侮朝廷。藉此微庸，冀兹大宝；溪壑可盈，祸心不测。",
    "闰月癸酉，契丹遣使者来。己卯，阅稼于西苑。九月壬寅，行营招讨使左卫上将军陈晖克襄州，执其首恶李洪。丁未，保义军节度使王檀为潞州东面行营招讨使。",
    "此必其黨欲以滅口，不然，何以不奉詔？遂乞召對面論，仁宗深器之。再遷殿中丞，策賢良方正入等，擢太常博士、通判陳州。",
    "豹谢曰：人生一世间，如白驹过隙耳。今汉王慢而侮人，骂詈诸侯群臣如骂奴耳，非有上下礼节也，吾不忍复见也。於是汉王遣韩信击虏豹於河东，传诣荥阳，以豹国为郡。汉王令豹守荥阳。",
    "从驾还，高宗特令弘武补授吏部选人五品已上官，由是渐见亲委。后母荣国夫人杨氏，以与弘武同宗，又称荐之，俄迁西台侍郎。乾封二年，与戴至德、李安期等同东西台三品。及在政事，颇以清简见称。",
    "宣王奇之，辟之为掾，迁尚书郎。时欲广田畜谷，为灭贼资。使艾行陈、项已东至寿春。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。"
  ],
  "政治/分封事件": [
    "壬寅，赐申时行等进士及第、出身有差。",
    "明宗命王淑妃母之，尝谓左右曰：惟此兒生于皇宫，故尤所钟爱。长兴末，封许王。晋高祖即位，以皇后即其姊也，乃养从益于宫中。晋天福中，以从益为二王后，改封郇国公，食邑三千户。",
    "昪将篡国，召景归金陵为副都统。昪立，封齐王。",
    "秦昭王四十年，太子死。其四十二年，以其次子安国君为太子。",
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "一子宗晖，开元初封湖阳郡王。初，重俊被害，宫府僚吏莫敢近者，永和丞甯嘉勖解衣裹重俊首号哭，时人义之。宗楚客闻而大怒，收付制狱，贬为平兴丞，寻卒。睿宗践祚，下制曰：宁嘉勖能重名节，事高栾、向，幽涂已往，生气凛然。",
    "加封嗣榮王與芮武康、寧江軍節度使，依前太師、判宗正事。詔撫勞邊防將士。",
    "夏四月壬申，进齐公爵为齐王，增封十郡。",
    "考是书《少帝纪》云：追册故妃张氏为皇后。《张从训传》亦云，高祖镇太原，为少帝娶从训长女为妃。",
    "封漆水郡王，迁上京留守，薨。诏以家贫，给葬具。",
    "景德三年，選效順兵補其缺。大中祥符五年，擇本軍善水戰者為上虎翼，六年又選江、淮習水卒於金明池按試戰棹，立為虎翼軍。江、浙、淮南諸州，亦準此選置。七年，改為虎翼水軍。",
    "乙丑，幸天开殿。己巳，诏罢来流水、混同江护逻地，与民耕牧。三月庚寅，以禁苑隙地分给百姓。戊申，以韩昉为翰林学士。",
    "開寶中，禮部再奏為考試官，調滁州軍事推官。太宗即位，擢授太子左贊善大夫，知河南縣，通判滑、梓二州。",
    "襄王僙，肃宗第九子。至德二载十二月，封襄王。贞元七年正月薨。",
    "明年，立夫人为皇后。性险妒容媚，自始至卒，谮害袁夫人等甚众。",
    "建成、元吉之诛也，君集之策居多。太宗即位，迁左卫将军，以功进封潞国公，赐邑千户，寻拜右卫大将军。",
    "九月乙卯，冀州大都督府复为魏州，魏州复为冀州。壬寅，沛王贤徙封雍王。冬十月己未，皇太子监国。",
    "七年，安南贡使还，令赍皮弁冠服、金织袭衣赐其王。",
    "攸以赞薨，又以寔继广汉殇王后，改封北海王。永宁初为平东将军、假节，加散骑常侍，代齐王冏镇许昌。寻进安南将军，都督豫州军事，增邑满二万户。",
    "今封茂为聊城王，以慰太皇太后下流之念。六年，改封曲阳王。正始三年，东平灵王薨，茂称嗌痛，不肯发哀，居处出入自若。",
    "癸卯，太常少卿萧愿责授太子洗马，夺绯。愿南郊行事，与祠官同饮，诘旦犹醉不能行礼，为御史所劾也。",
    "攻拔吴枳里城，破涂中屯戍。赐骞兄子惺爵关中侯。咸宁初，迁太尉，转大司马。",
    "明年，追号后父真为车骑将军、舞阳宣德侯，因封后母兴为舞阳君。时王美人任娠，畏后，乃服药欲除之，而胎安不动，又数梦负日而行。四年，生皇子协，后遂鸩杀美人。帝大怒，欲废后，诸宦官固请得止。",
    "是日，以知枢密院事淇阳王也先铁木儿为中书右丞相，诸王月鲁铁木儿袭封安西王。甲午，以内史倒剌沙为中书平章政事，乃马台为中书右丞，铁失知枢密院事，马思忽同知枢密院事，孛罗为宣徽院使，旭迈杰为宣政院使。",
    "及蜀平，兴复五等，命顗定礼仪。顗上请羊祜、任恺、庚峻、应贞、孔颢共删改旧文，撰定晋礼。咸熙初，封临淮侯。",
    "丁巳，设陕西等路诸站总管府，从三品。庚申，甘肃新招贫民百一十八户，敕廪给之。敕路、府、州、县捕盗者持弓矢，各路十副，府、州七副，县五副。以薛阇干为中书省平章政事。",
    "本名隆范，后避玄宗连名，改单称范。初封郑王，寻改封卫王。长寿二年，随例却入閤，徙封巴陵郡王，累授尚食奉御。",
    "从世宗猎，上欲射虎，元忠谏止之。进殿前右副都点检，为贺宋正旦使，还，转左副都点检。坐家奴结揽民税，免官。十一年，复旧职。",
    "滇王离难西南夷，举国降，请置吏入朝。於是以为益州郡，赐滇王王印，复长其民。西南夷君长以百数，独夜郎、滇受王印。滇小邑，最宠焉。",
    "六月，高璩薨。御史大夫徐商为兵部侍郎、同中书门下平章事。七月，封子侃为郢王。",
    "明年，师还。封永昌侯，食禄二千五百石，予世券。",
    "重熙初，封楚王，为北院枢密使。",
    "又以平苻坚勋，更封庐陵郡公。",
    "皇后受册于行殿。",
    "壬子，以淮南王他为镇西大将军、仪同三司，镇凉州。六月，封繁阳侯李嶷为丹阳王，征东大将军冯熙为昌黎王。",
    "魏公子无忌者，魏昭王子少子而魏安釐王异母弟也。昭王薨，安釐王即位，封公子为信陵君。是时范睢亡魏相秦，以怨魏齐故，秦兵围大梁，破魏华阳下军，走芒卯。魏王及公子患之。",
    "未几，倭寇益肆。乃增设金山参将，分守苏、松海防，寻改为副总兵，调募江南、北徐、邳官民兵充战守，而杭、嘉、湖亦增参将及兵备道。三十三年，调拨山东民兵及青州水陆枪手千人赴淮、扬，听总督南直军务都御史张经调用。",
    "三月癸亥，诏内外衆官九品以上，各荐一人。又诏求忠谠，无所隐讳。己巳，以新除翊左将军永阳王伯智爲尚书仆射。夏四月丙申，立皇子永康公胤爲皇太子，赐天下爲父后者爵一级，王公以下赉帛各有差。",
    "二月戊申，于河阳三城置河阳军节度。",
    "加安汉公号曰宰衡。赐公太夫人号曰功显君。封公子安、临皆为列侯。",
    "是年，泥八剌国沙的新葛来朝，封为王。",
    "乙卯，渤海遣使者来。三年春正月乙未，百济遣使者来。丁未，封子重美为雍王。",
    "己亥，以沧州节度使王廷允卒辍朝，赠中书令。",
    "德光喜，以道为太傅。德光北归，从至常山。汉高祖立，乃归汉，以太师奉朝请。",
    "元年四月乙卯，赦天下。乙巳，赐民爵一级。五月，除田半租，为孝文立太宗庙。令群臣无朝贺。",
    "封裴氏为高安乡君，邑五百户。至孝武帝时，崇进为广德县君。",
    "成祖初，僧智光使其地。永乐四年遣使入贡，诏授灌顶国师，赐之诰。明年遣使入谢，封为护教王，赐金印、诰命，国师如故。",
    "太祖曰：为将奈何？对曰：被坚执锐，临难不顾，为士卒先；赏必行，罚必信。太祖大笑。建安二十一年，封鄢陵侯。",
    "五月，立襄阳王尚为皇太孙。六月戌辰，大赦，增吏位二等。复封宾徒王晏为吴王。庚午，东莱王蕤、左卫将军王舆谋废齐王冏，事泄，蕤废为庶人，舆伏诛，夷三族。",
    "废帝即位，追尊魏氏为皇太后，议建陵寝，而太原石敬瑭反，乃于京师河南府东立寝宫。清泰三年六月丙寅，遣工部尚书崔俭奉上皇太后宝册，谥曰宣宪。",
    "今军外勒戎旅，内存国朝。朕嘉将军之意，今耀湛为博士。诸葛亮复出祁山，诏合督诸将西至略阳，亮还保祁山，合追至木门，与亮军交战，飞矢中合右膝，薨，谥曰壮侯。子雄嗣。",
    "初为岐国妃，天德二年封为惠妃，九月，立为皇后。",
    "己未，封皇子翊镠为潞王。",
    "丙子，與芮妻錢氏封安康郡夫人。",
    "早有文思，博涉经史，太傅崔光见而赏焉。位太学博士，修《起居注》，兼廷尉监。",
    "太师搢笏，跪受冕。加冠、加簪缨讫，出笏，兴，退立于西。",
    "戊申，金遣紇石烈忠定來賀明年正旦。己酉，加吳曦太尉。庚戌，祔恭淑皇后神主于太廟。",
    "武少以经行著称，常教授于大泽中，不交时事，名显关西。延熹八年，长女选入掖庭，桓帝以为贵人，拜武郎中。其冬，贵人立为皇后，武迁越骑校尉，封槐里侯，五千户。",
    "乙巳，赦岐州，赐高年粟帛。十月丁巳，至自岐州。十一月丁亥，徙封旭轮为冀王，改名轮。",
    "呂文德授檢校少師，李遇龍進三秩、權刑部侍郎，各賜金幣；將佐以下，進秩、賜金有差。",
    "闰二月甲子，俺答子乞庆哈袭封顺义王。",
    "小字冯六，未名而卒，赠太傅，追封陈王，赐名重杲。",
    "天子曰：大将军青躬率戎士，师大捷，获匈奴王十有馀人，益封青六千户。而封青子伉为宜春侯，青子不疑为阴安侯，青子登为发干侯。青固谢曰：臣幸得待罪行间，赖陛下神灵，军大捷，皆诸校尉力战之功也。",
    "永初元年，太后封宋衍为盛乡侯，分清河为二国，封庆少子常保为广川王，子女十一人皆为乡公主，食邑奉。明年，常保薨，无子，国除。虎威立三年薨，亦无子。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。"
  ],
  "政治/奏请事件": [
    "诏从之。同又奏曰：臣顷奏以黄素为勋，具注官名、户属及吏部换勋之法，事目三条，已蒙旨许。",
    "时高丽遣使先通于突厥，启民不敢隐，引之见帝。矩因奏曰：高丽之地，本孤竹国也，周代以之封箕子，汉时分为三郡，晋氏亦统辽东。今乃不臣，列为外域，故先帝欲征之久矣，但以杨谅不肖，师出无功。当陛下时，安得不有事于此，使冠带之境，仍为蛮貊之乡乎？今其使者朝于突厥，亲见启民从化，必惧皇灵之远暢，虑后服之先亡，胁令入朝，当可致也。",
    "乙酉，翰林学士、左谏议大夫、知制诰沈栖远守本官，以病陈乞故也。丁亥，敕河南府畿县先减尉一员，可准京兆府例，复置县尉一员。癸巳，中书奏：准今年四月十一日赦文，陕州都督府改为兴唐府，其都督府长史宜改为尹，左右司马为少尹，录事为司录，陕县为次赤，余为次畿。从之。",
    "八月，尚书省奏，推排定猛安谋克户口、田亩、牛具之数。猛安二百二，谋克千八百七十八，户六十一万五千六百二十四，口六百一十五万八千六百三十六，内正口四百八十一万二千六百六十九，奴婢口一百三十四万五千九百六十七，田一百六十九万三百八十顷有奇，牛具三十八万四千七百七十一。在都宗室将军司，户一百七十，口二万八千七百九十，内正口九百八十二，奴婢口二万七千八百八，田三千六百八十三顷七十五亩有奇，牛具三百四。",
    "秋七月己丑，瓦剌也先寇大同，参将吴浩战死，下诏亲征。吏部尚书王直帅群臣谏，不听。癸巳，命郕王居守。",
    "又進言乞都建康，謂：漢高入關中，光武守信都。",
    "阿木郎觇其单弱，请边臣调赤斤、罕东兵，夜袭破其城，牙兰遁去，斩获甚多，有诏奖赉。",
    "殿前都指挥使张永德奏，破淮贼于下蔡。",
    "上元中，以足疾上表请致仕，许之。",
    "既而诏择义军为三等，阿鲁带奏：自去岁初置帅府，已按阅本军，去其冗食。部分既定，上下既亲，故能所向成功，此皆血战屡试而可者。父子兄弟自相救援，各顾其家，心一力齐，势不可离。",
    "戊戌，山陵使、司空兼门下侍郎、平章事冯道上表纳政，不允。五月庚子朔，御文明殿受朝贺。乙巳，以左龙武指挥使安审琦为左右捧圣都指挥使，以右千牛上将军符彦饶为左右严卫都指挥使。丙午，以端明殿学士韩昭允为枢密使；以庄宅使刘延朗为枢密副使；以权知枢密事房暠为宣徽北院使；以成德军节度使、大同彰国振武威塞等军蕃汉马步都部署、检校太尉、兼中书令、驸马都尉石敬瑭为北京留守、河东节度使，加检校太师、兼中书令，都部署如故。",
    "丙子，遣近侍康末怛等十三人入城索兵器，为逻卒所害。丁丑，諲歙复叛，攻其城，破之。驾幸城中，諲歙请罪马前。诏以兵卫諲歙及族属以出。",
    "辨松江知府黄子威诬。奏减浙东濒海渔课。巡按陕西。",
    "此外如敢额外影占人户，其本官当行朝典。先是，汉隐帝时，有人上言：州府从事令录，皆请料钱，自合雇人驱使，不合差遣百姓丁户。",
    "庚戌，闽王王昶、威武军节度使王继恭遣僚佐林思、郑元弼等朝贡，致书于宰执，无人臣之礼。帝怒，诏令不受所贡，应诸州纲运，并令林思、郑元弼等押归本道。既而兵部员外郎李知损上疏，请禁锢使人，籍没纲运。",
    "明年，张士诚将吕珍围安丰，林儿告急于太祖。太祖曰：安丰破则士诚益强。遂亲帅师往救，而珍已入城杀福通。太祖击走珍，以林儿归，居之滁州。",
    "时高拱当国，路楷、杨顺以构杀沈炼论死。拱欲为楷地，谓顺首祸，顺死，楷可勿坐。化取狱牍示拱曰：狱故无炼名。",
    "峻年长于太祖二岁，太祖虽登大位，时以兄呼之，有时呼表字，不忘布衣之契也。峻以此益自负焉。广顺元年冬，刘崇与契丹围晋州，峻请行应援，太祖用为行营都部署，以徐州节度使王彦超为副。诏诸军并取峻节度，许峻以便宜从事，军行资用仰给于官，随行将吏得自选择。",
    "庚子，詔求直言。御史中丞王陶乞許舉知縣資序人為御史裏行，從之。癸卯，王安石出知江寧府。",
    "明宗立，益面縛請罪，明宗曰：爾盡忠節，又何罪也。改本直左廂都校。",
    "李希烈揣知之，上表数崇义过恶，请率先诛讨。上悦之，每对朝臣多称希烈忠诚。承自黜陟回，因奏之曰：希烈将兵讨伐，必有微勋，但恐立功之后，纵恣跋扈，不禀朝宪，必劳王师问罪。",
    "今陛下行三年之喪，高宗雖已祔廟，百官猶未吉服，詎可近違紹興而遠法元祐升侑之禮？請俟喪畢議之。詔可。孝宗嘗論人才，袤奏曰：近召趙汝愚，中外皆喜，如王藺亦望收召。上曰：然。",
    "而荣昌伯陈智、都督方政不相能，寇势日张。洽上疏言：贼虽乞降，内怀诡诈，党羽渐盛，将不可制。乞谕诸将速灭贼，毋为所饵。",
    "擢太府少卿，總領淮東軍馬錢糧，繼升為卿。尋除直龍圖閣，帥浙東，知紹興府。入對，奏：徽州、南康軍月樁不如期，朝廷科降額，比年曰『權免一次』，來年督促如初，適足啟吏姦、重民害，乞明詔示。",
    "帝親拔為第一。考官王應麟奏曰：是卷古誼若龜鑑，忠肝如鐵石，臣敢為得人賀。",
    "辛酉，孛来上书乞和。九月壬戌，京师地震有声。冬十月壬申，以西边用兵，令河南、山西、陕西士民纳马者予冠带。",
    "雍熙初，累遷媯州刺史，繼領本州團練使。時州郡部送亡命者至闕，左右諷殺之，達奏曰：此類竄匿者衆，豈能盡殺之哉？不如赦之，以開其自新之路，且以成好生之德。",
    "吳浚貪墨輕躁，豈宜用之？况夢炎舛令慢諫，讜言弗敢告，今之賣降者，多其任用之士。疏再上，不報。出關俟命，再奏曰：因危急而紊紀綱，以偏見而咈公議，臣封駁不行，與大臣異論，勢不當留。疏入，又不報，遂東歸。",
    "是以大朝会宰臣承旨，草制诏学士承旨，若无区别，何表等威？除翰林承旨外，殿前承旨宜改为殿直；密院承旨宜改为承宣；御史台、三司、阁门、客省所有承旨，并令别定其名。",
    "弼歸奏曰：臣以死拒之，彼氣折矣，可勿許也。",
    "丁未，枢密使院条奏：诸道节度使、刺史内，有不守诏条，公行科敛，须行止绝。州使所纳军粮，不得更邀加耗。节度使、刺史所置牙队，许于军都内抽取，便给省司衣粮，况人数已多，访问尚有招致。诸邑人多有抵罪亡命，便于州府投名为使下元随，邀求职务，凌压平人；及有力户人，于诸处行赂，希求事务。",
    "寝其奏。奸民献大名地为皇庄，淇议归之有司。内官龙绶请开银矿，淇不可。",
    "迁中都都转运使，转吏部尚书。上疏论台谏，其大旨谓：台官自大夫至监察，谏官自大夫至拾遗，陛下宜亲择，不可委之宰相，恐树私恩，塞言路也。",
    "禧奏：士寧遺康詩實仁宗製，今獄官以為反，臣不敢同。",
    "其长史临邑子步还表曰：楚之渡河，百姓思旧，义众云集，汝颍以南，望风翕然，回首革面。斯诚陛下应天顺民，圣德广被之所致也。",
    "仲元上书曰：去年六月，臣尝请于朝廷，乞选名将督诸军，臣得推锋，身先士卒，粮储不继，竟不果行。今将坐甲待敌，则师老财殚，日就困弊。其大概欲伐西夏以张兵势。",
    "太常博士彭景直上疏曰：礼无日祭陵，惟宗庙月有祭。",
    "仍令文武百官于搢绅之内、草泽之中，知灼然有才器者，列名以奏。宴契丹册礼使于广政殿。戊戌，郓州奏，阳谷县界河决。",
    "汉章帝元和元年，待诏候钟律殷肜上言：官无晓六十律以准调音者，故待诏严嵩具以准法教子男宣，愿召宣补学官，主调乐器。",
    "世让伪许之，因告城中曰：贼兵多少，极于此矣。宜善自固，以图安全。举重其执节，竟不之害。太宗时屯兵高墌，世让潜遣宝逃归，言贼中虚实；高祖嘉之，赐其家帛千匹。",
    "乃挈其帑归河阳。其行辎重盈路，光远利其赀，果图之。因奏曰：延光反覆奸臣，若不图之，非北走胡则南走吴越，请拘之洛阳。",
    "欢知逆状已露，稍怀旅拒，遂遣蔡俊拒代；令窦泰佐之。又遣侯景等云向白马，辅世珍等径趣石济，高隆之、及娄昭等屯据壶关，韩轨之徒拥众蒲坂。于是上书天子，数论得失，訾毁乘舆，威侮朝廷。藉此微庸，冀兹大宝；溪壑可盈，祸心不测。",
    "家奴德哥首永中尝与侍妾瑞云言：我得天下，以尔为妃，子为大王。袴、即康还奏，诏礼部尚书张暐复讯。永中父子皆死，时论冤之。",
    "十年，知彭州呂陶奏：朝廷欲寬力役，立法召募，初無過斂民財之意，有司奉行過當，增添科出，謂之寬剩。",
    "建初中，复有告延与子男鲂造逆谋者，有司奏请槛车征诣廷尉诏狱。肃宗下诏曰：王前犯大逆，罪恶尤深，有同周之管、蔡，汉之淮南。经有正义，律有明刑。",
    "埜堕马几殆，或劝留怀来城就医。埜曰：至尊在行，敢托疾自便乎？车驾次宣府，朱勇败没。埜请疾驱入关，严兵为殿。不报。",
    "壬申，鄴都、邢、洺等州皆上言地震，鄴都尤甚。"
  ],
  "日常/出行事件": [
    "己巳，有事于太庙。辛未，有事于南郊。壬申，梁主萧岿来朝。",
    "既立部伍，必以军律相临，物议纷然，后亦罢之。哀宗正大二年，议选诸路精兵，直隶密院。",
    "绍威尝以临淄、海岱罢兵岁久，储庾山积，惟京师军民多而食益寡，愿于太行伐木，下安阳、淇门，斫船三百艘，置水运自大河入洛口，岁漕百万石，以给宿卫，太祖深然之。",
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "左右引逵使叩头，逵叱之曰：安有国家长吏为贼叩头！援怒，将斩之。绛吏民闻将杀逵，皆乘城呼曰：负要杀我贤君，宁俱死耳！左右义逵，多为请，遂得免。初，逵过皮氏，曰：争地先据者胜。及围急，知不免，乃使人间行送印绶归郡，且曰：急据皮氏。",
    "会车驾西征，元昊乞降，帝以前后反覆，遣滴冽往觇诚否。因为元昊陈述祸福，听命乃还。",
    "四月巳亥，幸翠微宫。五月戊午，贬李世勣为叠州都督。己巳，皇帝崩于含风殿，年五十三。庚午，奉大行御马舆还京师。",
    "帝由左门入，就丹陛上拜位。捧册宝官由殿左门入，至几筵前。导引官奏四拜，皇太孙、亲王、皇孙陪拜丹陛上，百官陪拜思善门外。帝由殿左门入，诣大行皇帝位前，跪进册、进宝。",
    "十二年冬，小王子以五万骑自榆林入寇，围总兵王勋等于应州。帝幸阳和，亲部署，督诸将往援，殊死战，敌稍却。",
    "乙丑，幸天开殿。己巳，诏罢来流水、混同江护逻地，与民耕牧。三月庚寅，以禁苑隙地分给百姓。戊申，以韩昉为翰林学士。",
    "同光元年八月，段凝率众五万营于王村，时延孝为右先锋指挥使，率百骑来奔。",
    "而运粮则自浙西涉江入淮，由黄河逆水至中滦旱站，陆运至淇门，入御河，以达于京。",
    "绐问童子，亦如之。于是登山四顾，悄无来人，尽杀童子，驱马臂鹰而还，取海都并病妪，归八剌忽之地止焉。海都稍长，纳真率八剌忽怯谷诸民，共立为君。",
    "壬寅，以中书舍人封翘为礼部侍郎，礼部侍郎卢澹为户部侍郎。癸卯，许州节度使李从温移镇河东。",
    "永明元年春，正月，辛亥，车驾祠南郊，大赦，改元。",
    "代王谢曰：至代邸而议之。遂驰入代邸。群臣从至。",
    "遊錢塘，以詩贈處士林逋，逋尤激賞。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "辽主相去百步，遁去。",
    "二十八年十一月癸丑，上幸克宁第。初，上欲以甲第赐克宁，克宁固辞，乃赐钱，因其旧居宏大之。",
    "戊戌，詔：李純乃皇后親姪，可特除閤門宣贊舍人。十二月癸卯，帝率羣臣上壽皇聖帝玉牒、聖政、會要于重華宮。丙午，蠲歸正人賦役三年。",
    "麟奉命，遣使谢罪，而诉安平、思陵土官侵掠思郎。帝令守臣严饬。七年，安南贡使还，令赍皮弁冠服、金织袭衣赐其王。是岁，麟卒，私谥太宗。",
    "於是勾践表会稽山以为范蠡奉邑。范蠡浮海出齐，变姓名，自谓鸱夷子皮，耕于海畔，苦身戮力，父子治产。居无几何，致产数十万。",
    "十二年，以佥都御史巡抚南、赣。居二年，乞休，因荐前都御史万镗、大理卿董天锡等十四人可用。吏部请从其言。",
    "庚戌，帝至汴梁，伯颜等扈从北行。以前翰林学士承旨阿不海牙为河南行省平章政事。发平滦民堑迁民镇，以御辽东军。",
    "高祖遂并拜焉。稍迁尚书仪曹郎，转左民郎，行颍川郡。出为华州安定王征虏府长史。",
    "五日平明，良往。父已先在，怒曰：与老人期，後，何也？去，曰：後五日早会。五日鸡鸣，良往。父又先在，复怒曰：後，何也？去，曰：後五日复早来。",
    "六月壬申，驻跸胡吕山。癸未，高丽遣使来贡。秋七月己酉，阻卜大王屯秃古斯率诸部长献马、驼。",
    "十载正月，有事于南郊，于坛所大赦。制：自今已后，摄祭南郊，荐献太清宫，荐享太庙，其太尉行事前一日，于致斋所具羽仪卤簿，公服引入，亲授祝版，乃赴清斋所。汾阴后土之祀，自汉武帝后废而不行。",
    "久之，召拜刑部尚书。开元九年，上幸东都，令充京师留守。",
    "十二月癸卯，幸温汤。",
    "十一月，倫至行在，引疾請祠，不許，趣赴內殿奏事。時哲等驕倨，受書之禮未定。",
    "二十四年，宋缪公卒，公子冯奔郑。",
    "六月癸卯，行幸阴山。",
    "甲午，免江西被灾秋粮。冬十月甲子，阅京营将领骑射于西苑。戊幸南海子。十一月丁酉，阅随操武臣骑射于西苑。",
    "起沛入秦，凭谋仗计。",
    "乙巳，赦岐州，赐高年粟帛。十月丁巳，至自岐州。十一月丁亥，徙封旭轮为冀王，改名轮。",
    "再叙功，世荫外卫副千户，进副总兵。八年秋，命为援剿总兵官，督关外兵三千讨流贼。十月至河南，巡抚陈必谦、监纪推官汤开远令与左良玉抵灵宝，至则挫张献忠于焦村。",
    "冬十月丁酉，幸温泉宫。改临淄郡为济南郡。十一月己巳，还京。十二月辛未，赞善大夫杜有邻、著作郎王曾、左骁卫兵曹柳勣等为李林甫所构，并下狱死。",
    "帝捧神主由殿中门出，奉安舆内。执事捧衣冠置舆后随。",
    "德宗幸奉天，四方握兵，未有至者。纵先知之，潜告李怀光劝令奔命，怀光从之。",
    "六月丁巳，车驾北巡。秋七月甲申，帝自白鹿陂西行，大狝于牛川。登釜山，临殷繁水而南，观于九十九泉。",
    "三月壬子朔，颁孔颖达《五经正义》于天下，每年明经令依此考试。丙辰，上御观德殿，陈逆人房遗爱等口马资财为五垛，引王公、诸亲、蕃客及文武九品己上射。夏四月戊子，林邑国王遣使来朝，贡驯象。壬寅，以旱避正殿，减膳，亲录系囚，遣使分省天下冤狱，诏文武官极言得失。",
    "夏四月，帝次龙德，拔德顺等州，德顺节度使爱申、进士马肩龙死焉。五月，遣唐庆等使金。",
    "亮遣参军卜靖赴之，败走。朱彤至梁州，亮望风奔散，于是坚遂有梁益二州。",
    "元景退走。十一月，车驾从东安山出下邳，义隆邹山戍主、鲁阳阳平二郡太守崔邪利降。楚王建、南康侯杜道俊进军清西，至留建成。",
    "景隆驰至德州，会兵进营河间。燕王闻之喜，语诸将曰：李九江，纨绮少年耳，易与也。遂命世子居守，戒勿出战，而自引兵援永平，直趋大宁。",
    "己酉，南府宰相赵徽致仕。秋七月戊辰，如秋山。癸酉，柳城郡王霞抹薨。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。"
  ],
  "战争/进攻事件": [
    "十二月，公入平原，略定诸县。十年春正月，攻谭，破之，斩谭，诛其妻子，冀州平。一下令曰：其与袁氏同恶者，与之更始。令民不得复私雠，禁厚葬，皆一之于法。",
    "秋七月己丑，瓦剌也先寇大同，参将吴浩战死，下诏亲征。吏部尚书王直帅群臣谏，不听。癸巳，命郕王居守。",
    "淮南王长杀辟阳侯审食其。五月，匈奴入居北地、河南为寇。上幸甘泉，遣丞相灌婴击匈奴，匈奴去。",
    "得，全椒人，龙里守御所千户。洪武三十年，古州上婆洞蛮作乱，得与镇守将井孚守城。贼烧门急攻，二人开门奋击，得中毒弩死，孚战死。赠得指挥佥事，孚正千户，子孙世袭。",
    "冬十月，西魏伐梁元帝于江陵。",
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "癸丑，有贼兵犯京城，刑部郎中不花守西门，夜，开门击退之。己未，刘福通遣周全引兵攻洛阳，守将登城，以大义责全，全愧谢退兵，刘福通杀之。丙寅，以完卜花、脱脱帖木儿为中书平章政事。是月，京师大水，蝗，民大饥。",
    "嚣知帝审其诈，遂遣使称臣于公孙述。明年，述以嚣为朔宁王，遣兵往来，为之援势。秋，嚣将步骑三万侵安定，至阴槃，冯异率诸将拒之。嚣又令别将下陇，攻祭遵于氵幵，兵并无利，乃引还。",
    "殿前都指挥使张永德奏，破淮贼于下蔡。",
    "丙子，遣近侍康末怛等十三人入城索兵器，为逻卒所害。丁丑，諲歙复叛，攻其城，破之。驾幸城中，諲歙请罪马前。诏以兵卫諲歙及族属以出。",
    "免西京今年丝银税。甲申，免高丽酒课。乙酉，宋夏贵攻蕲县。谕诸路管民官，毋令军马、使臣入州城、村居、镇市，扰及良民。",
    "及讨渤海，破扶余城，斜涅赤从太子大元帅率众夜围忽汗城，大諲歙降。已而复叛，命诸将分地攻之。诘旦，斜涅赤感励士伍，鼓噪登陴，敌震慑，莫敢御，遂破之。天显中卒，年七十，居佐命功臣之一。",
    "清泰初，为金州防御使。会蜀军攻其城，州兵才千人，兵马都监陈知隐惧，托以他事出城，领三百人顺流而逸，贼既盛，人情忧沮。",
    "茂雨射营中，中霸前酒樽，霸安坐不动。军吏皆曰：茂前日已破，今易击也。",
    "镠卒，元瓘立，袭封吴越国王，玉册、金印，皆如镠故事。王延政自立于建州，闽中大乱，元瓘遣其将仰诠、薛万忠等攻之，逾年，大败而归。",
    "初，知祥与璋俱有异志，而重诲信言事者，以璋尽忠于国，独知祥可疑，重诲犹欲倚璋以图知祥。是岁九月，董璋先反，攻破阆州，擒李仁矩杀之。是月应圣节，知祥开宴，东北望再拜，俯伏呜咽，泣下沾襟，士卒皆为之歔欷，明日遂举兵反。是秋，明宗改封琼华公主为福庆长公主，有司言前世公主受封，皆未出降，无遣使就籓册命之仪。",
    "十一月甲午，裴度及王廷凑战于会星，败之。",
    "已复以兵破文州，杀朱显忠，友德击走之。夏亡，复集余众围秦州五十日。",
    "太祖曰：一战而胜，遂称大号，何示人浅也。进军宁江州，诸军填堑攻城。宁江人自东门出，温迪痕、阿徒罕邀击，尽殪之。",
    "城破，守贞与妻子自焚，汉军入城，于烟烬中斩其首，传送京师，枭于南市，其馀党皆磔之。",
    "敬玄自以素非边将之才，固辞。高宗谓曰：仁轨若须朕，朕即自往，卿不得辞也。竟以敬玄为洮河道大总管，兼安抚大使，仍检校鄯州都督，率兵以御吐蕃。及将战，副将工部尚书刘审礼先锋击之。",
    "九月丙戌，龙骧将军杨佺期击氐帅杨佛嵩于潼谷，败之。冬十月，姚苌死，子兴嗣伪位。十九年夏六月壬子，追尊会稽王太妃郑氏为简文宣太后。秋七月，荆、徐二州大水，伤秋稼，遣使振恤之。",
    "明年，至北都护府，破追兵于郭州。以暴疾卒。",
    "攻拔吴枳里城，破涂中屯戍。赐骞兄子惺爵关中侯。咸宁初，迁太尉，转大司马。",
    "真君四年，从驾讨蠕蠕，战没。世祖悼惜之，诏求沓干子。",
    "太宗遂引军于河南以讨徐圆朗。",
    "五月望，安战梅林，再败，退保雩都。廷麟乃散其兵，以六月入赣，与元吉凭城守。未几，援兵至，围暂解，已，复合。八月，水师战败，援师悉溃。",
    "秋八月甲戌，吴杰及永定侯张铨率致仕武臣，备倭广东。乙亥，遣国子监生分行天下。督吏民修水利。丙戌，阶、文军乱，都督甯正为平羌将军讨之。",
    "是日，以知枢密院事淇阳王也先铁木儿为中书右丞相，诸王月鲁铁木儿袭封安西王。甲午，以内史倒剌沙为中书平章政事，乃马台为中书右丞，铁失知枢密院事，马思忽同知枢密院事，孛罗为宣徽院使，旭迈杰为宣政院使。",
    "行次镇州，闻北主已毙，其党尚据镇阳，遂与李筠、白再荣之俦合谋力战，尽逐契丹，据有镇阳。时汉祖已建号于河东，诏以福进为北面行营马步都虞候，寻拜曹州防御使、检校太保。太祖出镇于鄴，将谋北伐，奏以福进自随。",
    "甲寅，德州刺史陈法武、前衡州刺史谭世远于始兴攻杀萧勃。",
    "从宗弼袭康王，即渡淮，阿鲁补以兵四千留和州，总督江、淮间戍将，以讨未附郡县。遂攻下太平州，隳其城。庐州叛，以偏师讨之，败其骑六千，擒三校。",
    "乙亥，海寇犯宁波、台州。",
    "明年，王旅北讨关河。《经》曰：敬用五事：一曰貌，二曰言，三曰视，四曰听，五曰思。貌曰恭，言曰从，视曰明，听曰聪，思曰睿。",
    "其後四年，越复伐吴。",
    "甲辰，及泰宁军节度使慕容彦超战于刘子陂，彦超败，奔于兗州。郭允明反，弑隐帝于赵村。丙戌，威入京师，纵火大掠。",
    "六月，繼遷所驅脅內屬戎人橐駝路熟藏族首領乜遇率部族反攻繼遷，其弟力戰而死，既敗繼遷之衆，復來歸附。以遇為檢校司空，領會州刺史。",
    "十九年，立子光为太子，高厚傅之，令会诸侯盟於锺离。二十七年，晋使中行献子伐齐。",
    "十二月己未，突厥复攻茹茹，茹茹举国南奔。",
    "开平元年，马殷发兵攻彦恭，恃堑为阻，逾年不能破。三年，彦恭奔于杨行密，马殷擒其弟彦雄等七人送于梁，斩于汴市，彦恭卒于淮南，澧、朗遂入于楚。钟传钟传，洪州高安人也。事州为小校，黄巢攻掠江淮，所在盗起，往往据州县。",
    "授南京礼科给事中。武宗嗣位，复先朝所汰诸冗费，蕃等力争，不纳。后起江西参议，从都御史陈金讨平东乡寇。嘉靖时，累官工部右侍郎。",
    "秩满将归，群蛮追送，赂遗甚多，轸一无所受，去如初至。又除池阳令，为雍州十一郡最。百姓生为立祠，得罪者无怨言。累迁尚书郎。",
    "居厚至华州东城，华州将娄敬思疑其有异，剖舆视之，见其兵。居厚遂击杀敬思，以兵攻西城，不克而反。",
    "战于内黄，魏兵五战五败，弘信惧，请盟，乃止。是时，梁方东攻兗、郓，北敌晋，晋遣李存信救硃宣，假道于魏。太祖闻，遣使语弘信曰：晋人志在河朔，兵还灭魏矣。",
    "四十年秋，寇六万余骑犯居庸岔道口，应熊被围于南沟，中五枪堕马，参将胡镇杀数人夺之归。其冬，复为右都督，充总兵官，镇守大同。以招徕塞外人口，增俸一级。四十二年，寇大举犯畿辅，诏应熊等入援，诸镇兵尽集，见敌势盛，不敢击。",
    "其秋，秦使甘茂攻我宜阳。五年，秦拔我宜阳，斩首六万。秦武王卒。",
    "会部人叛，从枢密使耶律世良讨平之，以功诏镇抚西北部。",
    "弼乘胜进军宫城，烧北掖门。",
    "诏崇为使持节、都督陇右诸军事，率众数万讨之。崇槎山分进，出其不意，表里以袭。群氐皆弃灵珍散归，灵珍众减大半。",
    "天会三年，大举伐宋，余睹为元帅右都监，宋兵四万救太原，余睹、屋里海逆击于汾河北，擒其帅郝仲连、张关索，统制马忠，杀万余人。",
    "大同初，新喻侯萧映为吴兴太守，甚重高祖，尝目高祖谓僚佐曰：此人方将远大。及映为广州刺史，高祖为中直兵参军，随府之镇。映令高祖招集士马，众至千人，仍命高祖监宋隆郡。所部安化二县元不宾，高祖讨平之。",
    "六月甲寅朔，次南京，五院夷离堇安端、详稳刘哥遣人驰报，请为前锋；至泰德泉，遇李胡军，战败之。",
    "二年，蒙骜攻赵，取三十七城。",
    "贊討平李全，援王素諫仁宗却王德用進女事，以止備嬪御，世多稱之。以資政殿學士、提舉洞霄宮，進大學士。",
    "酋大怒，敛众入城，设伏城旁。众饥甚，悉下山攻城。伏发，众大败，先后死者二万五千人。酋寻出令，诸所掠华人赀，悉封识贮库。",
    "及曹操击谦，徐方不安。融乃将男女万口、马三千匹走广陵。广陵太守赵昱待以宾礼。融利广陵资货，遂乘酒酣杀昱，放兵大掠，因以过江，南奔豫章，杀郡守朱皓，入据其城。",
    "今军外勒戎旅，内存国朝。朕嘉将军之意，今耀湛为博士。诸葛亮复出祁山，诏合督诸将西至略阳，亮还保祁山，合追至木门，与亮军交战，飞矢中合右膝，薨，谥曰壮侯。子雄嗣。",
    "时存孝骁勇冠绝，军中皆下之，惟存信与争功，由是相恶，有同水火。及平定潞州，存孝以功望领节度，既而康君立授旄钺，存孝怒，大剽潞民，烧邑屋，言发流涕，疑存信摈己故也。",
    "又议讨朝鲜，自严言不可遽讨，当俟请贡输诚，东征效力，徐许其封耳。京师数地震，因言内批宜慎，恩泽宜节，人才宜惜，内操宜罢，语甚切直。",
    "二年四月，峦频破衍军，遂入剑阁，执其辅国将军范始男送京师。峦又遣统军王足破衍诸将，斩其辅国将军冯文豪等。六月，衍遣将王超宗寇边，扬州刺史薛真度大破之，俘斩三千级。",
    "吴将丁奉入涡口，扬州刺史牵弘击走之。三月，赦五岁刑已下。夏四月，白龙二见于东莞。五月，立寿安亭侯承为南宫王。",
    "晋安帝隆安三年五月，荆州大水。去年，殷仲堪举兵向京都；是年春，又杀郗恢。",
    "其年六月，大清兵忽临城。林列众城外，分少兵登陴。大清兵设盾梯进攻，而别以精骑击破林军之营东门外者。",
    "十一年二月，兀朮入合肥，漸攻歷陽，江東制置大使葉夢得見俊，請速出軍。俊遣兵渡江，諭諸將曰：先得和州者勝。王德願為諸軍先，士鼓譟而行。敵已據之，德率衆渡采石先登，俊宿中流。",
    "六年冬，南征，将本部军由别道进击敌军于狼山，俘获甚众。",
    "景隆屡大败，奔德州，诸军皆溃。明年正月，燕王攻大同，景隆引军出紫荆关往救，无功而还。帝虑景隆权尚轻，遣中官赍玺书赐黄钺弓矢，专征伐。",
    "未行，属相州官军为史思明所败，东京震骇。元帅司徒郭子仪镇谷水，乃以瑱为陕州刺史，充陕、虢等州节度，并潼关防御、团练、镇守使。乾元三年四月十三日，襄州军将张维瑾、曹玠率众谋乱，杀刺史史翙。",
    "全忠秩满还乡里，事节度使李可举为牙将。时可举兵锋方盛，欲与镇人分易、定，遣全忠将兵攻之，为定州军大败于易水。",
    "壬午，景使其臣钟谟来奉表。丙戌，取扬州。辛卯，取泰州。",
    "昭王三十四年，白起攻魏，拔华阳，走芒卯，而虏三晋将，斩首十三万。与赵将贾偃战，沈其卒二万人於河中。昭王四十三年，白起攻韩陉城，拔五城，斩首五万。",
    "八年女直国侵贵德州。辖戛斯国遣使来贡。",
    "览此忠至，弥以慰怀。及萧铣将董景珍以长沙来降，命绍率兵应之。以破铣功，拜其子智仁为温州刺史，委以招慰。时萧铣遣其将杨道生围硖州，绍纵兵击破之。",
    "三月壬申，葬肃皇帝于永陵。乙酉，土蛮犯辽阳，指挥王承德战殁。夏四月丙戌朔，享太庙。",
    "既数为贼所迫，希逸率励将士，累破贼徒向润客、李怀仙等。",
    "二月，豫州刺史尧雄攻扬州，拔之，擒宝炬义州刺史韩显、扬州长史丘岳，送京师。丙辰，遣兼散骑常侍郑伯猷使于萧衍。三月，齐献武王固请解大丞相，诏从之。夏四月庚寅，曲赦畿内。",
    "以参知政事把胡鲁权尚书右丞、左副元师，元帅左都监承立为右监军权参知政事，同行尚书省元帅府于京兆。庚辰，东平元帅府总领提控蒲察山儿破红袄贼于聊城。",
    "再叙功，世荫外卫副千户，进副总兵。八年秋，命为援剿总兵官，督关外兵三千讨流贼。十月至河南，巡抚陈必谦、监纪推官汤开远令与左良玉抵灵宝，至则挫张献忠于焦村。",
    "宗弼再取河南，宋李兴据河南府。成引军入孟津。",
    "明年秋，总督卢象升去，苗胙土巡抚湖广，不习兵。于是献忠自均州，守应自新野，蝎子块自唐县，并犯襄阳，众二余万。",
    "四月，克洺州。",
    "元景退走。十一月，车驾从东安山出下邳，义隆邹山戍主、鲁阳阳平二郡太守崔邪利降。楚王建、南康侯杜道俊进军清西，至留建成。",
    "闰月癸酉，契丹遣使者来。己卯，阅稼于西苑。九月壬寅，行营招讨使左卫上将军陈晖克襄州，执其首恶李洪。丁未，保义军节度使王檀为潞州东面行营招讨使。",
    "癸酉，前江都令祖皓起义，袭广陵，斩贼南兗州刺史董绍先。侯景自帅水步军击皓。二月癸未，景攻陷广陵，皓等并见害。丙戌，以安陆王大春为东扬州刺史。",
    "二月癸卯，王晏球克定州。",
    "明年，起与客卿错攻垣城，拔之。後五年，白起攻赵，拔光狼城。",
    "辛巳，贺若弼进据钟山，顿白土冈之东南。甲申，后主遣众军与弼合战，众军败绩。"
  ],
  "人生/死亡": [
    "十二月，公入平原，略定诸县。十年春正月，攻谭，破之，斩谭，诛其妻子，冀州平。一下令曰：其与袁氏同恶者，与之更始。令民不得复私雠，禁厚葬，皆一之于法。",
    "德宗崩，礼仪使杜黄裳议：高宗在三昭三穆外，当迁。于是迁高宗而祔德宗，盖以中、睿为昭穆矣。",
    "得，全椒人，龙里守御所千户。洪武三十年，古州上婆洞蛮作乱，得与镇守将井孚守城。贼烧门急攻，二人开门奋击，得中毒弩死，孚战死。赠得指挥佥事，孚正千户，子孙世袭。",
    "乃罢华知政事，守礼部尚书。及帝崩，华竟被斥逐。代宗即位，辅国与程元振有定策功，愈恣横。",
    "秦昭王四十年，太子死。其四十二年，以其次子安国君为太子。",
    "父兰卒，矢志不嫁，以养其母。崇祯元年，年四十六矣，母病殁，女遂绝粒殉之。",
    "十一月戊申，安定郡王子肜薨。己巳，冊加高宗徽號曰受命中興全功至德聖神武文昭仁憲孝皇帝。辛未，有事于太廟。皇后李氏殺黃貴妃，以暴卒聞。",
    "恬淡退静，不竞世利，在散辈十八年不易官。太和中，除太尉东阳王谘议参军而卒。",
    "左右引逵使叩头，逵叱之曰：安有国家长吏为贼叩头！援怒，将斩之。绛吏民闻将杀逵，皆乘城呼曰：负要杀我贤君，宁俱死耳！左右义逵，多为请，遂得免。初，逵过皮氏，曰：争地先据者胜。及围急，知不免，乃使人间行送印绶归郡，且曰：急据皮氏。",
    "上以疾不朝重華宮，孝宗崩，又不能發喪，人情恟然。",
    "展也大成，则所望矣。二月，扶风妖贼裴优自称皇帝，伏诛。甲寅，皇太后梁氏崩。",
    "兴光二年卒。",
    "翼卒，帝袭爵为侯。本初元年，梁太后征帝到夏门亭，将妻以女弟。",
    "因赐帛五十匹。九年，拜散骑常侍，赐爵丰城县男。十一年卒。",
    "师还，次柳河川，暴疾卒，年仅四十。",
    "四月巳亥，幸翠微宫。五月戊午，贬李世勣为叠州都督。己巳，皇帝崩于含风殿，年五十三。庚午，奉大行御马舆还京师。",
    "天宝五载，右相李林甫构陷刑部尚书韦坚，斌以亲累贬巴陵太守，移临安太守，加银青光禄大夫。斌授五品时，兄陟为河东太守，堂兄由为右金吾将军，縚为太子少师，四人同时列戟，衣冠之盛，罕有其比。十四载，安禄山反，陷洛阳，斌为贼所得，伪授黄门侍郎，忧愤而卒。",
    "永熙二年春，卒于洛阳孝义里舍，时年六十三，赠仪同三司、定州刺史，谥曰文静。二子，收、祚。",
    "辛巳，光禄大夫韩寿卒。甲申，败将宇文述、于仲文等除名为民，斩尚书右丞刘士龙以谢天下。",
    "寿隆初，以疾卒。萧十三，蔑古乃部人。",
    "及讨渤海，破扶余城，斜涅赤从太子大元帅率众夜围忽汗城，大諲歙降。已而复叛，命诸将分地攻之。诘旦，斜涅赤感励士伍，鼓噪登陴，敌震慑，莫敢御，遂破之。天显中卒，年七十，居佐命功臣之一。",
    "其哀册曰：维上元元年，太岁庚子，六月己未朔，二十六日甲申，皇第十二子、持节凤翔等四州节度观察大使兴王佋，薨于中京内邸，殡于寝之西阶。粤八月丁亥，册赠皇太子，庙号恭懿。冬十一月庚寅，诏葬于长安之高阳原，礼也。",
    "镠卒，元瓘立，袭封吴越国王，玉册、金印，皆如镠故事。王延政自立于建州，闽中大乱，元瓘遣其将仰诠、薛万忠等攻之，逾年，大败而归。",
    "封漆水郡王，迁上京留守，薨。诏以家贫，给葬具。",
    "娄师德薨。戊申，武三思为内史。",
    "襄王僙，肃宗第九子。至德二载十二月，封襄王。贞元七年正月薨。",
    "黎安道、方脱脱、雷一声皆伏诛。是月，京师大水。河决小流口，达于清河。",
    "转河内太守。永初中，坐事抵罪，卒于家。",
    "建成、元吉之诛也，君集之策居多。太宗即位，迁左卫将军，以功进封潞国公，赐邑千户，寻拜右卫大将军。",
    "城破，守贞与妻子自焚，汉军入城，于烟烬中斩其首，传送京师，枭于南市，其馀党皆磔之。",
    "今封茂为聊城王，以慰太皇太后下流之念。六年，改封曲阳王。正始三年，东平灵王薨，茂称嗌痛，不肯发哀，居处出入自若。",
    "九月丙戌，龙骧将军杨佺期击氐帅杨佛嵩于潼谷，败之。冬十月，姚苌死，子兴嗣伪位。十九年夏六月壬子，追尊会稽王太妃郑氏为简文宣太后。秋七月，荆、徐二州大水，伤秋稼，遣使振恤之。",
    "十二月乙丑，牛僧孺罢。己巳，珍王諴薨。七年正月壬辰，罢吴、蜀冬贡茶。",
    "辛卯，潼川府東南二江溢，決隄，毀橋，浸民廬，涪城、中江、射洪、通泉、郪縣沒田廬。紹熙二年三月，寧化縣連水漂廬舍、田畝，溺死二十餘人。五月戊申，建寧州水。",
    "六月壬寅，忠武军节度使刘知俊为西路行营招讨使，以伐岐。己酉，杀右金吾卫上将军王师范，灭其族。",
    "俱造圹祔葬。郡王丧，辍朝一日。行人司遣掌行丧葬礼，余多与亲王同，无皇太后、皇后祭。",
    "景明三年卒，年三十六。谥曰惠。子弼，字延轨。位至相州录事参军。",
    "一年卒，无子，绝後，国除，入于汉。遂既王赵二十六年，孝景帝时坐晁错以適削赵王常山之郡。吴楚反，赵王遂与合谋起兵。",
    "开运四年，希范卒，年四十九，谥曰文昭。希广立。希广字德丕，希范同母弟也。希范平生恶拓拔常谏诤，常入谒，希范呼阍者指常曰：吾不欲见此人，勿复内也。",
    "秋七月壬寅，以征虏谘议参军杜骥为青州刺史。壬子，皇后袁氏崩。",
    "会大延琳叛，被执，辞不屈，贼以锯解之，愤骂至死。绍芳，重熙间参知政事，加兼侍中。时延议征李元昊，力谏不听，出为广德军节度使。",
    "己亥，侍卫马军都指挥使樊爱能、步军都指挥使何徽伏诛。壬寅，天雄军节度使符彦卿为河东行营都部署。",
    "琰曰：此人才足拔萃，然地寒寿促，不足展其器用，不可与婚。遂止。其人数年果亡。",
    "《诗》云：谷则异室，死则同穴。昔季武子成寝，杜氏之殡在西阶下，请合葬而许之。附葬之礼，自周兴焉。",
    "邓太后复立乐安王宠子延平为清河王，是为恭王。太后崩，有司上言：清河孝王至德淳懿，载育明圣，承天奉祚，为郊庙主。汉兴，高皇帝尊父为太上皇，宣帝号父为皇考，序昭穆，置园邑。大宗之义，旧章不忘。",
    "十一月庚子，汝南郡王允讓薨。十二月丁丑，白虹貫日。",
    "高祖崩，梓宫达鲁阳，乃行遗诏。北海王详奉宣遗旨，长秋卿白整等入授后药。后走呼不肯引决，曰：官岂有此也，是诸王辈杀我耳！整等执持，强之，乃含椒而尽。殡以后礼。",
    "六月，繼遷所驅脅內屬戎人橐駝路熟藏族首領乜遇率部族反攻繼遷，其弟力戰而死，既敗繼遷之衆，復來歸附。以遇為檢校司空，領會州刺史。",
    "初，阿鲁补当授谋克，未封而薨，乌带受之。",
    "太祖方事汉高祖于太原，天福中妃卒，遂葬太原之近郊。",
    "子蒲，袭爵。后有大功，及宠幸贵臣薨，赙送终礼，皆依俊故事，无得逾之者。初，俊既卒，太宗命其妻桓氏曰：夫生既共荣，没宜同穴，能殉葬者可任意。桓氏乃缢而死，遂合葬焉。",
    "开平元年，马殷发兵攻彦恭，恃堑为阻，逾年不能破。三年，彦恭奔于杨行密，马殷擒其弟彦雄等七人送于梁，斩于汴市，彦恭卒于淮南，澧、朗遂入于楚。钟传钟传，洪州高安人也。事州为小校，黄巢攻掠江淮，所在盗起，往往据州县。",
    "上嘗語近臣曰：放為朕言事甚衆，但外廷無知者。因出所上時議十三篇，其目曰：議道、議德、議刑、議器、議文武、議制度、議教化、議賞罰、議官司、議軍政、議獄訟、議征賦、議邪正。八年十一月乙丑，晨興，忽取前後章疏稿悉焚之，服道士衣，召諸生會飲於次，酒數行而卒。訃聞，上甚嗟悼，親制文遣內侍朱允中致祭。",
    "壬辰，陈许节度使高瑀卒。",
    "四十八年四月崩，谥孝端。",
    "太尉张禹荐补博士，稍迁陈留太守，坐法免。年七十八，卒于家。",
    "魏公子无忌者，魏昭王子少子而魏安釐王异母弟也。昭王薨，安釐王即位，封公子为信陵君。是时范睢亡魏相秦，以怨魏齐故，秦兵围大梁，破魏华阳下军，走芒卯。魏王及公子患之。",
    "二十三年薨。无子。黄初二年追进爵，谥曰戴公。以彭城王据子范奉整后。",
    "城中粮尽，人相食，黑汉杀其爱妾啖士，士争杀其妻子。官屡聚议欲降，黑汉与聂都统执议益坚，冯总领乃私出城与王安抚会饮，约明日宋军入城。冯归，宋军不得入，聂都统请冯议事，即坐中斩之。",
    "世祖曰：无此人忿朕，当有数千口死矣。浩竟族灭，余皆身死。",
    "文武百官素服纱帽，迎谒契丹主于郊次，俯伏俟罪，契丹主命起之，亲自慰抚。契丹主遂入大内，至昏出宫，是夜宿于赤堈。契丹主下诏，应晋朝臣僚一切仍旧，朝廷仪制并用汉礼。戊子，杀郑州防御使杨承勋，责以背父之罪，令左右脔割而死。",
    "及景嗣位，累遷至中書舍人。晉開運末，閩越大亂，景遣謐與諫議大夫陳覺乘傳安撫，謐遂矯詔發數郡兵攻福州。及敗，引佩刀自刺，親吏制之，不死，長流舒州。",
    "其后权以谗邪，数责让陆议，议愤恚致卒。",
    "其秋，秦使甘茂攻我宜阳。五年，秦拔我宜阳，斩首六万。秦武王卒。",
    "政和末，卒，年七十。",
    "癸巳，赠太傅马燧祔庙，命所司供少牢祭，仍给卤簿，从宅至庙。十二月庚辰，右龙武统军韩游瑰卒。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "谚曰：树稼，达官怕。必有大臣当之，吾其死矣。十一月薨，时年六十三。上闻之，号叫失声，左右皆掩涕。",
    "神册三年，曷鲁薨，命觌烈为迭剌部夷离堇，属以南方事。会讨党项，皇太子为先锋，觌烈副之。",
    "詔改太府少卿，遷顯謨閣、知太平州，調江西轉運使。嘉定十一年卒於官，年六十四。",
    "回鹘可汗王仁美进野马、独峰驼、玉团、冈砂等方物。甲戌，永寿长公主薨，辍朝一日。故泾州节度观察留后卢顺密赠右骁卫上将军。丁丑，诏禁止私下打造铸泻铜器。",
    "荊、湘既平，加檢校太尉。是冬，卒，年五十一。初，延釗與太祖友善，顯德末，太祖任殿前都點檢，延釗為副，常兄事延釗；及即位，每遣使勞問，猶以兄呼之。",
    "广汉殇王广德，年二岁薨。咸宁初追加封谥，齐王攸以第五子赞绍封。薨，攸更以第二子寔嗣广德。乐安平王鉴，字大明，初封临泗亭侯。",
    "曣晛沾濡，柔润中畿。长享丰年，福禄永绥。及帝女万年公主薨，帝痛悼不已，诏芬为诔，其文甚丽。",
    "二十四年，宋缪公卒，公子冯奔郑。",
    "乙巳，葬霸陵。赞曰：孝文皇帝即位二十三年，宫室、苑囿、车骑、服御无所增益。有不便，辄弛以利民。",
    "名，自命也；物，自定也。今適庶名反逆，此後晋其能毋乱乎？二十七年，穆侯卒，弟殇叔自立，太子仇出奔。殇叔三年，周宣王崩。",
    "岳卒于正德十三年，主孀居三十一年始薨。长泰公主，成化二十三年薨，追册。仙游公主，弘治五年薨，追册。孝宗三女太康公主，弘治十一年薨，未下嫁。",
    "加泚实封五百户，赐窦氏名园、泾水上腴田及锦彩金银器，以安其意，时滔叛故也。壬午，贬御史大夫严郢为费州长史，杖杀左巡使、殿中侍御史郑詹。郢岁余卒。五月丙戌，增两税、盐榷钱，两税每贯增二百，盐每斗增一百。",
    "出为武定军节度使，及代，军民请留。后同知枢密院事，兼南府宰相、门下侍郎、平章事。致仕，卒。追赠中书令，谥文宪。",
    "五月辛卯，杀鹿人札葛。壬辰，北府宰相萧海璃薨，辍朝，罢重五宴。六月己未，支解雉人寿哥、念古，杀鹿人四十四人。是夏，驻跸褭潭。",
    "戊戌，曹州防御使石晖卒，帝之从弟也。礼官奏：天子为五服之内亲本服周者，三哭而止。",
    "坐漏泄禁中语，左授司刑少卿，出为并州长史。道病卒，赠相州刺史。",
    "三月壬申，葬肃皇帝于永陵。乙酉，土蛮犯辽阳，指挥王承德战殁。夏四月丙戌朔，享太庙。",
    "郤子无基。且先君之嗣卿也，受命以求师，将社稷是卫，而惰弃君命也，不亡何为！十七年，郤氏亡。成公十三年，诸侯朝王，遂从刘康公伐秦。成肃公受脤于社，不敬。",
    "崇道及三子并杖死于都亭驿，门生亲友皆决杖流贬。时得罪多是知名之士，四海冤之。",
    "朝廷莫不称之。视事二年，以地震策免。岁余，复代陈蕃为太尉。建宁元年薨。",
    "」明年被疾，詔遣中使將太醫診視。六年，卒，年五十九。",
    "号谥不称，其议尊号。丞相臣平等请尊昭灵夫人曰昭灵后，武哀侯曰武哀王，宣夫人曰昭哀后，六月，赵王恢自杀。",
    "坚薨，贲摄帅余众，扶送灵柩。后袁术徙寿春，贲又依之。术从兄绍用会稽周昂为九江太守，绍与术不协，术遣贲攻破昂于阴陵。术表贲领豫州刺史，转丹杨都尉，行征虏将军，讨平山越。",
    "郑綮罢。李茂贞陷阆州。八月，杨守亮伏诛。癸巳，减京畿、兴元、洋金商州赋役。",
    "不食三日，至鹿邑自缢。",
    "癸酉，帝崩于紫檀殿。在位三十五年，寿八十。",
    "居二年，徐绍吉、韩浚以京察夺其官。庭再迁郎中，被齮龁。引退，抑郁以死。又有闻喜李俸者，为刑部郎中。",
    "会卒，高祖甚伤惜之，赠鸿胪卿。初，大雅在隋，与颜思鲁俱在东宫，彦博与思鲁弟愍楚同直内史省，彦将与愍楚弟游秦典校秘阁。",
    "摄政八年而尧崩。三年丧毕，让丹朱，天下归舜。",
    "无子，弟新宁王鼐钧嗣，薨。子康王鼎渭嗣，崇祯二年薨。再传至孙传齐。",
    "及太祖北征，以候骑之误，落然无所具，而复壁垒荒圮，帑廪空竭，太祖怒，贬柳州司户，寻赐死于相州。《通鉴》：开化元年丙午，至相州，刺史李思安不意帝猝至，落然无具，坐削官爵。二年正月丁卯，帝至获嘉，追思李思安去岁供馈有阙，贬柳州司户，寻长流思安于崖州，赐死。邓季筠，宋州下邑人也。",
    "永初元年，太后封宋衍为盛乡侯，分清河为二国，封庆少子常保为广川王，子女十一人皆为乡公主，食邑奉。明年，常保薨，无子，国除。虎威立三年薨，亦无子。",
    "十二年春二月，亮由斜谷出，始以流马运。秋八月，亮卒渭滨。",
    "己酉，南府宰相赵徽致仕。秋七月戊辰，如秋山。癸酉，柳城郡王霞抹薨。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。",
    "引疾去，卒于家。先是，杨应龙伏诛，贵州宣慰使安疆臣邀据故所侵地。",
    "蔡国公张珪卒。植万岁山花木八百七十本。"
  ],
  "日常/命令事件": [
    "十二月，公入平原，略定诸县。十年春正月，攻谭，破之，斩谭，诛其妻子，冀州平。一下令曰：其与袁氏同恶者，与之更始。令民不得复私雠，禁厚葬，皆一之于法。",
    "時呂頤浩節制建業，劉光世領兵鎮江，浚遣人齎蠟書，約頤浩、光世以兵來會，而命俊分兵扼吳江。上疏請復辟。傅等謀除浚禮部尚書，命將所部詣行在，浚以大兵未集，未欲誦言討賊，乃託云張俊驟回，人情震讋，不可不少留以撫其軍。會韓世忠舟師抵常熟，張俊曰：世忠來，事濟矣。",
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "粤明日，追谥曰贞懿皇后，殡于内殿之西阶。十三年十月癸酉，乃命门下侍郎、同平章事常衮持节册命。以其月二十五日丁酉，迁座于庄陵，礼也。",
    "以左侍郎王业浩署部事，命中官罗维宁监督通、津、临、德军务，而宣大总督梁廷栋亦统兵入援。",
    "帝寻命桑维翰诣诸道求援，契丹遣人复书诺之，约以中秋赴义。",
    "六年，詔諸道試官皆隔一郡選差，後又令歷三郡合符乃聽入院，防私弊也。帝欲令文士能射御，武臣知詩書，命討論殿最之法。",
    "壬寅，营于滹沱北，诏休哥以骑兵绝宋兵，毋令入邢州；命太师王六谨侦候。癸卯，小校曷主遇宋辎重，引兵杀获甚众，并焚其刍粟。甲辰，诏南大王与休哥合势进讨，宰相安宁领迪离部及三克军殿。上率大军与宋将刘廷让、李敬源战于莫州，败之。",
    "及察割作乱，遣人报朗曰：事成矣！朗遣详稳萧胡里以所部军往，命曰：当持两端，助其胜者。穆宗即位，伏诛，籍其家属。",
    "此大夫命其妾子，以为母所慈，犹曰贵父命，为之三年，况天子命其子为列国王，命其所生母为国太妃，反自同公子为母练冠之与大功乎？轻重颠倒，不可之甚者也。《传》曰：始封之君，不臣诸父昆弟，则当服其亲服。若鲁卫列国，相为服期，判无疑矣。何以明之？《丧服》：君为姑姊妹女子嫁于国君者，《传》曰：何以大功？尊同也。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "子蒲，袭爵。后有大功，及宠幸贵臣薨，赙送终礼，皆依俊故事，无得逾之者。初，俊既卒，太宗命其妻桓氏曰：夫生既共荣，没宜同穴，能殉葬者可任意。桓氏乃缢而死，遂合葬焉。",
    "以得功及中军游击祖大寿为前锋，令会秉忠赴援，廷弼亦遣使督渠进战，遇大清兵于平阳。得功怀异志，欲引去。乃分兵为左右翼，稍却，推渠、秉忠前。",
    "麟奉命，遣使谢罪，而诉安平、思陵土官侵掠思郎。帝令守臣严饬。七年，安南贡使还，令赍皮弁冠服、金织袭衣赐其王。是岁，麟卒，私谥太宗。",
    "宋攻夏，李乾顺遣使求和解，帝命俨如宋平之，拜参知政事。",
    "时令吏民罪徒流者耕北京闲田，监禁详拟，往复待报，多瘐死。新请从北京行部或巡按详允就遣，以免淹滞。从之。",
    "召张柔及其子弘范率兵二千诣京师。丙午，命诸王合必赤总督诸军，以不只爱不干及赵璧行中书省事于山东，宋子贞参议行中书省事，以董源、高逸民为左右司郎中，许便宜从事。真定、顺天、河间、平滦、大名、邢州、河南诸路兵皆会济南。以中书左丞阔阔、尚书怯烈门、宣抚游显行宣慰司于大名，洺滋、怀孟、彰德、卫辉、河南东西两路皆隶焉。",
    "太祖以云南险僻，不欲用兵。明年正月，北平守将以所得王遣往漠北使者苏成来献，太祖乃命待制王祎赍诏偕成往招谕。王待祎以礼。会元嗣君遣使脱脱来征饷，脱脱疑王有他意，因胁以危语。",
    "廷议令良玉将昌平兵往剿，大指专办河南。",
    "辛酉，孛来上书乞和。九月壬戌，京师地震有声。冬十月壬申，以西边用兵，令河南、山西、陕西士民纳马者予冠带。",
    "大同初，新喻侯萧映为吴兴太守，甚重高祖，尝目高祖谓僚佐曰：此人方将远大。及映为广州刺史，高祖为中直兵参军，随府之镇。映令高祖招集士马，众至千人，仍命高祖监宋隆郡。所部安化二县元不宾，高祖讨平之。",
    "久之，召拜刑部尚书。开元九年，上幸东都，令充京师留守。",
    "亮亦与达书曰：部分如流，趋舍罔滞，正方性也。其见贵重如此。八年，迁骠骑将军。以曹真欲三道向汉川，亮命严将二万人赴汉中。",
    "八月丁酉，命开平守臣释奠于宣圣庙。成宗即位，诏曲阜林庙，上都、大都诸路府州县邑庙学、书院，赡学土地及贡士庄田，以供春秋二丁、朔望祭祀，修完庙宇。",
    "仍令文武百官于搢绅之内、草泽之中，知灼然有才器者，列名以奏。宴契丹册礼使于广政殿。戊戌，郓州奏，阳谷县界河决。",
    "后数日城陷，景思挺身而出，使人告于邻郡，得援军数百，逐其草寇，复有其城，亳民赖是以济。汉初，改授邓州行军司马，常郁郁不得志，后受代归阙。乾祐中，命景思为沿淮巡检使，屡挫淮贼。",
    "请遣风力科臣一人，与河漕诸臣定画一之计。乃命礼科给事中张企程往勘。而以水患累年，迄无成画，迁延糜费，罢应龙职为民，常居敬、张贞观、彭应参等皆谴责有差。",
    "再叙功，世荫外卫副千户，进副总兵。八年秋，命为援剿总兵官，督关外兵三千讨流贼。十月至河南，巡抚陈必谦、监纪推官汤开远令与左良玉抵灵宝，至则挫张献忠于焦村。",
    "景隆驰至德州，会兵进营河间。燕王闻之喜，语诸将曰：李九江，纨绮少年耳，易与也。遂命世子居守，戒勿出战，而自引兵援永平，直趋大宁。"
  ],
  "日常/交谈事件": [
    "明宗命王淑妃母之，尝谓左右曰：惟此兒生于皇宫，故尤所钟爱。长兴末，封许王。晋高祖即位，以皇后即其姊也，乃养从益于宫中。晋天福中，以从益为二王后，改封郇国公，食邑三千户。",
    "世言晋王之将终也，以三矢赐庄宗而告之曰：梁，吾仇也，燕王吾所立，契丹与吾约为兄弟，而皆背晋以归梁。此三者，吾遗恨也。与尔三矢，尔其无忘乃父之志！庄宗受而藏之于庙。其后用兵，则遣从事以一少牢告庙，请其矢，盛以锦囊，负而前驱，及凯旋而纳之。",
    "十二年，上谓宰臣曰：外路司吏，止论名次上下，恐未得人。若其下有廉慎、熟闲吏事，委所属保举。",
    "刘向曰：盛阳雨水，伤热，阴气胁之，则转而为雹。",
    "又進言乞都建康，謂：漢高入關中，光武守信都。",
    "帝曰：嘻，行此谋则无葬地矣！时郭崇韬劝帝亲御六军，直趋汴州，半月之间，天下可定。帝曰：正合朕意。",
    "時呂頤浩節制建業，劉光世領兵鎮江，浚遣人齎蠟書，約頤浩、光世以兵來會，而命俊分兵扼吳江。上疏請復辟。傅等謀除浚禮部尚書，命將所部詣行在，浚以大兵未集，未欲誦言討賊，乃託云張俊驟回，人情震讋，不可不少留以撫其軍。會韓世忠舟師抵常熟，張俊曰：世忠來，事濟矣。",
    "朕与卿等共治天下，事有可否，即当面陈。卿等致位卿相，正行道扬名之时，偷安自便，徼幸一时，如后世何？群臣皆称万岁。十二年，改沁南军节度使，召为翰林学士承旨。丞相石琚致仕，上问：谁可代卿者？琚对曰：伯雄可。",
    "德宗崩，礼仪使杜黄裳议：高宗在三昭三穆外，当迁。于是迁高宗而祔德宗，盖以中、睿为昭穆矣。",
    "洪武十二年诏郡县举元遗民。布政使沈立本密言子中于朝，以币聘。使者至，子中太息曰：死晚矣。",
    "顯言：乃者朝命以趙保吉修貢，邊城務使安靜，若今動衆開斥疆境，非便。議遂罷。",
    "然則為今之計當如何？曰：稍革舊制，大募豪勇，益外兵之籍，俾足以戰敵。以內兵為聲勢，重邊將之任，使專一軍之事，而不得連州郡之勢，斯可以獲近利而亡後害也。餘文多不錄。趙元昊寇定川堡，葛懷敏發涇原兵救之，源是時通判慶州，遺懷敏書曰：賊舉國而來，其利不在城堡，而兵法有不得而救者，宜駐兵瓦亭，擇利而後動。",
    "系三载，有为营救于嵩者。其党胡植、鄢懋卿怵之曰：公不睹养虎者耶，将自贻患。嵩颔之。",
    "对曰：刑官执法乃其职，未可深罪。帝默然久之，曰：朕亦知珪老成不易得，但此事太执耳。卒如珪议。正德元年六月，以年逾七十再疏求退，不允。",
    "及收至，谓兄曰：若死者有知，得见父母，岂非至愿！乃延颈就刑，颜色不变，莫不伤之。初，京兆人脂习元升，与融相善，每戒融刚直。及被害，许下莫敢收者，习往抚尸曰：文举舍我死，吾何用生为？操闻大怒，将收习杀之，后得赦出。魏文帝深好融文辞，每叹曰：杨、班俦也。",
    "婴入见，固辞谢病不足任。太后亦惭。於是上曰：天下方有急，王孙宁可以让邪？乃拜婴为大将军，赐金千斤。婴乃言袁盎、栾布诸名将贤士在家者进之。",
    "若按物力多寡赋之，募材勇骑射之士，不足则调兵家子弟补之，庶几官收实用，人无失职之患。上从之。海州捕贼八十余人，贼首海州人，其兄今为宋之军官。上闻之，谓宰相曰：宋之和好，恐不能久，其宿、泗间汉军，以女直军代之。",
    "权惜其功能，故不罪。使子异摄领部曲，令医视护，数月复遣还中洲。权自出祖送，谓曰：今寇虏尚存，王涂未一，孤当与君共定天下，欲令督五万人专当一面，以图进取，想君疾未复发也。桓曰：天授陛下圣姿，当君临四海，猥重任臣，以除奸逆，臣疾当自愈。",
    "即日见李昌符告曰：主上再有诏命，令促百僚前进。",
    "左右引逵使叩头，逵叱之曰：安有国家长吏为贼叩头！援怒，将斩之。绛吏民闻将杀逵，皆乘城呼曰：负要杀我贤君，宁俱死耳！左右义逵，多为请，遂得免。初，逵过皮氏，曰：争地先据者胜。及围急，知不免，乃使人间行送印绶归郡，且曰：急据皮氏。",
    "一子宗晖，开元初封湖阳郡王。初，重俊被害，宫府僚吏莫敢近者，永和丞甯嘉勖解衣裹重俊首号哭，时人义之。宗楚客闻而大怒，收付制狱，贬为平兴丞，寻卒。睿宗践祚，下制曰：宁嘉勖能重名节，事高栾、向，幽涂已往，生气凛然。",
    "上曰：先帝置孟舒云中十馀年矣，虏曾一人，孟舒不能坚守，毋故士卒战死者数百人。长者固杀人乎？公何以言孟舒为长者也？叔叩头对曰：是乃孟舒所以为长者也。",
    "又议金匮曰：登配之策，盛以金匮，归格艺祖之庙室。今请长短令容玉策，高广各六寸。形制如今之表函。",
    "崧幼聪敏，能文章，为镇州参军。唐魏王继岌为兴圣宫使，领镇州节度使，以推官李荛掌书记。崧谓掌书吕柔曰：魏王皇子，天下之望，书奏之职，非荛所当。",
    "万历五年，御史陈世宝言：仪真江口，去闸太远，请於上下十数丈许增建二闸，随湖启闭，以截出江之船，尽令入闸，庶免迟滞。疏上，议行。",
    "明年正月，有诏并封三王。孔兼与员外郎陈泰来合疏争曰：立嫡之训，自古有之。然历考祖宗以来，未有虚东宫之位以候嫡子者。昔陛下正位东宫，年甫六岁，仁圣皇太后方在盛年，先皇帝曾不少待，陛下岂不省记乎？地逼则嫌生，礼殊则分定。",
    "唯武骑虎贲服文衣，插雉尾于武冠上。史臣曰：应劭《汉官》释附蝉，及司马彪志并不见侍中与常侍有异，唯言左右珥貂而已。案项氏说云汉侍中蝉，刻为蝉像，常侍但为榼而不蝉，未详何代所改也。",
    "言者交攻之，遂下吏，貶秩四等，安置隨州。會侯可以言水利入見，神宗問其事，對曰：种諤奉密旨取綏而獲罪，後何以使人？帝亦悔，復其官。韓絳宣撫陝西，用為鄜延鈐轄。絳城囉兀，規橫山，令諤將兵二萬出無定川，命諸將皆受節度，起河東兵會銀州。",
    "义府勃然变色，腮颈俱起，徐曰：谁向陛下道此？上曰：但我言如是，何须问我所从得耶！义府睆然，殊不引咎，缓步而去。上亦优容之。初，五礼仪注，自前代相沿，吉凶毕举。",
    "里吏尝有过笞陈馀，陈馀欲起，张耳蹑之，使受笞。吏去，张耳乃引陈馀之桑下而数之曰：始吾与公言何如？今见小辱而欲死一吏乎？陈馀然之。秦诏书购求两人，两人亦反用门者以令里中。",
    "又詔：三省、樞密院獨班奏事日，無得過三班。若三省俱獨班，則樞密院當請奏事。其見任官召對訖，次日即朝辭回任聽旨。元祐中，宰臣呂大防言：昨垂簾聽政，惟許臺諫以二人同對，故不正之言無得以入。",
    "以目疾，代還，奉朝請，俄丁內艱。既而謂親友曰：僕齒髮遲暮，而未能辭祿仕者，良以慰母心爾，今可行其志矣。乃拜章請老，得千大將軍致仕。",
    "帝曰：左右多困乏，故有所赐，今通断之。又厨膳宜有减撤，思详具闻。严多所匡益。",
    "语未竟，帝曰：微汝言，几误疑赐。赐固善人，才短耳。命予葬祭。洪熙元年赠太子少保，谥文安。",
    "方崇闭塞之源，不慕钦明之术，虽抱睿哲之资，终罹罔念之咎。古人云：苦药利病，苦言利行。伏惟居安思危，日慎一日。",
    "仲山甫永怀，以慰其心。安谓有雅人深致。又尝内集，俄而雪骤下，安曰：何所似也？安兄子朗曰：散盐空中差可拟。道韫曰：未若柳絮因风起。",
    "子胥曰：王毋喜！王怒，子胥欲自杀，王闻而止之。越大夫种曰：臣观吴王政骄矣，请试尝之贷粟，以卜其事。",
    "帝曰：朕昔為元帥時，見州縣官以三年為任，猶且一年立威信，二年守規矩，三年則務收人情，以為去計。今止以二年為任，雖有葺治之心，蓋亦無暇矣，可如所奏。是時，歲以十五事考校監司，四善、四最考校縣令，違限不實者有罪。",
    "翱曰：卒死法，妻死夫，女死父，非杀也。命璟偿其家葬｛艹貍｝费，璟感激。后参将辽东，追敌三百里，事李秉为名将。十二年与总兵曹义等出塞，击兀良哈，擒斩百余人，获畜产四千六百，进右都御史。",
    "洪实言：出军讨逆，累发兵师，今闻小衄，无一人一骑来者。不如以禁军据门自固，彼安敢径来，然后徐图进取，全策也。义诚怒曰：若如此言，洪实反也。洪实曰：公自反，谁反！其声渐厉。",
    "庄宗失色，左右皆恐，群伶亦大惊骇，共持新磨诘曰：汝奈何批天子颊？新磨对曰：李天下者，一人而已，复谁呼邪！于是左右皆笑，庄宗大喜，赐与新磨甚厚。新磨尝奏事殿中，殿中多恶犬，新磨去，一犬起逐之，新磨倚柱而呼曰：陛下毋纵兒女啮人！庄宗家世夷狄，夷狄之人讳狗，故新磨以此讥之。",
    "益调民夫修完城郭，为战守备，按察司止之，不听，曰：治城，守臣事也，按察何预。既而兵至，以有备解去。",
    "趣刻印，先生因行佩之矣。食其未行，张良从外来谒。汉王方食，曰：子房前！客有为我计桡楚权者。",
    "文字往来，其间甚密。及裴度求觐，无计沮之，即令讦武昭事，以暴扬其迹。再荣既告，李仲言诫汇曰：言武昭与李程同谋则活，否则尔死。",
    "茂雨射营中，中霸前酒樽，霸安坐不动。军吏皆曰：茂前日已破，今易击也。",
    "先主曰：吾不忍也。乃驻马呼琮，琮惧不能起。琮左右及荆州人多归先主，此到当阳，众十余万，辎重数千两，日行十余里，别遣关羽乘船数百艘，使会江陵。或谓先主曰：宜速行保江陵，今虽拥大众，被甲者少，若曹公兵至，何以拒之？先主曰：夫济大事必以人为本，今人归吾，吾何忍弃去！曹公以江陵有军实，恐先主据之，乃释辎重，轻军到襄阳。",
    "帝不听，逮下诏狱。刑部尚书胡世宁言于朝曰：世宁司刑而杀忠臣，宁杀世宁。乃上疏为讼冤曰：番人变诈，妄腾谤讟，欲害我谋臣耳。夫其畜谋内寇，为日已久。",
    "故京师谚曰：万事不理问伯始，天下中庸有胡公。",
    "上曰：正此討論，故併三省盡依祖宗法。",
    "崇焕遂言：辽左之坏，虽人心不固，亦缘失有形之险，无以固人心。兵不利野战，只有凭坚城、用大炮一策。今山海四城既新，当更修松山诸城，班军四万人，缺一不可。",
    "宗明抗疏救，且曰：连坐非善政。今以一人妄言，必究主使，廷臣孰不惧？况名搒掠已极，当严冬或困毙，将为仁明累。帝大怒，谓宗明即其主使，并下诏狱，谪福建右参政。",
    "义熙八年正月庚戌，月犯岁星，在毕，占同上。七月癸亥，月奄房北第二星，占同上。甲申，太白犯填星，在东井。占曰：秦有大兵。",
    "立命中使宣旨，令送本军，孟容系之不遣。中使再至，乃执奏曰：臣诚知不奉诏当诛，然臣职司辇毂，合为陛下弹抑豪强。",
    "唐魏徵曰：兵在以道御之而已。御壮健足以无敌于天下，何取细弱以增虚数。",
    "宣以語侵傅，好問曉之曰：若屬忘家族，欲冒重圍衞上以出，誠忠義。然乘輿將駕，必甲乘無闕而後動，詎可輕邪？宣詘服曰：尚書真知軍情。",
    "钺饥困，匍匐道中。比归，父母相与言曰：有子不居家，在外作贼耳。辄复杖之，屡濒于死。",
    "乃更为椎髻，着布衣，操作而前。鸿大喜曰：此真梁鸿妻也。能奉我矣！字之曰德曜，名孟光。居有顷，妻曰：常闻夫子欲隐居避患，今何为默默？无乃欲低头就之乎？鸿曰：诺。",
    "崇本耻其妻见辱，因兹复贰于太祖。乃遣使告茂贞曰：硃氏兆乱，谋危唐祚，父为国家磐石，不可坐观其祸，宜于此时毕命兴复，事苟不济，死为社稷可也。",
    "林甫典选部时，选人严迥判语有用杕杜二字者，林甫不识杕字，谓吏部侍郎韦陟曰：此云杖杜，何也？陟俯首不敢言。",
    "嘗監西京稅院事，留守晏殊、夏竦皆謂曰：子有清識雅度，文約而理盡，卿相才也。知新息縣，累遷太常博士。",
    "方斗时，杰潜师捣仪真，得功兵颇伤，而所俱行三百骑皆殁。遂诉于朝，愿与杰决一死战。可法命监军万元吉和解之，不可。会得功有母丧，可法来吊，语之曰：土桥之役，无智愚皆知杰不义。",
    "裕答言：洛是晋之旧京，而羌姚据之。",
    "太祖曰：一战而胜，遂称大号，何示人浅也。进军宁江州，诸军填堑攻城。宁江人自东门出，温迪痕、阿徒罕邀击，尽殪之。",
    "成宗大德八年正月，御史台臣言：各处站赤合用祗应官钱，多不依时拨降，又或数少不给，遂令站户输当库子，陪备应办。",
    "密又顿首曰：敬闻命矣，请奉以周旋。及征化及还，而王世充已杀元文都等，权兵专制。",
    "温责让卓，卓应对不顺。坚时在坐，前耳语谓温曰：卓不怖罪而鸱张大语，宜以召不时至，陈军法斩之。温曰：卓素着威名于陇蜀之间，今日杀之，西行无依。坚曰：明公亲率王兵，威震天下，何赖于卓？观卓所言，不假明公，轻上无礼，一罪也。",
    "初，田令孜之为监军也，盗唐传国玺入于蜀而埋之，二月，尚食使欧阳柔治令孜故第，穿地而得之，以献。五月，梁遣光禄卿卢玭来聘，推建为兄，其印文曰大梁入蜀之印。宰相张格曰：唐故事，奉使四夷，其印曰大唐入某国之印，今梁已兄事陛下，奈何卑我如夷狄？建怒，欲杀梁使者，格曰：此梁有司之过尔，不可以绝两国之欢。",
    "论曰：意气之感，士所不能忘也。",
    "敬玄自以素非边将之才，固辞。高宗谓曰：仁轨若须朕，朕即自往，卿不得辞也。竟以敬玄为洮河道大总管，兼安抚大使，仍检校鄯州都督，率兵以御吐蕃。及将战，副将工部尚书刘审礼先锋击之。",
    "明年，张士诚将吕珍围安丰，林儿告急于太祖。太祖曰：安丰破则士诚益强。遂亲帅师往救，而珍已入城杀福通。太祖击走珍，以林儿归，居之滁州。",
    "记室房玄龄曰：府僚去者虽多，盖不足惜。杜如晦聪明识达，王佐才也。若大王守籓端拱，无所用之；必欲经营四方，非此人莫可。",
    "后虽假手凶徒，可谓罪人斯得。朝廷议加荣赠，不其僭乎！有晋之刑政陵夷，用此道也。周访器兼文武，任在折冲，戡定湘、罗，克清江、汉，谋孙翼子，杖节拥旄，西蜀仰其威风，中兴推为名将，功成名立，不亦美乎！孟威陷迹虏廷，抗辞伪主，虽图史所载，何以加焉！赞曰：平西果劲，始邪末正。",
    "时行省参知政事胥持国、马琪言：已至光禄村周视堤口。以其河水浸漫，堤岸陷溃，至十余里外乃能取土。",
    "二年三月，疏言：诸边年例，自辽饷外，为银三百二十七万八千有奇。今蓟、密诸镇节省三十三万，尚应二百九十四万八千。统计京边岁入之数，田赋百六十九万二千，盐课百一十万三千，关税十六万一千，杂税十万三千，事例约二十万，凡三百二十六万五千有奇。",
    "仁宗嘗問輔臣曰：或謂先朝詔令不可輕改，信然乎？王曾曰：此憸人惑上之言也。",
    "徙为上谷太守，匈奴日以合战。典属国公孙昆邪为上泣曰：李广才气，天下无双，自负其能，数与虏敌战，恐亡之。於是乃徙为上郡太守。後广转为边郡太守，徙上郡。",
    "于是巡抚徐兆魁言：调永顺兵八千，费逾十万，今奔溃，虚糜无益。",
    "固出語執政曰：及上有意，宜亟圖之，以福天下。既而竟從安石。固復領銀臺司。",
    "植雜木數萬，曰：異時樓櫓之具，可不出於民矣。",
    "因醉或有怨言，不能自保。高祖谓群臣曰：文静此言，反明白矣。李纲、萧瑀皆明其非反。",
    "州倅暨从吏坚请还，元毅曰：我辈责任边守，遇敌而奔，其如百姓何？纵得自安，复何面目见朝廷乎！遂执弓矢令众。",
    "湣公自罪曰：寡人以不能事鬼神，政不脩，故水。臧文仲善此言。此言乃公子子鱼教湣公也。十年夏，宋伐鲁，战於乘丘，鲁生虏宋南宫万。",
    "兆轻兵倍道从河梁西涉渡，掩袭京邑。先是，河边人梦神谓己曰：尔朱家欲渡河，用尔作氵垒波津令，为之缩水脉。",
    "是月，昌齡遷工部侍郎。八月己亥，都水監言：大河以就三山通流，正在通利之東，慮水溢為患。乞移軍城於大伾山、居山之間，以就高仰。",
    "又次请期。辞曰：询于龟筮。某月某日吉，制使某告期。",
    "太傅许靖、安汉将军麋竺、军师将军诸葛亮、太常赖恭、光禄勋黄权黄柱、少府王谋等上言：曹丕篡弑，湮灭汉室，窃据神器，劫迫忠良，酷烈无道。人鬼忿毒，咸思刘氏。今上无天子，海内惶惶，靡所式仰。",
    "及洪累授方镇，纳赂不满士良之志，士良怒，遣人上书论洪非太后之亲，又以萧本者为太后弟。从谏深知内宫之故，乃自潞府飞章论之曰：臣闻造伪以乱真者，匹夫知之尚不可，况天下皆知乎？执疏以为亲者，在匹夫之家尚不可，况处大国之朝乎？臣受国恩深，奉公心切，知有此失，安敢不言！伏唯皇帝陛下仁及万方，孝敦九族，而推心无党，唯理是求。微臣所以不避直言，切论深事。",
    "开运四年，希范卒，年四十九，谥曰文昭。希广立。希广字德丕，希范同母弟也。希范平生恶拓拔常谏诤，常入谒，希范呼阍者指常曰：吾不欲见此人，勿复内也。",
    "继麟曰：郭公功倍于我，尚为人构陷，吾若得面天颜，自陈肝膈，则流言者获罪矣。四年正月，继麟入觐。景进谓庄宗曰：河中人有告变者，言继麟与崇韬谋叛，闻崇韬死，又与李存乂构松逆，当断不断，祸不旋踵。群阉异口同辞，庄宗骇惑不能决。",
    "时高拱当国，路楷、杨顺以构杀沈炼论死。拱欲为楷地，谓顺首祸，顺死，楷可勿坐。化取狱牍示拱曰：狱故无炼名。",
    "守恩杀契丹使者，举镇来降。《宋史·李万超传》云：张从恩将弃城归契丹，会前骁卫将军王守恩服丧私第，从恩即委以后事遁去。及契丹使至，专领郡务，守恩遂无所预，万超奋然谓其部下曰：我辈垂饵虎口，苟延旦夕之命，今欲杀使保其城，非止逃生，亦足建勋业，汝曹能乎？众皆跃然喜曰：敢不唯命。遂率所部大噪入府署，杀其使，推守恩为帅，列状以闻。",
    "誼至雲中，與粘罕、兀室論事，不少屈。金人諭亟還，誼曰：萬里銜命，兼迎兩宮，必俟得請。金人乃令蕭慶授書，併以風聞事責誼，誼詰其所自，金人以實告，乃還。至南京，劉豫留之，以計得歸。",
    "高祖曰：先贤后哲，顿在一门。",
    "代王谢曰：至代邸而议之。遂驰入代邸。群臣从至。",
    "后喜曰：汉人中，惟王郎最忠孝。",
    "秦武王元年，群臣日夜恶张仪未已，而齐让又至。张仪惧诛，乃因谓秦武王曰：仪有愚计，原效之。",
    "明宗立，益面縛請罪，明宗曰：爾盡忠節，又何罪也。改本直左廂都校。",
    "或谓沔曰：今之中书，皆是宰相承宣制命。侍郎虽是副贰，但署位而已，甚无事也。沔曰：不然。设官分职，上下相维，各申所见，方为济理。",
    "哲宗怒曰：此是何言也！使徐王聞之，豈能自安？黜秩知廣德軍，敕銀臺毋受雍辭去奏章，東府吏毋聽雍妻子輒出，且令學士錢勰善為留詔。二年，始以資政殿學士知陳州，徙北京留守。",
    "温曰：何以知之？答曰：天子姓刘，故以此知之。温曰：日生于东乎？宓曰：虽生于东而没于西。答问如响，应声而出，于是温大敬服。宓之文辩，皆此类也。",
    "琰曰：此人才足拔萃，然地寒寿促，不足展其器用，不可与婚。遂止。其人数年果亡。",
    "百姓歌之曰：萧何为法，若画一；曹参代之，守而勿失。载其清净，民以宁一。",
    "古人语曰：非常之原，黎民惧焉，及其成功，天下晏然。",
    "筑图苏湖城，作迎驾殿。秋八月，陈时可、高庆民等言诸路旱蝗，诏免今年田租，仍停旧未输纳者，俟丰岁议之。",
    "时刘景仙、郭正一、皇甫文亮、杨思征、薛元超各有所奏。祎之时为中书舍人，对曰：臣观自古明王圣主，皆患夷狄。吐蕃时扰边隅，有同禽兽，得其土地，不可攸居，被其凭凌，未足为耻。愿戢万乘之威，且宽百姓之役。",
    "皇太后诏有司复长安南北郊。四月己卯，葬延陵。赞曰：臣之姑充后宫为婕妤，父子昆弟侍帷幄，数为臣言：成帝善修容仪，升车正立，不内顾，不疾言，不亲指，临朝渊嘿，尊严若神，可谓穆穆天子之容者矣！博览古今，容受直辞。公卿称职，奏议可述。",
    "邓太后复立乐安王宠子延平为清河王，是为恭王。太后崩，有司上言：清河孝王至德淳懿，载育明圣，承天奉祚，为郊庙主。汉兴，高皇帝尊父为太上皇，宣帝号父为皇考，序昭穆，置园邑。大宗之义，旧章不忘。",
    "禮院亦言：對越天地，神無二主。",
    "高祖崩，梓宫达鲁阳，乃行遗诏。北海王详奉宣遗旨，长秋卿白整等入授后药。后走呼不肯引决，曰：官岂有此也，是诸王辈杀我耳！整等执持，强之，乃含椒而尽。殡以后礼。",
    "崔协强言于坐曰：臣闻食医心镜，酒极好，不加药饵，足以安心神。",
    "二使到日，水即大至，父老驚嘆，以為中興之祥。十年三月，禮部言：池州銅陵縣丞呂和問進宮陵儀制，望付太常寺以備檢照。永安軍等處今已收復，遂委知軍詣諸陵逐位檢視，除永定、永昭、永厚、永裕、永泰陵園廟並無損動，內永安、永昌、永熙陵神臺璺裂，未敢一面擅行補飾。",
    "业乃叹曰：危国不入，乱国不居。",
    "末年，御史潘一桂言：增中商茶颇壅滞，宜裁减十四五。",
    "诸兄更谓威曰：昔孔子积学成圣，犹狼狈当时，栖迟若此，汝效此道，复欲何求？名位不达，固其宜矣。威笑而不答。久之，蜀王秀辟为记室，以秀行事多不法，称疾还田里。",
    "子不语：怪，力，乱，神。子贡曰：夫子之文章，可得闻也。",
    "而師閔榷利，尤刻於前，建言：文、階州接連，而茶法不同，階為禁地，有博馬、賣茶場，文獨為通商地。",
    "太公退，又行之于齐。至管仲相桓公，通轻重之权，曰：岁有凶穰，故谷有贵贱；令有缓急，故物有轻重。人君不理，则畜贾游于市，乘民之不给，百倍其本矣。",
    "帝谓于谦曰：大同，吾藩篱也。",
    "若勒留承应，累其资考，令至正五品可乎？皆曰：善。",
    "冯道等上笺劝进，帝立谓群臣曰：予之此行，事非获已，当俟主上归阙，园陵礼终，退守籓服。诸公言遽及此，信无谓也。卫州刺史王宏贽奏，闵帝以前月二十九日至州。癸酉，皇太后下令降闵帝为鄂王。",
    "既而元言曰：自天地分判，五行施则，人之所崇，莫重于孝顺。然五孝六顺，天下之所先，愿陛下重之，以化四方。臣既衰老，不究远趣，心耳所及，敢不尽诚。",
    "上嘗語近臣曰：放為朕言事甚衆，但外廷無知者。因出所上時議十三篇，其目曰：議道、議德、議刑、議器、議文武、議制度、議教化、議賞罰、議官司、議軍政、議獄訟、議征賦、議邪正。八年十一月乙丑，晨興，忽取前後章疏稿悉焚之，服道士衣，召諸生會飲於次，酒數行而卒。訃聞，上甚嗟悼，親制文遣內侍朱允中致祭。",
    "太祖闻而召佗，佗常在左右。太祖苦头风，每发，心乱目眩，佗针鬲，随手而差。李将军妻病甚，呼佗视脉曰：伤娠而胎不去。将军言：闻间实伤娠，胎已去矣。",
    "旋改吏部侍郎，分知铨事，而圭素保廉守节，大著公平之誉。圭前为河南少尹日，有嵩山术士遗圭石药如斗，谓圭曰：服之可以延寿，然不可中辍，辍则疾作矣。",
    "县三十三：大名、元城、馆陶、夏津、武城、历亭、监清、吴桥、将陵、东光、南皮、清池、靖海、兴济、会川、交河、乐寿、武强、安阳、汤阴、监漳、成安、滏阳、内黄、黎阳、卫、苏门、获嘉、新乡、汲、潞、武清、香河、漷阴。十二月，通济河创设巡河官一员，与天津河同为一司，通管漕河闸岸，止名天津河巡河官，隶都水监。八年六月，通州刺史张行信言：船自通州入闸，凡十余日方至京师，而官支五日转脚之费。遂增给之。",
    "神武以帝非常人，曰：此小兒眼目异。",
    "今当复活，慎无葬也。其父祝之曰：若尔有命复生，岂非骨肉所愿！今但欲还家，不尔葬也。",
    "述谓延岑曰：事当奈何！岑曰：男儿当死中求生，可坐穷乎！财物易聚耳，不宜有爱。述乃悉散金帛，募敢死士五千余人，以配岑于市桥，伪建旗帜，鸣鼓挑战，而潜遣奇兵出吴汉军后，袭击破汉。汉堕水，缘马尾得出。",
    "丁酉，彦威至青州，追擒之。有司上言：庄宗祔庙，懿祖祧迁，准例舍故而讳新，懿祖例不讳，忌日不行香。从之。壬子，襄州节度使刘训加检校太傅，以伪蜀右仆射、中书侍郎、平章事、赵国公张格为太子宾客，充三司副使，从任圜请也。",
    "定其成議，則民心固而河之順復有時，可以保其無害。詔：令吳安持同都水監丞鄭佑，與本路安撫、轉運、提刑司官，具圖、狀保明聞奏，即有未便，亦具利害來上。三月癸酉，監察御史郭知章言：河復故道，水之趨東，已不可遏。近日遣使按視，逐司議論未一。",
    "忌前一日，不御正殿，百官奉慰，著之令甲。乃作新廟兩廟間，名曰奉慈。慶曆四年，從呂公綽言：先帝特謚二后莊懷、莊穆，及上真宗文明武定章聖元孝之謚，郭后升祔，當正徽號，宜於郊禮前遣官先上寶、冊，改『莊』為『章』，止告太廟，更不改題。",
    "欢乐和合，有可贵者。震入吴界，移关候曰：东之与西，驿使往来，冠盖相望，申盟初好，日新其事。东尊应保圣祚，告燎受符，剖判土宇，天下响应，各有所归。",
    "帝据胡床拔剑作色，子升乃为敕曰：前持心血，远以示王，深冀彼此共相礼悉。而不良之徒，坐生间贰。",
    "今遽下诏狱，终于国体有伤。帝怒甚，曰：法司锦衣皆刑官，何公何私？且罪一二言官，何遽伤国体？有如贪赃坏法，欺君罔上，皆可不问乎？宗周曰：锦衣，膏粱子弟，何知礼义？听寺人役使。即陛下问贪赃坏法，欺君罔上，亦不可不付法司也。",
    "尝有亲客，久阔不复来，广问其故，答曰：前在坐，蒙赐酒，方欲饮，见杯中有蛇，意甚恶之，既饮而疾。于时河南听事壁上有角，漆画作蛇，广意杯中蛇即角影也。复置酒于前处，谓客曰：酒中复有所见不？答曰：所见如初。",
    "一元曰建，二元以长星曰光，三元以郊得一角兽曰狩云。其明年冬，天子郊雍，议曰：今上帝朕亲郊，而后土无祀，则礼不答也。",
    "劾奏平章政事仆散揆。或曰：与宰相有隙，奈何？伯嘉曰：职分如此。",
    "文武皆不足信，乃专任一二内臣，阃以外次第委之。自古未有宦官典兵不误国者。又劾马世龙、张凤翼、吴阿衡等罪，忤帝意。三年以疾在告，进祈天永命之说，言：法天之大者，莫过于重民命，则刑罚宜当宜平。",
    "中敏上言曰：仍岁大旱，非圣德不至，直以宋申锡之冤滥，郑注之奸弊。今致雨之方，莫若斩郑注而雪申锡。士大夫皆危之，疏留中不下。明年，中敏谢病归洛阳。",
    "须贾曰：吾马病，车轴折，非大车驷马，吾固不出。范睢曰：原为君借大车驷马於主人翁。范睢归取大车驷马，为须贾御之，入秦相府。",
    "承业虑质被祸，因乘间谓庄宗曰：卢质多行无礼，臣请为大王杀之，可乎？庄宗曰：予方招礼贤士，以开霸业，七哥何言之过也！承业因耸立而言曰：大王若能如此，何忧不得天下！其后卢质虽成纵诞，庄宗终能容之，盖承业为之藻藉也。十八年，庄宗受诸道劝进，将纂帝位。",
    "时中外讹言帝复南幸，韬因显颂勋，言：六飞南狩时，臣下多纳贿不法。文官惟袁宗儒，武官惟郭勋不受馈。",
    "世祖曰：无此人忿朕，当有数千口死矣。浩竟族灭，余皆身死。",
    "丙子，诏曰：工商皁隶，各有厥分，而有司纵滥，或染清流。",
    "紥八等见窝斡，以上意谕之。窝斡已约降，已而复谓紥八曰：若降，尔能保我辈无事乎？紥八曰：我知招降耳，其他岂能必哉。",
    "帝曰：此议是也，其勿施行。以作着诏下藏之台阁，永为后式。",
    "及光武引见，党伏而不谒，自陈愿守所志，帝乃许焉。博士范升奏毁党曰：臣闻尧不须许由、巢父，而建号天下；周不待伯夷、叔齐，而王道以成。伏见太原周党、东海王良、山阳王成等，蒙受厚恩，使者三聘，乃肯就车。及陛见帝廷，党不以礼屈，伏而不谒，偃蹇骄悍，同时俱逝。",
    "上悚然。趙汝愚同侍經筵，退語人曰：讜直如此，吾黨不逮也。",
    "廷珪佯不晓，曰：吾何德，敢受令公拜乎！及见，卒不肯加礼。入梁为礼部尚书。",
    "欽宗曰：無逾於卿。遂以時兼國子祭酒。首言：三省政事所出，六曹分治，各有攸司。今乃別辟官屬，新進少年，未必賢於六曹長貳。",
    "郑大夫石癸曰：吾闻姞姓乃后稷之元妃，其後当有兴者。子兰母，其後也。且夫人子尽已死，馀庶子无如兰贤。",
    "竟时在南阳，与龚书晓之曰：君执事无恙。走昔以摩研编削之才，与国师公从事出入，校定秘书，窃自依依，末由自远。盖闻君子愍同类而伤不遇。",
    "其辞曰：冲漠公子，含华隐曜，嘉遯龙蟠，超世高蹈，游心于浩然，玩志乎众妙，绝景乎大荒之遐阻，吞响乎幽山之穷奥。于是徇华大夫闻而造焉。乃整云辂，骖飞黄，越奔沙，辗流霜，陵扶摇之风，蹑坚冰之津，旌拂霄崿，轨出苍垠，天清泠而无霞，野旷朗而无尘，临重岫而揽辔，顾石室而回轮。遂适冲漠公子之所居。",
    "五日平明，良往。父已先在，怒曰：与老人期，後，何也？去，曰：後五日早会。五日鸡鸣，良往。父又先在，复怒曰：後，何也？去，曰：後五日复早来。",
    "呜呼！千里之差，兴自毫端，失得之源，百世不磨矣。赞曰：匈奴既分，羽书稀闻。野心难悔，终亦纷纭。",
    "先是，知揚州鄭良嗣言：兩淮民田，廣至包占，多未起稅。",
    "武德使史彦琼者，以伶官得幸，帝待以腹心之任，都府之中，威福自我，正言以下，皆胁肩低首，曲事不暇。由是政无统摄，奸人得以窥图。洎郭崇韬伏诛，人未测其祸始，皆云：崇韬已杀继岌，自王西川，故尽诛郭氏。先是，有密诏令史彦琼杀硃友谦之子澶州刺史建徽。",
    "赞曰：孝哀自为籓王及充太子之宫，文辞博敏，幼有令闻。",
    "胡具以告言琰，琰坐下狱，有司议曰：卒非挝妻之人，面非受履之地。琰竟弃市。自是大臣妻母朝庆遂绝。魏延字文长，义阳人也。",
    "刘向曰：凡雨，阴也，雪又雨之阴也。出非其时，迫近象也。晋穆帝永和三年八月，冀方大雪，人马多冻死。永和五年六月，临漳暴风震霆，雨雹大如升。",
    "琳少子文，骠骑谘议参军史臣曰：夫太刚则折，至察无徒，以之为政，则害于而国；用之行己，则凶于乃家。诚以器乖容众，非先王之道也。大连司宪，阴候主情，当约法之秋，献斫棺之议。",
    "宪宗曰：德舆乃有此佳婿。",
    "文帝未立世子，有意于齐献王攸。武帝时为中抚军，惧不立，以相貌示裴秀，秀言于文帝曰：中抚军振发籍地，垂手过膝，天表如此，非人臣之相也。由是得立。",
    "或曰：兴亡在运，非止上流。岂创制不殊，而弘之者异也。",
    "德武将与裴别，谓曰：燕婉始尔，便事分离，方远投瘴疠，恐无还理。尊君奏留，必欲改嫁耳，于此即事长诀矣！裴泣而对曰：妇人事夫，无再醮之礼。",
    "葬明德皇后于坤厚陵，诸妃皆祔，自磐宁宫发引，赵王惟中以其母挽车先发，令张黄盖者前行，帝呼执盖者不应，少府监张仅言欲奏其事，帝止之。尝作《重光座铭》，及刻座右铭于小玉碑，并刻其碑阴，皆深有理致。最善射而不殚物，尝奉诏拜陵，先猎，射一鹿获之，即命罢猎，曰：足奉祀事，焉用多杀？好生盖其天性云。赞曰：辽王杲取中京，宗翰、宗望皆从，景宣别领合紥猛安。",
    "章惇家以其同里，宛轉請文飾其傳，樞曰：子厚為相，負國欺君。",
    "成都路民屯：世祖至元十三年，签阴阳人四十户，办纳屯粮。二十二年，续签泸州编民九十七户，充屯田户。三十一年，续签千户高德所管民一十四户。保宁万户府军屯：世祖至元二十六年，保宁府言：本管军人，一户或二丁三丁，父兄子弟应役，实为重并，若又迁于成都屯种，去家隔远，逃匿必多。",
    "及居郡，卒後家无馀赀财。庄兄弟子孙以庄故，至二千石六七人焉。太史公曰：夫以汲、郑之贤，有势则宾客十倍，无势则否，况众人乎！下邽翟公有言，始翟公为廷尉，宾客阗门；及废，门外可设雀罗。翟公复为廷尉，宾客欲往，翟公乃人署其门曰：一死一生，乃知交情。",
    "大同初，新喻侯萧映为吴兴太守，甚重高祖，尝目高祖谓僚佐曰：此人方将远大。及映为广州刺史，高祖为中直兵参军，随府之镇。映令高祖招集士马，众至千人，仍命高祖监宋隆郡。所部安化二县元不宾，高祖讨平之。",
    "孔子曰：名不正则言不顺，言不顺则事不成，事不成则礼乐不兴，礼乐不兴则刑罚不中，刑罚不中则人无所措手足。故君子名之必可言也。伏愿无惑邪言，以为乱始。其事乃寝。",
    "上曰：卿言深合朕意。",
    "夜自经死。宝秀至京，下诏狱。大学士赵志皋上言：顷臣卧病，闻中外人情汹汹，皆为矿税一事。南康守吴宝秀逮系时，其妻至投缳自尽，阖郡号呼，几成变乱。",
    "外围将合，綦隆缒城走。廷训急趋城上，语守者曰：守死，逃亦死，盍死于守，为忠义鬼乎！众泣诺，乃坚拒三昼夜。廷训中流矢，束胸力战，又中六矢乃死。逾月，其子启棺更殓，面如生。",
    "太祖曰：为将奈何？对曰：被坚执锐，临难不顾，为士卒先；赏必行，罚必信。太祖大笑。建安二十一年，封鄢陵侯。",
    "大丈夫得则为王，失则为寇，予行计决矣！又问司天监，对曰：今岁时不利，深入必无成功。帝弗听。",
    "公著曰：問罪之師，當先擇帥，苟未得人，不如勿舉。",
    "论曰：高句骊弑其君诵而立询，辽兴问罪之师，宜其箪食壶浆以迎，除舍以待；而乃乘险旅拒，俾智者竭其谋，勇者穷其力。",
    "沙壹忽闻龙语曰：若为我生子，今悉何在？九子见龙惊走，独小子不能去，背龙而坐，龙因舐之。其母鸟语，谓背为九，谓坐为隆，因名子曰九隆。及后长大，诸兄以力隆能为父所舐而黠，遂共推以为王。",
    "周太祖少贱，黥其颈上为飞雀，世谓之郭雀兒。太祖见旻使者，具道所以立赟之意，因自指其颈以示使者曰：自古岂有雕青天子？幸公无以我为疑。",
    "汉遣国子祭酒田敏使于楚，假道荆南，从诲问敏中国虚实，以为契丹之后，兵食皆殚，意欲以诮敏，敏为言：杜重威悉以晋戈甲降虏，虏置之镇州，未尝以北，而晋兵皆汉有也。从诲不悦。敏以印本《五经》遗从诲，从诲谢曰：予之所识，不过《孝经》十八章尔。",
    "周愬子路於季孙，子服景伯以告孔子，曰：夫子固有惑志，缭也，吾力犹能肆诸市朝。",
    "進使南院，判應天府。帝曰：朕欲卿與韓絳共事，而卿論政不同；欲寘卿樞密，而卿論兵復異。卿受先帝末命，訖無以副朕意乎？遂行。",
    "頒辟雍大成殿名於諸路州學。五年，太常寺言：兗州鄒縣孟子廟，詔以樂正子配享，公孫丑以下從祀，皆擬定其封爵：樂正子克利國侯。",
    "举进士，为史思明判官，历事思明、朝义，常掌兵事。朝义之败，说降于军前，郭子仪爱其才，留于幕下。累授长安令、秘书少监，迁吏部侍郎、太子詹事，以才干称。谈者或以宰相许之，金吾将军裴儆谓谏议大夫柳载曰：以鄙夫所度，说得祸不久矣。",
    "侍衞軍頭向韜曰：降卒牟進言：『益光江東，越大山數重，有狹徑名來蘇，蜀人於江西置砦，對岸有渡，自此出劍關南二十里，至清強店，與大路合。可於此進兵，即劍門不足恃也。』全斌等即欲卷甲赴之，康延澤曰：來蘇細徑，不須主帥親往。",
    "高祖曰：《论语》称：冉子退朝，孔子问曰：何晏也？对曰：有政。子曰：其事也。",
    "论曰：魏文帝称明帝察察，章帝长者。章帝素知人厌明帝苛切，事从宽厚。",
    "淵言：億年故相居中之子，雖為從官，而有從賊之醜，乞寖其職名。不報。億年，右僕射秦檜之親黨也，由是檜怒之。",
    "太史公曰：阳陵侯傅宽、信武侯靳歙皆高爵，从高祖起山东，攻项籍，诛杀名将，破军降城以十数，未尝困辱，此亦天授也。蒯成侯周緤操心坚正，身不见疑，上欲有所之，未尝不垂涕，此有伤心者然，可谓笃厚君子矣。阳陵、信武，结发从汉。",
    "行周以麾下精骑突阵解之，行钦获免。庄宗方宠行钦，召行周抚谕赏劳，而欲置之帐下，又念于明宗帐下已夺行钦，更取行周，恐伤其意，密令人以利禄诱之。行周辞曰：总管用人，亦为国家，事总管犹事王也。",
    "朱遵度好讀書，人號之為朱萬卷，目昂為小萬卷。昂嘗間行經廬陵，道遇異人，謂之曰：中原不久當有真主平一天下，子仕至四品，安用南為？遂北游江、淮。",
    "庶人恂失德，高祖谓彭城王勰曰：吾固疑此兒有非常志相，今果然矣。",
    "沛父兄皆顿首曰：沛幸得复，丰未得，唯陛下哀矜。上曰：丰者，吾所生长，极不忘耳。吾特以其为雍齿故反我为魏。沛父兄固请之，乃并复丰，比沛。",
    "崇祯元年进士。授诸暨知县。少孤，母训之严。及为令，祖帐归少暮，母诃跪予杖，曰：朝廷以百里授酒人乎！章伏地不敢仰视。",
    "妻曰：寿安王、屋质在，吾属无噍类，此物何益！察割曰：寿安年幼，屋质不过引数奴，诘旦来朝，固不足忧。",
    "史臣曰：愍怀挺岐嶷之姿，表夙成之质。武皇钟爱，既深诒厥之谋；天下归心，颇有后来之望。",
    "帝方注倚安石，還其章。誨求去，帝謂曾公亮曰：若出誨，恐安石不自安。",
    "斜也、宗干当国，劝太宗改女直旧制，用汉官制度。天会四年，始定官制，立尚书省以下诸司府寺。十二年，以企先为尚书右丞相，召至上京。入见，太宗甚惊异曰：朕畴昔尝梦此人，今果见之。",
    "全讽曰：听钟郎为节度使三年，吾将自为之。",
    "丞相守道曰：汉文字恐初亦未必能如此。由历代圣贤渐加修举也。",
    "御史袁化中、给事中甄淑等相继为大中、光斗辨。大学士叶向高以举用文言，亦引罪求罢。狱方急，御史黄尊素语镇抚刘侨曰：文言无足惜，不可使搢绅祸由此起。",
    "郭逵以簽書樞密宣撫陝西，詔令還都。陶言：韓琦置逵二府，至用太祖故事，出師劫制人主，琦必有姦言惑亂聖德。願罷逵為渭州。",
    "天成元年秋八月乙酉朔，日有食之。有司上言：庄宗庙室酌献，请奏武成之舞。从之。郓州节度使霍彦威移镇青州。",
    "十一年二月，兀朮入合肥，漸攻歷陽，江東制置大使葉夢得見俊，請速出軍。俊遣兵渡江，諭諸將曰：先得和州者勝。王德願為諸軍先，士鼓譟而行。敵已據之，德率衆渡采石先登，俊宿中流。",
    "再三言之，阿注阿从之，贞惠皇后乃得解，而质欢都。而撒改、辞不失使人告急于猎所。穆宗亦心动，罢猎。中途逢告者，日午至，阿注阿谓穆宗曰：可使系案女直知名官僚相结，送我兄弟亲属由咸州路入辽国，库金厩马与我勿惜，欢都亦当送我至辽境，然后还。",
    "乙巳，葬霸陵。赞曰：孝文皇帝即位二十三年，宫室、苑囿、车骑、服御无所增益。有不便，辄弛以利民。",
    "平王大母李太后曰：先王有命，无得以罍樽与人。他物虽百巨万，犹自恣也。任王后绝欲得之。",
    "則三路事有當講畫者，在專用其民而已。帝又言：邊兵不足以守，徒費衣廩。",
    "高祖使博士王震教以《礼记》，久之，不能通大义，谓震曰：此非我家事也。高祖为契丹所立，谋以一子留守太原。契丹使尽出诸子自择之，指重贵曰：此眼大者可也。",
    "嘉禾四年七月，雨雹，又陨霜。案刘向说：雹者阴胁阳。是时吕壹作威用事，诋毁重臣，排陷无辜。",
    "人曰：此李綱救太原也。太原不可救，特以綱主戰，故出之耳。昌裔曰：君命也，不可不亟行。",
    "斯其犹人哉，安足为谋！高曰：上下合同，可以长久；中外若一，事无表里。君听臣之计，即长有封侯，世世称孤，必有乔松之寿，孔、墨之智。今释此而不从，祸及子孙，足以为寒心。",
    "元祐三年，擢樞密直學士、簽書樞密院事。明年，以中大夫同知院事。因進對言：機政所急，人才而已。",
    "赵高谓曰：君诚能谏，请为君候上间语君。於是赵高待二世方燕乐，妇女居前，使人告丞相：上方间，可奏事。丞相至宫门上谒，如此者三。二世怒曰：吾常多间日，丞相不来。",
    "良因说汉王曰：王何不烧绝所过栈道，示天下无还心，以固项王意。乃使良还。行，烧绝栈道。良至韩，韩王成以良从汉王故，项王不遣成之国，从与俱东。",
    "華州諸生有觸忌諱者，教授欲上之，曰：是間言語，皆臣子所不忍聞。",
    "有司议曰：礼，臣不殇君。",
    "故時，大辟有情可矜，多奏取原貸；崇寧以來，議者謂輦轂先彈壓，率便文殺之。振請復舊制。詔捕亡命卒，得數千人，振請以隸步軍而除其罪。步軍司欲論如法，振曰：方多事之際，而一日殺數千人，必大駭觀聽。",
    "熙寧初，江西鹽課不登，三年，提點刑獄張頡言：虔州官鹽鹵濕雜惡，輕不及斤，而價至四十七錢。嶺南盜販入虔，以斤半當一斤，純白不雜，賣錢二十，以故虔人盡食嶺南鹽。",
    "天子以问孚，孚曰：先王设九服之制，诚以要荒难以德怀，不以诸夏礼责也。陛下承绪，远人率贡。权虽未送任子，于禁不至，犹宜以宽待之，畜养士马，以观其变。不可以嫌疑责让，恐伤怀远之义。",
    "昭宗见建等责之，行瑜、茂贞惶恐战汗不能语，独建前自陈述。乃杀宰相韦昭度、李磎等，谋废昭宗。会晋举兵且至，建等惧，乃还。晋兵问罪三镇，兵傅华州，建登城呼曰：弊邑未常失礼于大国，何为见攻？晋人曰：君以兵犯天子，杀大臣，是以讨也。",
    "兀纳奏曰：臣在先朝，诏许日取帑钱十万为私费，臣未尝妄取一钱，肯借犀角乎！天祚愈怒，夺太傅官，降宁边州刺史，寻改临海军节度使。兀纳上书曰：自萧海里亡入女直，彼有轻朝廷心，宜益兵以备不虞。",
    "廷臣持之，议三上三却。璁时在部观政，以是年七月朔上疏曰：孝子之至，莫大乎尊亲。",
    "己巳，昭宗至长安，谒太庙，御长乐楼。礼毕，谓帝曰：朕生入旧京，是卿之力也。自古救君之危，曾无有如是者。况今日再及清庙，得亲奉觞酒，奠于先皇帝室前，卿之德，朕知不能报矣！即召帝执手，声泪俱发者久之。",
    "日适中，鼠曰：周南，汝不应我，复何道。言绝，颠蹶而死，即失衣冠。取视，俱如常鼠。",
    "丙午，中书右丞相完泽及文武百官议上尊谥。壬寅，始为坛于都城南七里。甲辰，遣司徒兀都带、平章政事不忽木、左丞张九思，率百官请谥于南郊。五月戊午，遣摄太尉臣兀都带奉册上尊谥曰圣德神功文武皇帝，庙号世祖，国语尊称曰薛禅皇帝。",
    "孝公既用卫鞅，鞅欲变法，恐天下议己。卫鞅曰：疑行无名，疑事无功。",
    "明复而止。贞元三年八月，日有食之，有司将伐鼓，德宗不许。太常卿董晋言：伐鼓所以责阴而助阳也，请听有司依经伐鼓。不报，由是其礼遂废。",
    "氏闻讣，尽变产完夫债，且置棺以待夫榇归，跪告族党曰：烦举二棺入地。闭户将自缢，邻妇欲生之，排闼曰：尔尚有所逋，何遽死？氏启门应曰：然吾资已尽，奈何？请复待一日。",
    "帝不忍，除傅等官以安之。傅等曰：欲遷官，第須控兩匹馬與內侍，何必至此！帝問百官：策安出？主管浙西機宜文字時希孟曰：中官之為患，至此極矣。",
    "时霍彦威所将镇州兵五千人独不乱，闻帝既出，相率归帝。诘朝，帝登城掩泣曰：国家患难，一至于此！来日归籓上章，徐图再举。安重诲、霍彦威等曰：此言非便也。",
    "从者以闻。简子召之，曰：譆，吾有所见子晣也。当道者曰：屏左右，原有谒。简子屏人。",
    "万进假殡于精舍之下，至轊东辕，凡数月之间，郡民数万，无一馈奠者。为不善者，众必弃之，信矣夫！史臣曰：延广功扶二帝，任掌六师，亦可谓晋之勋臣矣。然而昧经国之远图，肆狂言于强敌，卒使邦家荡覆，宇县丘墟，《书》所谓惟口起羞者，其斯人之谓欤！彦韬既负且乘，任重才微，盗斯夺之，固其宜矣。希崇蔚有雄干，老于塞垣，未尽其才，良亦可惜。",
    "又嘉禾六年五月十四日，赤乌二年正月一日及二十七日，地皆震动。地阴类，臣之象，阴气盛故动，臣下专政之故也。夫天地见异，所以警悟人主，可不深思其意哉！又曰：丞相顾雍。",
    "訃聞，榦持心喪三年畢，調監嘉興府石門酒庫。時韓侂冑方謀用兵，吳獵帥湖北，將赴鎮，訪以兵事。榦曰：聞議者謂今天下欲為大舉深入之謀，果爾，必敗。此何時而可進取哉？獵雅敬榦名德，辟為荊湖北路安撫司激賞酒庫兼準備差遣，事有未當，必輸忠款力爭。",
    "其母谓曰：姜聪，诸将已屠鲙之矣，汝何为如此？叶延泣曰：诚知射草人不益于先仇，以申罔极之志耳。性至孝，母病，五日不食，叶延亦不食。长而沈毅，好问天地造化、帝王年历。",
    "平王大母李太后曰：先王有命，无得以罍樽与人。他物虽百巨万，犹自恣也。任王后绝欲得之。平王襄直使人开府取罍樽，赐任王后。",
    "尝曰：居官之本有三：薄奉养，廉之本也；远声色，勤之本也；去谗私，明之本也。",
    "阴使聂翁壹为间，亡入匈奴，谓单于曰：吾能斩马邑令丞吏，以城降，财物可尽得。单于爱信之，以为然，许聂翁壹。聂翁壹乃还，诈斩死罪囚，县其头马邑城，示单于使者为信。",
    "顷公献宝器以求平，不听。郤克曰：必得萧桐侄子为质。齐使曰：萧桐侄子，顷公母；顷公母犹晋君母，柰何必得之？不义，请复战。晋乃许与平而去。",
    "卓既歼灭，自谓无复患难，及在际会，每乏温润之色，杖正持重，不循权宜之计，是以群下不甚附之。董卓将校及在位者多凉州人，允议罢其军。或说允曰：凉州人素惮袁氏而畏关东。今若一旦解兵，则必人人自危。",
    "无子，以弟颐长子琳为嗣。琳仕至东阳太守。恬、颐并历卿守。琳少子文，骠骑谘议参军史臣曰：夫太刚则折，至察无徒，以之为政，则害于而国；用之行己，则凶于乃家。",
    "习入朝京师，监军杨彦朗知留后事，昂以公事至府上谒，赞者以彦朗讳石，更其姓曰右。昂趋于庭，仰责彦朗曰：内侍奈何以私害公！昂姓石，非右也。",
    "赵王曰：寡人年少，立国日浅，未尝得闻社稷之长计也。今上客有意存天下，安诸侯寡人敬以国从。乃饰车百乘，黄金千溢，白璧百双，锦绣千纯，以约诸侯。是时周天子致文武之胙於秦惠王。",
    "上曰：斜哥祖父秦王宗翰有大功，特免死，杖一百五十，除名。久之，复起为劝农副使。赞曰：宗翰内能谋国，外能谋敌，决策制胜，有古名将之风。",
    "贼见栾悦之，杀琪及其子而诱栾。栾奋起以头触贼而仆，骂曰：我岂为犬彘所污者哉。",
    "德豐字日新，幼聰悟，延釗愛之，嘗曰：興吾門者必此子。八歲，補山南東道衙內指揮使。延釗卒，授如京使。",
    "天子曰：大将军青躬率戎士，师大捷，获匈奴王十有馀人，益封青六千户。而封青子伉为宜春侯，青子不疑为阴安侯，青子登为发干侯。青固谢曰：臣幸得待罪行间，赖陛下神灵，军大捷，皆诸校尉力战之功也。",
    "右司郎中杨发等议，以谓：古者已祔之主无改作，加谥追尊，非礼也，始于则天，然犹不改主易书，宜以新谥宝册告于陵庙可也。是时，宰相以谓士族之庙皆就易书，乃就旧主易书新谥焉。",
    "阶等请益力，帝曰：非天子不议礼。后当祔庙，居朕室次，礼官顾谓今日未宜，徒饰说以惑众听。因谕严嵩等曰：礼官从朕言，勉强耳。",
    "家奴德哥首永中尝与侍妾瑞云言：我得天下，以尔为妃，子为大王。袴、即康还奏，诏礼部尚书张暐复讯。永中父子皆死，时论冤之。",
    "琬年七岁，在傍，曰：何不言日食之余，如月之初？琼大惊，即以其言应诏，而深奇爱之。后琼为司徒，琬以公孙拜童子郎，辞病不就，知名京师。",
    "自後諸州府貢舉人，十一月朔日正衙見訖，擇日謁先師，遂為常禮。大觀初，大司成強淵明言：考之禮經，士始入學，有釋菜之儀。請自今每歲貢士始入辟雍，並以元日釋菜于先聖。其儀：獻官一員，以丞或博士；分奠官八員，以博士、正錄；大祝一員，以正錄。",
    "希亮曰：元事虛實不可知，使誠有之，為國者終不顧家，徒堅其為賊耳。此又皆其疏屬，無罪。乃密以聞，詔釋之。老幼哭希亮庭下曰：今當還故鄉，然奈何去父母乎？遂畫希亮像祠焉。",
    "汉王曰：吾与项羽俱北面受命怀王，曰约为兄弟，吾翁即若翁，必欲烹而翁，则幸分我一桮羹。项王怒，欲杀之。",
    "豹谢曰：人生一世间，如白驹过隙耳。今汉王慢而侮人，骂詈诸侯群臣如骂奴耳，非有上下礼节也，吾不忍复见也。於是汉王遣韩信击虏豹於河东，传诣荥阳，以豹国为郡。汉王令豹守荥阳。",
    "帝曰：范博士可前平说。",
    "问其故，具道娠子腹语事，帝曰：老媪逊言，惧吾辱耳。",
    "礼毕，宣徽使赞：再拜。讫。",
    "埜堕马几殆，或劝留怀来城就医。埜曰：至尊在行，敢托疾自便乎？车驾次宣府，朱勇败没。埜请疾驱入关，严兵为殿。不报。",
    "今君处毋望之世，事毋望之主，安可以无毋望之人乎？春申君曰：何谓毋望之福？曰：君相楚二十馀年矣，虽名相国，实楚王也。今楚王病，旦暮且卒，而君相少主，因而代立当国，如伊尹、周公，王长而反政，不即遂南面称孤而有楚国？此所谓毋望之福也。春申君曰：何谓毋望之祸？曰：李园不治国而君之仇也，不为兵而养死士之日久矣，楚王卒，李园必先入据权而杀君以灭口。",
    "元帝时尝罢盐、铁官，三年而复之。贡禹言：铸钱采铜，一岁十万人不耕，民坐盗铸陷刑者多。",
    "景隆驰至德州，会兵进营河间。燕王闻之喜，语诸将曰：李九江，纨绮少年耳，易与也。遂命世子居守，戒勿出战，而自引兵援永平，直趋大宁。",
    "太宗谓正伦曰：我兒疾病，乃可事也。但全无令誉，不闻爱贤好善，私所引接，多是小人，卿可察之。若教示不得，须来告我。正伦数谏不纳，乃以太宗语告之，承乾抗表闻奏。",
    "对曰：宜阳，大县也，上党、南阳积之久矣。"
  ],
  "政治/派遣事件": [
    "时高丽遣使先通于突厥，启民不敢隐，引之见帝。矩因奏曰：高丽之地，本孤竹国也，周代以之封箕子，汉时分为三郡，晋氏亦统辽东。今乃不臣，列为外域，故先帝欲征之久矣，但以杨谅不肖，师出无功。当陛下时，安得不有事于此，使冠带之境，仍为蛮貊之乡乎？今其使者朝于突厥，亲见启民从化，必惧皇灵之远暢，虑后服之先亡，胁令入朝，当可致也。",
    "雍熙二年，遣牙校張紹馮、阮伯簪等貢方物，繼上表求正領節鎮。三年秋，又遣使貢方物。",
    "显庆初，又授右监门大将军。万岁通天年，契丹叛后，奚众管属突厥，两国常递为表里，号曰两蕃。景云元年，其首领李大辅遣使贡方物，睿宗嘉之，宴赐甚厚。",
    "礼官以诸番不具地名、族氏，令守臣核实以闻。四十二年，阐化诸王遣使入贡请封。礼官循故事，遣番僧二十二人为正副使，序班朱廷对监之。至中途大骚扰，不受廷对约束，廷对还，白其状。",
    "時呂頤浩節制建業，劉光世領兵鎮江，浚遣人齎蠟書，約頤浩、光世以兵來會，而命俊分兵扼吳江。上疏請復辟。傅等謀除浚禮部尚書，命將所部詣行在，浚以大兵未集，未欲誦言討賊，乃託云張俊驟回，人情震讋，不可不少留以撫其軍。會韓世忠舟師抵常熟，張俊曰：世忠來，事濟矣。",
    "竹帛犹存，樵苏必禁，爰从八命之秩，更进三台之位。可赠司徒，仍遣使就韶州致祭。有集二十卷。",
    "淮南王长杀辟阳侯审食其。五月，匈奴入居北地、河南为寇。上幸甘泉，遣丞相灌婴击匈奴，匈奴去。",
    "国家粮储，常患不及，顾乃久养此老幼数千万口，冗食虚费，正在是耳。如即罢之，恐其失所，宜限以岁月，使自为计，至期而罢，复将何辞。上多采纳焉。元光元年正月，迁保大军节度使，兼鄜州管内观察使。",
    "延康初，比能遣使献马。文帝亦立比能为附义王。",
    "癸丑，有贼兵犯京城，刑部郎中不花守西门，夜，开门击退之。己未，刘福通遣周全引兵攻洛阳，守将登城，以大义责全，全愧谢退兵，刘福通杀之。丙寅，以完卜花、脱脱帖木儿为中书平章政事。是月，京师大水，蝗，民大饥。",
    "嚣知帝审其诈，遂遣使称臣于公孙述。明年，述以嚣为朔宁王，遣兵往来，为之援势。秋，嚣将步骑三万侵安定，至阴槃，冯异率诸将拒之。嚣又令别将下陇，攻祭遵于氵幵，兵并无利，乃引还。",
    "会车驾西征，元昊乞降，帝以前后反覆，遣滴冽往觇诚否。因为元昊陈述祸福，听命乃还。",
    "庚子，以驸马都尉萧忽列为国舅详稳。十一月丙辰，回鹘遣使来贡。十二月丙子朔，宋遣刘沆、王整来贺应圣节。",
    "癸卯，以前中书侍郎兼户部尚书、平章事李涛为太子宾客。诏宣徽南院使袁鳷权知开封府事，以太子太保和凝为太子太傅。丙午，晋州王晏奏，河东刘崇遣伪招讨使刘钧、副招讨使白截海，率步骑万余人来攻州城，以今月五日五道齐攻，率州兵拒之，贼军伤死甚众。",
    "甲寅，宋、高丽、夏遣使来贺正旦。是冬，无雪。",
    "五年正月庚辰朔，宋、高丽、夏遣使来贺。乙未，生辰，宋、高丽、夏遣使来贺。",
    "丙子，遣近侍康末怛等十三人入城索兵器，为逻卒所害。丁丑，諲歙复叛，攻其城，破之。驾幸城中，諲歙请罪马前。诏以兵卫諲歙及族属以出。",
    "上元中，萧华辅政，素知遵庆，每奏见，累称之，迁黄门侍郎、同中书门下平章事。广德初，仆固怀恩阻兵汾上，指中官为词，上以遵庆忠纯，特遣往汾州宣慰怀恩。遵庆既见怀恩，具陈朝旨，怀恩引过听命，将随遵庆朝谒，为副将范志诚以邪说惑之，怀恩遂以惧死为词。会蕃寇陷京师，乘舆幸陕，遵庆自汾州奔赴行在。",
    "色上黄，数用五，定官名，协音律。遣因杅将军公孙敖筑塞外受降城。秋八月，行幸安定。遣贰师将军李广利发天下谪民西征大宛。",
    "先主曰：吾不忍也。乃驻马呼琮，琮惧不能起。琮左右及荆州人多归先主，此到当阳，众十余万，辎重数千两，日行十余里，别遣关羽乘船数百艘，使会江陵。或谓先主曰：宜速行保江陵，今虽拥大众，被甲者少，若曹公兵至，何以拒之？先主曰：夫济大事必以人为本，今人归吾，吾何忍弃去！曹公以江陵有军实，恐先主据之，乃释辎重，轻军到襄阳。",
    "镠卒，元瓘立，袭封吴越国王，玉册、金印，皆如镠故事。王延政自立于建州，闽中大乱，元瓘遣其将仰诠、薛万忠等攻之，逾年，大败而归。",
    "立命中使宣旨，令送本军，孟容系之不遣。中使再至，乃执奏曰：臣诚知不奉诏当诛，然臣职司辇毂，合为陛下弹抑豪强。",
    "戊午，以中书侍郎、平章事豆卢革判租庸使，兼诸道盐铁、转运等使。新罗王金朴英遣使贡方物。己未，以洛京留守、判六军诸卫事、守太尉、兼中书令、河南尹、魏王张全义为检校太师、守中书令，余如故；以荆南节度使、检校太师、守中书令、渤海王高季兴依前检校太师、守中书令，余如故。",
    "帝寻命桑维翰诣诸道求援，契丹遣人复书诺之，约以中秋赴义。",
    "庚戌，闽王王昶、威武军节度使王继恭遣僚佐林思、郑元弼等朝贡，致书于宰执，无人臣之礼。帝怒，诏令不受所贡，应诸州纲运，并令林思、郑元弼等押归本道。既而兵部员外郎李知损上疏，请禁锢使人，籍没纲运。",
    "隆运总宿卫事，太后益宠任之。统和元年，加开府仪同三司，兼政事令。四年，宋遣曹彬、米信将十万众来侵，隆运从太后出师败之，加守司空，封楚国公。",
    "初，田令孜之为监军也，盗唐传国玺入于蜀而埋之，二月，尚食使欧阳柔治令孜故第，穿地而得之，以献。五月，梁遣光禄卿卢玭来聘，推建为兄，其印文曰大梁入蜀之印。宰相张格曰：唐故事，奉使四夷，其印曰大唐入某国之印，今梁已兄事陛下，奈何卑我如夷狄？建怒，欲杀梁使者，格曰：此梁有司之过尔，不可以绝两国之欢。",
    "九月丙戌，龙骧将军杨佺期击氐帅杨佛嵩于潼谷，败之。冬十月，姚苌死，子兴嗣伪位。十九年夏六月壬子，追尊会稽王太妃郑氏为简文宣太后。秋七月，荆、徐二州大水，伤秋稼，遣使振恤之。",
    "十一月丙申，女直遣使进马。",
    "及察割作乱，遣人报朗曰：事成矣！朗遣详稳萧胡里以所部军往，命曰：当持两端，助其胜者。穆宗即位，伏诛，籍其家属。",
    "沛公引兵击阳城，使张良以韩司徒降下韩故地，得信，以为韩将，将其兵从沛公入武关。",
    "秋八月甲戌，吴杰及永定侯张铨率致仕武臣，备倭广东。乙亥，遣国子监生分行天下。督吏民修水利。丙戌，阶、文军乱，都督甯正为平羌将军讨之。",
    "二年，轉殿前都虞候、領涼州觀察使、鎮州副都部署。大破契丹三萬衆于徐河，斬首數千級。淳化二年，為平虜橋砦都部署，歷并代、環慶兩路副部署。至道中，遣將從五路討李繼遷，命廷召副李繼隆為環慶靈都部署。",
    "是冬，驻跸金川。鵩乾亨元年春正月乙酉，遣挞马长寿使宋，问兴师伐刘继元之故。",
    "及洪累授方镇，纳赂不满士良之志，士良怒，遣人上书论洪非太后之亲，又以萧本者为太后弟。从谏深知内宫之故，乃自潞府飞章论之曰：臣闻造伪以乱真者，匹夫知之尚不可，况天下皆知乎？执疏以为亲者，在匹夫之家尚不可，况处大国之朝乎？臣受国恩深，奉公心切，知有此失，安敢不言！伏唯皇帝陛下仁及万方，孝敦九族，而推心无党，唯理是求。微臣所以不避直言，切论深事。",
    "癸未，汉遣使来贡。丙戌，鼻骨德、吐谷浑来贡。十一月庚子，胪朐河于越延尼里等率户四百五十来附，乞隶宫籍。",
    "丁巳，遣河南行省平章政事玥珞普华于西番为僧。己未，太阴犯垒壁阵。辛酉，赐宣让王帖木儿不花市宅钱四千锭，诏帖木儿不花王府官属，朝贺班次列于有司之右。",
    "朝廷以劳拜参知政事。天兴元年春，大兵驻郑州海滩寺，遣使招哀宗降。复以奴申往乞和。不许，攻汴益急。",
    "黑袴褶将一人，骑校、鞉角各一人，步，在前，督战伯长各一人，步，在后。金颜督将并领之。",
    "李斯使人遗非药，使自杀。",
    "次小辽口。使中都留守宗宪先往。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "以得功及中军游击祖大寿为前锋，令会秉忠赴援，廷弼亦遣使督渠进战，遇大清兵于平阳。得功怀异志，欲引去。乃分兵为左右翼，稍却，推渠、秉忠前。",
    "麟奉命，遣使谢罪，而诉安平、思陵土官侵掠思郎。帝令守臣严饬。七年，安南贡使还，令赍皮弁冠服、金织袭衣赐其王。是岁，麟卒，私谥太宗。",
    "昭岩穴，披幽隐，遣诣公车，朕将悉听焉。帝乃亲临策问，选补郎吏。夏四月，蜀郡徼外羌率种人遣使内附。",
    "宋攻夏，李乾顺遣使求和解，帝命俨如宋平之，拜参知政事。",
    "因贺大定八年正旦，遣奏告使殿前太尉芭里昌祖等以仁孝章乞良医为得敬治疾，诏保全郎王师道佩银牌往焉。",
    "十一月己未，遣使求医于晋。丁卯，铁骊来贡。",
    "以母忧去官，寻召复旧职。宋攻夏，李乾顺遣使求和解，帝命俨如宋平之，拜参知政事。",
    "以州初置，境逼巴獠，给羽林虎贲三百人，进号冠军将军。及高肇伐蜀，假竖眼征虏将军、持节，领步兵三万先讨北巴。萧衍闻大军西伐，遣其宁州刺史任太洪从阴平偷路入益州北境，欲扰动氐蜀，以绝运路。乘国讳班师，遂扇诱土民，奄破东洛、除口二戍，因此诈言南军继至，氐蜀信之，翕然从逆。",
    "云南八番为囊加台所诖误，反侧未安者，并贳其罪。免各处煎盐灶户杂泛夫役二年。遣使代祀岳渎山川。免永平屯田总管府田租，申禁天下私杀马牛。",
    "太祖以云南险僻，不欲用兵。明年正月，北平守将以所得王遣往漠北使者苏成来献，太祖乃命待制王祎赍诏偕成往招谕。王待祎以礼。会元嗣君遣使脱脱来征饷，脱脱疑王有他意，因胁以危语。",
    "景仁弃宛陵，以腹心百人归吴越王钱镠，《新唐书·杨行密传》：渥求茂章亲兵不得，宣辇帷帟以行，茂章谩骂不与。逾年，遣兵五千袭之，茂章奔杭州。镠辟为两府行军司马，具以状闻。",
    "及景嗣位，累遷至中書舍人。晉開運末，閩越大亂，景遣謐與諫議大夫陳覺乘傳安撫，謐遂矯詔發數郡兵攻福州。及敗，引佩刀自刺，親吏制之，不死，長流舒州。",
    "黔师协剿，亦无功。时四川新抚谭希忠与贵州镇、抚再议剿，御史薛继茂主抚。应龙上书自白，遣其党携金入京行间，执原奏何恩诣綦江县。二十二年，以兵部侍郎刑玠总督贵州。",
    "乙卯，渤海遣使者来。三年春正月乙未，百济遣使者来。丁未，封子重美为雍王。",
    "六月壬申，驻跸胡吕山。癸未，高丽遣使来贡。秋七月己酉，阻卜大王屯秃古斯率诸部长献马、驼。",
    "诏江淮行省遣蒙古军五百、汉兵千人，从皇子镇南王镇杨州。执河间都转运使张庸，仍遣官钩考其事。",
    "有旨：朕知沈明仁奸恶，其严鞫之。戊午，遣中书右丞相伯答沙持节授皇太子玉册。",
    "秋七月辛亥朔，日有食之。甲寅，遣使视诸道禾稼。辛酉，南院枢密使室昉为中京留守，加尚父。",
    "成祖初，僧智光使其地。永乐四年遣使入贡，诏授灌顶国师，赐之诰。明年遣使入谢，封为护教王，赐金印、诰命，国师如故。",
    "汉遣国子祭酒田敏使于楚，假道荆南，从诲问敏中国虚实，以为契丹之后，兵食皆殚，意欲以诮敏，敏为言：杜重威悉以晋戈甲降虏，虏置之镇州，未尝以北，而晋兵皆汉有也。从诲不悦。敏以印本《五经》遗从诲，从诲谢曰：予之所识，不过《孝经》十八章尔。",
    "秋八月辛酉，遣使核各边屯田。",
    "秋，魏将梅敷使张俭求见抚纳。南阳阴、酂筑阳、山都、中庐五县民五千家来附。冬，魏嗣王称尊号，改元为黄初。二年四月，刘备称帝于蜀。",
    "二十一年遣使诣五国及鼻骨德、乌古、敌烈四部捕海东青鹘。道宗清宁二年诏二女古部与世预宰相、节度使之选者，免皮室军役。三年五国部长贡方物。八年吾独婉惕隐屯秃葛等乞岁贡马、驼，许之。",
    "十七年，王子段阿剌沙遣使入贡。十九年、二十一年，再入贡。",
    "废帝即位，追尊魏氏为皇太后，议建陵寝，而太原石敬瑭反，乃于京师河南府东立寝宫。清泰三年六月丙寅，遣工部尚书崔俭奉上皇太后宝册，谥曰宣宪。",
    "乃遣使报汉，因请立张耳为赵王，以镇抚其国。",
    "二年四月，峦频破衍军，遂入剑阁，执其辅国将军范始男送京师。峦又遣统军王足破衍诸将，斩其辅国将军冯文豪等。六月，衍遣将王超宗寇边，扬州刺史薛真度大破之，俘斩三千级。",
    "十一年二月，兀朮入合肥，漸攻歷陽，江東制置大使葉夢得見俊，請速出軍。俊遣兵渡江，諭諸將曰：先得和州者勝。王德願為諸軍先，士鼓譟而行。敵已據之，德率衆渡采石先登，俊宿中流。",
    "景隆屡大败，奔德州，诸军皆溃。明年正月，燕王攻大同，景隆引军出紫荆关往救，无功而还。帝虑景隆权尚轻，遣中官赍玺书赐黄钺弓矢，专征伐。",
    "绍闻，惧为患，募遣追之，皆莫敢逼，遂归张杨。道经陈留，太守张邈遣使迎之，相待甚厚，临别把臂言誓。邈字孟卓，东平人，少以侠闻。",
    "请遣风力科臣一人，与河漕诸臣定画一之计。乃命礼科给事中张企程往勘。而以水患累年，迄无成画，迁延糜费，罢应龙职为民，常居敬、张贞观、彭应参等皆谴责有差。",
    "壬午，景使其臣钟谟来奉表。丙戌，取扬州。辛卯，取泰州。",
    "戊申，金遣紇石烈忠定來賀明年正旦。己酉，加吳曦太尉。庚戌，祔恭淑皇后神主于太廟。",
    "又遣人赍蜡弹于吴、蜀、契丹，以求应援。",
    "八年女直国侵贵德州。辖戛斯国遣使来贡。",
    "郤子无基。且先君之嗣卿也，受命以求师，将社稷是卫，而惰弃君命也，不亡何为！十七年，郤氏亡。成公十三年，诸侯朝王，遂从刘康公伐秦。成肃公受脤于社，不敬。",
    "癸巳，遣兵南征。",
    "二月，豫州刺史尧雄攻扬州，拔之，擒宝炬义州刺史韩显、扬州长史丘岳，送京师。丙辰，遣兼散骑常侍郑伯猷使于萧衍。三月，齐献武王固请解大丞相，诏从之。夏四月庚寅，曲赦畿内。",
    "丙午，中书右丞相完泽及文武百官议上尊谥。壬寅，始为坛于都城南七里。甲辰，遣司徒兀都带、平章政事不忽木、左丞张九思，率百官请谥于南郊。五月戊午，遣摄太尉臣兀都带奉册上尊谥曰圣德神功文武皇帝，庙号世祖，国语尊称曰薛禅皇帝。",
    "夏国遣使陈慰，欲致祭大行灵殿。行简曰：彼陈慰非专祭，不可。廷议遣使横赐高丽，比遣使报哀，彼以细故邀阻，且出嫚言，俟移问还报，横赐未晚。",
    "三月壬子朔，颁孔颖达《五经正义》于天下，每年明经令依此考试。丙辰，上御观德殿，陈逆人房遗爱等口马资财为五垛，引王公、诸亲、蕃客及文武九品己上射。夏四月戊子，林邑国王遣使来朝，贡驯象。壬寅，以旱避正殿，减膳，亲录系囚，遣使分省天下冤狱，诏文武官极言得失。",
    "坚薨，贲摄帅余众，扶送灵柩。后袁术徙寿春，贲又依之。术从兄绍用会稽周昂为九江太守，绍与术不协，术遣贲攻破昂于阴陵。术表贲领豫州刺史，转丹杨都尉，行征虏将军，讨平山越。",
    "夏四月，帝次龙德，拔德顺等州，德顺节度使爱申、进士马肩龙死焉。五月，遣唐庆等使金。",
    "平王大母李太后曰：先王有命，无得以罍樽与人。他物虽百巨万，犹自恣也。任王后绝欲得之。平王襄直使人开府取罍樽，赐任王后。",
    "寻复为盗，元遣兵捕之。定闻张士诚据高邮，乃导士诚由通州渡江，遂陷平江。以定为参政，而遣元帅栾瑞戍石牌。",
    "亮遣参军卜靖赴之，败走。朱彤至梁州，亮望风奔散，于是坚遂有梁益二州。",
    "丙午，高丽、鄯善国并遣使朝贡。秋七月，田于棝阳。己卯，乐平王丕等五将东伐，至和龙，徙男女六千口而还。",
    "戊戌，万寿节，高丽、夏遣使来贺。",
    "欢知逆状已露，稍怀旅拒，遂遣蔡俊拒代；令窦泰佐之。又遣侯景等云向白马，辅世珍等径趣石济，高隆之、及娄昭等屯据壶关，韩轨之徒拥众蒲坂。于是上书天子，数论得失，訾毁乘舆，威侮朝廷。藉此微庸，冀兹大宝；溪壑可盈，祸心不测。",
    "闰月癸酉，契丹遣使者来。己卯，阅稼于西苑。九月壬寅，行营招讨使左卫上将军陈晖克襄州，执其首恶李洪。丁未，保义军节度使王檀为潞州东面行营招讨使。",
    "豹谢曰：人生一世间，如白驹过隙耳。今汉王慢而侮人，骂詈诸侯群臣如骂奴耳，非有上下礼节也，吾不忍复见也。於是汉王遣韩信击虏豹於河东，传诣荥阳，以豹国为郡。汉王令豹守荥阳。",
    "辛巳，贺若弼进据钟山，顿白土冈之东南。甲申，后主遣众军与弼合战，众军败绩。",
    "宣王奇之，辟之为掾，迁尚书郎。时欲广田畜谷，为灭贼资。使艾行陈、项已东至寿春。",
    "遣尚书郎邓芝固好于吴，吴王孙权与蜀和亲使聘，是岁通好。三年春，务农殖谷，闭关息民。三年春三月，丞相亮南征四郡，四郡皆平。改益州郡为建宁郡，分建宁、永昌郡为云南郡，又分建宁、臧柯为兴古郡。"
  ],
  "政治/赏赐事件": [
    "世言晋王之将终也，以三矢赐庄宗而告之曰：梁，吾仇也，燕王吾所立，契丹与吾约为兄弟，而皆背晋以归梁。此三者，吾遗恨也。与尔三矢，尔其无忘乃父之志！庄宗受而藏之于庙。其后用兵，则遣从事以一少牢告庙，请其矢，盛以锦囊，负而前驱，及凯旋而纳之。",
    "会太后生辰，进诗献驯鹿，太后嘉奖，赐珠二琲，杂彩二百段。兄撒钵卒，陈家奴闻讣，不告而去。帝怒，鞭之。清宁初，累迁右夷离毕。",
    "夏四月戊午，赐诸王合必赤、亦怯烈金、素币各四，拜行金币一。",
    "己亥，帝自镇淮军复幸下蔡。壬寅，赐淮南降军许文缜、边镐已下万五百人衣服钱帛有差。丙午，寿州刘仁赡上表乞降，帝遣阁门使张保绩入城慰抚。",
    "时与允成等同以部曹争三王并封，又争拾遗事者，户部主事滁人贾岩，亦贬曹州判官。投劾归，卒。天启中，赠允成、纳陛光禄少卿，岩尚宝丞。诸寿贤，字延之，昆山人。",
    "得，全椒人，龙里守御所千户。洪武三十年，古州上婆洞蛮作乱，得与镇守将井孚守城。贼烧门急攻，二人开门奋击，得中毒弩死，孚战死。赠得指挥佥事，孚正千户，子孙世袭。",
    "婴入见，固辞谢病不足任。太后亦惭。於是上曰：天下方有急，王孙宁可以让邪？乃拜婴为大将军，赐金千斤。婴乃言袁盎、栾布诸名将贤士在家者进之。",
    "绍威尝以临淄、海岱罢兵岁久，储庾山积，惟京师军民多而食益寡，愿于太行伐木，下安阳、淇门，斫船三百艘，置水运自大河入洛口，岁漕百万石，以给宿卫，太祖深然之。",
    "贼平入朝，上赐宴麟德殿，赏赐珍玩名马，进位侍中，改许州刺史、忠武军节度、陈许蔡等州观察使。太和七年，改授河中尹、河中节度、晋磁隰观察等使。智兴因入朝。",
    "欲其居近，易于往来，乃赐甲第于宫门南。衣食车马，皆乘舆之副。真君三年冬，车驾幸阴山，鲁元以疾不从。侍臣问疾送医药，传驿相属于路。",
    "十六年，加授开府仪同三司，寻表请致仕，听解尚书右仆射，令以开府仪同三司依旧平章事。又正受诏与魏徵等集文学之士，撰《文思博要》一千二百卷，奏之，赐物千段。",
    "因赐帛五十匹。九年，拜散骑常侍，赐爵丰城县男。十一年卒。",
    "並給見錢。河南府河南、洛陽縣令，三十千。",
    "孙汉英，太原人也。父重进，事唐武皇、庄宗为大将，赐姓，名存进，《唐书》有传。",
    "后以本官复领著作，卒官。赠骠骑将军、开府仪同三司、都督、幽州刺史，谥曰文贞公。",
    "天宝五载，右相李林甫构陷刑部尚书韦坚，斌以亲累贬巴陵太守，移临安太守，加银青光禄大夫。斌授五品时，兄陟为河东太守，堂兄由为右金吾将军，縚为太子少师，四人同时列戟，衣冠之盛，罕有其比。十四载，安禄山反，陷洛阳，斌为贼所得，伪授黄门侍郎，忧愤而卒。",
    "翱曰：卒死法，妻死夫，女死父，非杀也。命璟偿其家葬｛艹貍｝费，璟感激。后参将辽东，追敌三百里，事李秉为名将。十二年与总兵曹义等出塞，击兀良哈，擒斩百余人，获畜产四千六百，进右都御史。",
    "庄宗失色，左右皆恐，群伶亦大惊骇，共持新磨诘曰：汝奈何批天子颊？新磨对曰：李天下者，一人而已，复谁呼邪！于是左右皆笑，庄宗大喜，赐与新磨甚厚。新磨尝奏事殿中，殿中多恶犬，新磨去，一犬起逐之，新磨倚柱而呼曰：陛下毋纵兒女啮人！庄宗家世夷狄，夷狄之人讳狗，故新磨以此讥之。",
    "戊午，賜陳王佖入朝不趨。",
    "七十旁无期亲及有疾废者，各赐粟帛。筑城之夫，给复一年。二年春正月壬申，以太保尉景为太傅，以骠骑大将军、开府仪同三司厍狄干为太保。",
    "賈昌朝字子明，真定獲鹿人。晉史官緯之曾孫也。天禧初，真宗嘗祈穀南郊，昌朝獻頌道左，召試，賜同進士出身，主晉陵簿。賜對便殿，除國子監說書。",
    "丁巳，遣河南行省平章政事玥珞普华于西番为僧。己未，太阴犯垒壁阵。辛酉，赐宣让王帖木儿不花市宅钱四千锭，诏帖木儿不花王府官属，朝贺班次列于有司之右。",
    "遊錢塘，以詩贈處士林逋，逋尤激賞。",
    "二十八年十一月癸丑，上幸克宁第。初，上欲以甲第赐克宁，克宁固辞，乃赐钱，因其旧居宏大之。",
    "祖直，平远将军、柔玄镇将。入为镇北大将军，内外三都大官，赐爵长进侯。卒，赠幽州刺史，谥曰简。",
    "三月癸亥，诏内外衆官九品以上，各荐一人。又诏求忠谠，无所隐讳。己巳，以新除翊左将军永阳王伯智爲尚书仆射。夏四月丙申，立皇子永康公胤爲皇太子，赐天下爲父后者爵一级，王公以下赉帛各有差。",
    "加安汉公号曰宰衡。赐公太夫人号曰功显君。封公子安、临皆为列侯。",
    "成祖初，僧智光使其地。永乐四年遣使入贡，诏授灌顶国师，赐之诰。明年遣使入谢，封为护教王，赐金印、诰命，国师如故。",
    "三月己亥，车驾至自南伐，饮至策勋，告于宗庙，以降人五万余家分置近畿，赐留台文武所获军资生口各有差。",
    "遂用黄孔昭例，赠礼部尚书，谥文庄。乡人建祠，与陆九渊、吴澄、吴与弼、陈九川并祀，曰五贤祠，学者称疏山先生。仁度，字继疏。万历十七年进士。",
    "傔人餐錢中書、樞密、宣徽、三司及正刺史已上，皆有衣糧，餘止給餐錢。自判三館、秘書監、兩制、兩省帶修撰，五千。朗中以下帶修撰者三千。",
    "加泚实封五百户，赐窦氏名园、泾水上腴田及锦彩金银器，以安其意，时滔叛故也。壬午，贬御史大夫严郢为费州长史，杖杀左巡使、殿中侍御史郑詹。郢岁余卒。五月丙戌，增两税、盐榷钱，两税每贯增二百，盐每斗增一百。",
    "坐漏泄禁中语，左授司刑少卿，出为并州长史。道病卒，赠相州刺史。",
    "世让伪许之，因告城中曰：贼兵多少，极于此矣。宜善自固，以图安全。举重其执节，竟不之害。太宗时屯兵高墌，世让潜遣宝逃归，言贼中虚实；高祖嘉之，赐其家帛千匹。",
    "乙巳，赦岐州，赐高年粟帛。十月丁巳，至自岐州。十一月丁亥，徙封旭轮为冀王，改名轮。",
    "癸卯，赐诸王桑哥班金束带一、银百两、钞五百锭。",
    "又尝梦收如平生，又敕有司特赐其家粟帛。贞观七年，赠定州刺史。永徽六年，又赠太常卿，陪葬昭陵。文集十卷。",
    "平王大母李太后曰：先王有命，无得以罍樽与人。他物虽百巨万，犹自恣也。任王后绝欲得之。平王襄直使人开府取罍樽，赐任王后。",
    "甲辰，赐国王和童金二百五十两、银七百五十两。立皇太子卫率府，发军千五百人修五台山佛寺。",
    "诏赠錞、一岑光禄少卿，錞世荫锦衣百户，岑荫国子生，并建祠祀。",
    "丁亥，賜將士衣服錢帛。戊子，大赦，減死罪一等。壬辰，宴孟昶及其子弟於大明殿。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。",
    "乙酉，赠恤冤陷诸臣。夏四月癸巳，赐刘若宰等进士及第、出身有差。甲午，袁崇焕为兵部尚书，督师蓟、辽。"
  ],
  "地理/地震": [
    "晋武帝咸宁二年八月庚辰，河南、河东、平阳地震。咸宁四年六月丁未，阴平、广武地震；甲子，阴平、广武地又震。晋武帝太康二年二月庚申，淮南、丹阳地震。",
    "二月，益、黎、雅州地震。三月，邢州地震不止。",
    "甲辰，又震。",
    "十二月戊辰，宁夏石空寺堡地大震。礌山石殿倾倒，压死僧人。是年，南京地亦震。",
    "庚申，右军中尉王守澄，宣召郑注对于浴殿门。是夜，彗星出东方，长三尺，芒耀甚猛。十二月丙戌夜，月掩昴。九年三月乙卯，京师地震。",
    "四年六月己酉，太原府地震有聲。元符元年七月壬申夜，雲霠蔽天，地震良久。二年正月壬申，恩州地震。八月甲戌，太原府地震；三年五月己巳，太原府又震。",
    "又议讨朝鲜，自严言不可遽讨，当俟请贡输诚，东征效力，徐许其封耳。京师数地震，因言内批宜慎，恩泽宜节，人才宜惜，内操宜罢，语甚切直。",
    "六年十二月，晋、绛二州地震，坏庐舍，地裂泉涌，泥出青色。八年正月丁未，河中、晋、绛三州地大震，坏庐舍，人有死者。十三年四月庚子朔，浙东、西地震。",
    "又嘉禾六年五月十四日，赤乌二年正月一日及二十七日，地皆震动。地阴类，臣之象，阴气盛故动，臣下专政之故也。夫天地见异，所以警悟人主，可不深思其意哉！又曰：丞相顾雍。",
    "三十三年八月丙午，镇江西南华山裂二三尺。"
  ],
  "政治/贡献事件": [
    "会太后生辰，进诗献驯鹿，太后嘉奖，赐珠二琲，杂彩二百段。兄撒钵卒，陈家奴闻讣，不告而去。帝怒，鞭之。清宁初，累迁右夷离毕。",
    "秋七月癸丑，侍郎叶相振陕西饥。戊午，张孚敬罢。辛巳，郑王厚烷献白雀，荐之宗庙。",
    "夏四月丁丑，女直贡良马。五月壬戌，驻跸散水原。乙丑，阻卜来贡。",
    "二十一年奥里等部来贡。",
    "秋七月甲子，秦王凯旋，献俘于太庙。丁卯，大赦天下。",
    "癸未，汉遣使来贡。丙戌，鼻骨德、吐谷浑来贡。十一月庚子，胪朐河于越延尼里等率户四百五十来附，乞隶宫籍。",
    "十一月己未，遣使求医于晋。丁卯，铁骊来贡。",
    "太祖以云南险僻，不欲用兵。明年正月，北平守将以所得王遣往漠北使者苏成来献，太祖乃命待制王祎赍诏偕成往招谕。王待祎以礼。会元嗣君遣使脱脱来征饷，脱脱疑王有他意，因胁以危语。",
    "六月壬申，驻跸胡吕山。癸未，高丽遣使来贡。秋七月己酉，阻卜大王屯秃古斯率诸部长献马、驼。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "寝其奏。奸民献大名地为皇庄，淇议归之有司。内官龙绶请开银矿，淇不可。",
    "戊申，以福建观察使鲍防为洪州刺史、江西团练观察使。癸丑，上诞日，不纳中外之贡，唯李正己、田悦各献缣三万匹，诏付度支。",
    "三月壬子朔，颁孔颖达《五经正义》于天下，每年明经令依此考试。丙辰，上御观德殿，陈逆人房遗爱等口马资财为五垛，引王公、诸亲、蕃客及文武九品己上射。夏四月戊子，林邑国王遣使来朝，贡驯象。壬寅，以旱避正殿，减膳，亲录系囚，遣使分省天下冤狱，诏文武官极言得失。",
    "赵王曰：寡人年少，立国日浅，未尝得闻社稷之长计也。今上客有意存天下，安诸侯寡人敬以国从。乃饰车百乘，黄金千溢，白璧百双，锦绣千纯，以约诸侯。是时周天子致文武之胙於秦惠王。",
    "丙戌，废皇太子为庶人，囚之上京。己丑，回鹘来贡。杀东京留守同知耶律回里不。",
    "江南进奉使商崇义代李景捧寿觞以献。",
    "次日，司礼监官自内殿送《实录》下殿，仍置宝舆中，用伞盖，与监修总裁官同送皇史宬尊藏。"
  ],
  "政治/任职管辖": [
    "显庆初，又授右监门大将军。万岁通天年，契丹叛后，奚众管属突厥，两国常递为表里，号曰两蕃。景云元年，其首领李大辅遣使贡方物，睿宗嘉之，宴赐甚厚。",
    "己丑，祈雪于會靈觀。丁酉，出知雜御史曹修古，御史郭勸、楊偕，推直官段少連。十二月甲寅，詔吏部銓：選人父母年八十以上者，權注近官。",
    "礼官以诸番不具地名、族氏，令守臣核实以闻。四十二年，阐化诸王遣使入贡请封。礼官循故事，遣番僧二十二人为正副使，序班朱廷对监之。至中途大骚扰，不受廷对约束，廷对还，白其状。",
    "入朝，帝欲治罪，以其能自归，乃赦之。高祖即位之二年，授凤州防御使，加检校司徒，会丁母忧，起复，授内客省使、右监门卫大将军。",
    "国珍乃使人浮海至京，贿用事者。遂诏抚国珍，授以官，而责基擅威福，羁管绍兴，方氏遂愈横。亡何，山寇蜂起，行省复辟基剿捕，与行院判石抹宜孙守处州。",
    "汝纳亦进士擢第，以季父赃罪，久之不调。会昌中，为河南府永宁县尉。",
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "敬嗣晖，字唐臣，易州人。登天眷二年进士第，调怀安丞，迁弘政令，补尚书省令史。有才辩，海陵为宰相，爱之，及篡立，擢起居注，历谏议大夫、吏部侍郎、左宣徽使。贞元三年八月，尚食烹饪失宜，庖官各杖二百，嗣晖与同知宣徽院事乌居仁各杖有差。",
    "嚣知帝审其诈，遂遣使称臣于公孙述。明年，述以嚣为朔宁王，遣兵往来，为之援势。秋，嚣将步骑三万侵安定，至阴槃，冯异率诸将拒之。嚣又令别将下陇，攻祭遵于氵幵，兵并无利，乃引还。",
    "肃宗末，除镇军将军、行相州事。",
    "崧幼聪敏，能文章，为镇州参军。唐魏王继岌为兴圣宫使，领镇州节度使，以推官李荛掌书记。崧谓掌书吕柔曰：魏王皇子，天下之望，书奏之职，非荛所当。",
    "甲寅，以华州节度使赵莹为开封尹，以皇弟开封尹重睿为秦州节度使，以宣徽南院使刘继勋为华州节度使，以前郓州节度使张从恩为晋州节度使。",
    "皇统三年，为东京留守，拜左副元帅，兼会宁牧。",
    "除吏部尚書。",
    "因赐帛五十匹。九年，拜散骑常侍，赐爵丰城县男。十一年卒。",
    "二月乙巳，以宣徽院副使韦坚权知徐州军事。三月己卯，以华州感化军留后尹皓为华州节度使，加检校太保、同平章事。",
    "庚子，以驸马都尉萧忽列为国舅详稳。十一月丙辰，回鹘遣使来贡。十二月丙子朔，宋遣刘沆、王整来贺应圣节。",
    "言者交攻之，遂下吏，貶秩四等，安置隨州。會侯可以言水利入見，神宗問其事，對曰：种諤奉密旨取綏而獲罪，後何以使人？帝亦悔，復其官。韓絳宣撫陝西，用為鄜延鈐轄。絳城囉兀，規橫山，令諤將兵二萬出無定川，命諸將皆受節度，起河東兵會銀州。",
    "劫贼余口没在台府者，悉原放。诸负衅流徙，普听还本土。以齐国左卫将军陈显达为中护军，中领军王敬则为南兖州刺史，左卫将军李安民为中领军。戊戌，以荆州刺史嶷为尚书令、骠骑大将军、开府仪同三司、扬州刺史，冠军将军映为荆州刺史，西中郎将晃为南徐州刺史，冠军将军垣崇祖为豫州刺史，骠骑司马崔文仲为徐州刺史。",
    "清泰初，为金州防御使。会蜀军攻其城，州兵才千人，兵马都监陈知隐惧，托以他事出城，领三百人顺流而逸，贼既盛，人情忧沮。",
    "丁巳，皇子北京留守、河东节度使从厚移领镇州，以左武卫上将军李从温为许州节度使。",
    "封漆水郡王，迁上京留守，薨。诏以家贫，给葬具。",
    "十二月壬午，黄门侍郎王珪为侍中。",
    "乙丑，幸天开殿。己巳，诏罢来流水、混同江护逻地，与民耕牧。三月庚寅，以禁苑隙地分给百姓。戊申，以韩昉为翰林学士。",
    "開寶中，禮部再奏為考試官，調滁州軍事推官。太宗即位，擢授太子左贊善大夫，知河南縣，通判滑、梓二州。",
    "进左都督，世荫都指挥同知。",
    "甲戌，汴梁旱。徙江东按察司于宣州。庚辰，岁星犯垒壁阵。",
    "敬玄自以素非边将之才，固辞。高宗谓曰：仁轨若须朕，朕即自往，卿不得辞也。竟以敬玄为洮河道大总管，兼安抚大使，仍检校鄯州都督，率兵以御吐蕃。及将战，副将工部尚书刘审礼先锋击之。",
    "以招降羌有功，加集賢殿修撰。",
    "庚申，以宦者刚答里为中政院使。",
    "徙为上谷太守，匈奴日以合战。典属国公孙昆邪为上泣曰：李广才气，天下无双，自负其能，数与虏敌战，恐亡之。於是乃徙为上郡太守。後广转为边郡太守，徙上郡。",
    "固出語執政曰：及上有意，宜亟圖之，以福天下。既而竟從安石。固復領銀臺司。",
    "六月壬寅，忠武军节度使刘知俊为西路行营招讨使，以伐岐。己酉，杀右金吾卫上将军王师范，灭其族。",
    "壬寅，以中书舍人封翘为礼部侍郎，礼部侍郎卢澹为户部侍郎。癸卯，许州节度使李从温移镇河东。",
    "王銮，字廷和，大庾人。正德三年进士。授邵武知县。入为都水主事，出辖徐沛闸河。",
    "咸雍初，补祗候郎君。",
    "峻年长于太祖二岁，太祖虽登大位，时以兄呼之，有时呼表字，不忘布衣之契也。峻以此益自负焉。广顺元年冬，刘崇与契丹围晋州，峻请行应援，太祖用为行营都部署，以徐州节度使王彦超为副。诏诸军并取峻节度，许峻以便宜从事，军行资用仰给于官，随行将吏得自选择。",
    "秋七月壬寅，以征虏谘议参军杜骥为青州刺史。壬子，皇后袁氏崩。",
    "顷之，拜抚军将军。是岁，吴将步阐来降，假亮节都督诸军事以纳之。",
    "四年，加淮南西北面行营招讨使，控扼淮濆，边境安之。",
    "安石不悅，屢求去，四月，出知江寧府。",
    "七年正月乙卯，授宜州觀察使，就王邸訓習。",
    "庚子，詔求直言。御史中丞王陶乞許舉知縣資序人為御史裏行，從之。癸卯，王安石出知江寧府。",
    "改西京留守，复为东北路统军使。卒于官。萧普达，字弹隐。",
    "朝廷以劳拜参知政事。天兴元年春，大兵驻郑州海滩寺，遣使招哀宗降。复以奴申往乞和。不许，攻汴益急。",
    "十二月戊申，太子太师、庆王琮为司徒。",
    "己亥，侍卫马军都指挥使樊爱能、步军都指挥使何徽伏诛。壬寅，天雄军节度使符彦卿为河东行营都部署。",
    "戊寅，以冠军将军王玄载为徐州刺史，宁朔将军崔平为兗州刺史。",
    "乃授方叔觀文殿大學士、提舉洞霄宮。",
    "五年出莅部事。尚书胡濙悉以部政付之，直处之若素习者。八年正月代郭琎为吏部尚书。",
    "六月，高璩薨。御史大夫徐商为兵部侍郎、同中书门下平章事。七月，封子侃为郢王。",
    "时以诸经舛缪，与同列李愚委学官田敏等，取西京郑覃所刊石经，雕为印版，流布天下，后进赖之。明宗崩，唐末帝嗣位，以道为山陵使，礼毕，出镇同州，循故事也。道为政闲澹，狱市无挠。一日，有上介胡饶，本出军吏，性粗犷，因事诟道于牙门，左右数报不应。",
    "贞元初，以习女直字试补户部令史，转尚书省令史。大定七年，选授吏部主事，历右补阙、修起居注。",
    "六月，繼遷所驅脅內屬戎人橐駝路熟藏族首領乜遇率部族反攻繼遷，其弟力戰而死，既敗繼遷之衆，復來歸附。以遇為檢校司空，領會州刺史。",
    "丙寅，以辅国长史明胤为冀州刺史。夏四月戊辰，以后将军刘义綦为湘州刺史。甲申，以平西将军、雍州刺史硃修之为安西将军、荆州刺史。丙戌，镇军将军、南兗州刺史沈庆之大破鲁爽于历阳之小岘，斩爽。",
    "十九年，立子光为太子，高厚傅之，令会诸侯盟於锺离。二十七年，晋使中行献子伐齐。",
    "重熙初，封楚王，为北院枢密使。",
    "重诲数请行军法，明宗不听，后重诲见杀，乃起王为左卫大将军、西京留守。长兴三年，为凤翔节度使。王子重吉自明宗时典禁兵，为控鹤指挥使，愍帝即位，硃弘昭、冯赟用事，乃罢重吉兵职，出为亳州团练使。又徙王为北京留守，不降制书而宣授，又以李从璋为代。",
    "授南京礼科给事中。武宗嗣位，复先朝所汰诸冗费，蕃等力争，不纳。后起江西参议，从都御史陈金讨平东乡寇。嘉靖时，累官工部右侍郎。",
    "九年，入为平章政事，奏睿宗收复陕西功数事，上嘉纳之，藏之秘府。封定国公。十一年，薨。上方击球，闻讣遂罢。",
    "秩满将归，群蛮追送，赂遗甚多，轸一无所受，去如初至。又除池阳令，为雍州十一郡最。百姓生为立祠，得罪者无怨言。累迁尚书郎。",
    "戊申，以常山王演为大丞相、都督中外诸军、录尚书事。以大司马、长广王湛为太傅、京畿大都督。以司徒段韶为大将军。",
    "十一年，司直官罢，以林代郭宪为光禄勋。内奉宿卫，外总三署，周密敬慎，选举称平。",
    "祖直，平远将军、柔玄镇将。入为镇北大将军，内外三都大官，赐爵长进侯。卒，赠幽州刺史，谥曰简。",
    "丙辰，太常寺少卿兼翰林院侍读学士刘定之入阁预机务。是月，断藤峡贼复起。",
    "四十年秋，寇六万余骑犯居庸岔道口，应熊被围于南沟，中五枪堕马，参将胡镇杀数人夺之归。其冬，复为右都督，充总兵官，镇守大同。以招徕塞外人口，增俸一级。四十二年，寇大举犯畿辅，诏应熊等入援，诸镇兵尽集，见敌势盛，不敢击。",
    "廷珪佯不晓，曰：吾何德，敢受令公拜乎！及见，卒不肯加礼。入梁为礼部尚书。",
    "上元二年十月，追入朝，拜尚书左丞。",
    "义熙三年，以氐王杨国为北秦州刺史。十四年，置东秦州，刘义真为刺史。郭恭为梁州刺史，尹雅为秦州刺史。宋文帝为荆州都督，督秦州，又进督北秦州。",
    "累迁侍讲学士，擢詹事，掌翰林院。疏请早建东宫。十九年，拜礼部右侍郎，领詹事府事。明年，改吏部，进左侍郎，教习庶吉士。",
    "后豪杰并起，仁亦阴结少年，得千余人，周旅淮、泗之间，遂从太祖为别部司马，行厉锋校尉。太祖之破袁术，仁所斩获颇多。从征徐州，仁常督骑，为军前锋。",
    "政和二年，京復赴都堂治事，於是深復入為門下侍郎。",
    "安南将军、湘州刺史华皎谋反，丙申，以中抚大将军淳于量为使持节、征南大将军，总率舟师以讨之。六月壬寅，以中军大将军、司空徐度进号车骑将军，总督京邑众军，步道袭湘州。闰月癸巳，以云麾将军新安王伯固为丹阳尹。秋七月戊申，立皇子至泽为皇太子，赐天下为父后者爵一级，王公卿士已下赉帛各有差。",
    "秋七月辛亥朔，日有食之。甲寅，遣使视诸道禾稼。辛酉，南院枢密使室昉为中京留守，加尚父。",
    "五月己亥，割郢州随郡属雍州。丙午，以后军司马张牧为交州刺史。",
    "大同初，新喻侯萧映为吴兴太守，甚重高祖，尝目高祖谓僚佐曰：此人方将远大。及映为广州刺史，高祖为中直兵参军，随府之镇。映令高祖招集士马，众至千人，仍命高祖监宋隆郡。所部安化二县元不宾，高祖讨平之。",
    "太元中，孝武帝博求异闻，始于辽东得之，以相考校，多有不同，书遂两存。子潜、放。潜字齐由，为豫章太守。",
    "举进士，为史思明判官，历事思明、朝义，常掌兵事。朝义之败，说降于军前，郭子仪爱其才，留于幕下。累授长安令、秘书少监，迁吏部侍郎、太子詹事，以才干称。谈者或以宰相许之，金吾将军裴儆谓谏议大夫柳载曰：以鄙夫所度，说得祸不久矣。",
    "永兴元年，改授镇北大将军、都督鄴城守诸军事。",
    "迁中都都转运使，转吏部尚书。上疏论台谏，其大旨谓：台官自大夫至监察，谏官自大夫至拾遗，陛下宜亲择，不可委之宰相，恐树私恩，塞言路也。",
    "乃遣使报汉，因请立张耳为赵王，以镇抚其国。",
    "天庆八年中进士丙科，授秘书省校书郎，至大定府金源令。归朝为御前承应文字。",
    "刘衮，彭城人。神爽气俊，富有文藻，繇进士第任左拾遗，与扈载齐名，年二十八而卒。",
    "崇祯元年进士。授诸暨知县。少孤，母训之严。及为令，祖帐归少暮，母诃跪予杖，曰：朝廷以百里授酒人乎！章伏地不敢仰视。",
    "庚寅，沙州留后曹元深加检校太傅，充沙州归义军节度使。癸巳，发禁军万人并家口赴东京。乙巳，于阗、回鹘入朝使刘再成等并授怀化大将军、将军郎将，放还蕃。二月庚戌，御札取今月十一日车驾还东京，沿路州府，不用修饰行宫；食宿顿递，并以官物供给；文武臣僚除有公事合随驾外，并先次进发。",
    "初为岐国妃，天德二年封为惠妃，九月，立为皇后。",
    "十二月壬午，李曾伯依舊資政殿學士、湖南安撫使兼廣南制置使，移司靜江府。丁未，熒惑入氐。六年春正月辛亥朔，以丁大全參知政事兼同知樞密院事，林存兼權參知政事。癸亥，詔出封樁庫銀萬兩付蜀閫。",
    "仇悆字泰然，益都人。大觀三年進士，授邠州司法，讞獄詳恕，多所全活。為鄧城令，滿秩，耆幼遮泣不得去。徙武陟令，屬朝廷方調兵數十萬于燕山，悆餽饟畢給。",
    "甲子，以大雨未止，放朝参两日。洛水涨泛二丈，庐舍居民有溺死者。以前濮州刺史武延翰为右领军上将军，前阶州刺史王宏贽为左千牛上将军。金、徐、安、颍等州大水，镇州旱。",
    "景宗即位，召见，对称旨，知可任以事，拜南院枢密使，寻加兼政事令。",
    "戊申，以福建观察使鲍防为洪州刺史、江西团练观察使。癸丑，上诞日，不纳中外之贡，唯李正己、田悦各献缣三万匹，诏付度支。",
    "崔龟从，字玄告，清河人。祖璜，父诚，官微。龟从，元和十二年擢进士第，又登贤良方正制科，及书判拔萃二科，释褐拜右拾遗。",
    "逾月，加检校右仆射。",
    "以安西将军、武州刺史吴明彻为南荆州刺史。庚寅，以安左将军鲁悉达为安南将军、吴州刺史。辛卯，老人星见。",
    "长子顷襄王立，以其弟子兰为令尹。",
    "未行，属相州官军为史思明所败，东京震骇。元帅司徒郭子仪镇谷水，乃以瑱为陕州刺史，充陕、虢等州节度，并潼关防御、团练、镇守使。乾元三年四月十三日，襄州军将张维瑾、曹玠率众谋乱，杀刺史史翙。",
    "武少以经行著称，常教授于大泽中，不交时事，名显关西。延熹八年，长女选入掖庭，桓帝以为贵人，拜武郎中。其冬，贵人立为皇后，武迁越骑校尉，封槐里侯，五千户。",
    "戊午，诏求直言，北王府郎君耶律海思应诏，召对称旨，特授宣徽使。诏政事令僧隐等以契丹户分屯南边。戊辰，晋函安重荣首来献。",
    "庚辰，以資政殿大學士賀允中為知樞密院事兼參知政事。辛巳，詔振淮東被水州縣。",
    "以参知政事把胡鲁权尚书右丞、左副元师，元帅左都监承立为右监军权参知政事，同行尚书省元帅府于京兆。庚辰，东平元帅府总领提控蒲察山儿破红袄贼于聊城。",
    "再叙功，世荫外卫副千户，进副总兵。八年秋，命为援剿总兵官，督关外兵三千讨流贼。十月至河南，巡抚陈必谦、监纪推官汤开远令与左良玉抵灵宝，至则挫张献忠于焦村。",
    "恢卒后，汝南孟建为凉州刺史，有治名，官至征东将军。贾逵宇梁道，河东襄陵人也。",
    "武定七年，除太常卿。",
    "令坤以詰孟俊，孟俊具伏，令坤乃殺之。慕容延釗，太原人。父章，襄州馬步軍都校、領開州刺史。",
    "嗣复七八岁时已能秉笔为文。年二十，进士擢第。二十一，又登博学宏词科，释褐秘书省校书郎。",
    "九月庚寅，杜正伦兼中书令。",
    "甲辰，赐国王和童金二百五十两、银七百五十两。立皇太子卫率府，发军千五百人修五台山佛寺。",
    "正统中，再迁职方郎中。郕王监国，谦荐擢本部右侍郎。谦御寇城外，宁掌部事，命赴军中议方略。",
    "高祖践阼，授幽州道行营都部署。",
    "居二年，徐绍吉、韩浚以京察夺其官。庭再迁郎中，被齮龁。引退，抑郁以死。又有闻喜李俸者，为刑部郎中。",
    "癸酉，前江都令祖皓起义，袭广陵，斩贼南兗州刺史董绍先。侯景自帅水步军击皓。二月癸未，景攻陷广陵，皓等并见害。丙戌，以安陆王大春为东扬州刺史。",
    "琬年七岁，在傍，曰：何不言日食之余，如月之初？琼大惊，即以其言应诏，而深奇爱之。后琼为司徒，琬以公孙拜童子郎，辞病不就，知名京师。",
    "完颜赛不白撒(一名承裔)赤盏合喜完颜赛不，始祖弟保活里之后也。状貌魁伟，沉厚有大略。初补亲卫军，章宗时，选充护卫。",
    "太宗即位，遷右廂都指揮使、領本州團練使，遷雲州觀察使。太平興國四年，從征太原，領鎮州駐泊都鈐轄。",
    "章奴明敏善谈论。大安中，补牌印郎君。"
  ],
  "文化/历史记载": [
    "又《易传》曰：公能其事，序贤进士，后必有喜。反之，则白虹贯日。以甲乙见者，则谴在中台。",
    "《通鉴》：自通至镇，承安重诲指，籍军府甲仗数上之，以为从珂私造，赖王德妃居中保护，从珂由是得免。及末帝即位，自通忧悸求死。",
    "刘向《洪范五行传》曰：山者，君之象；水者，阴之表，人之类也。天戒若曰，君人拥威重，将崩坏，百姓不得其所。",
    "今考《旧唐书》列传云：处直，字允明，处存母弟也。初为定州后院军都知兵马使，汴人入寇，处直拒战，不利而退，三军大噪，推处直为帅，乃权知留后事。",
    "若麟者，前有治世如尧、舜、禹、汤、文、武、周公之世，未尝一出，其一出而当乱世，然则孰知其为瑞哉？龟，玄物也，污泥川泽，不可胜数，其死而贵于卜官者，用适有宜尔。而《戴氏礼》以其在宫沼为王者难致之瑞，《戴礼》杂出于诸家，其失亦以多矣。驺虞，吾不知其何物也。《诗》曰：吁嗟乎驺虞！贾谊以谓驺者，文王之囿；虞，虞官也。",
    "收定报书云：想境内清晏，今万国安和。南人复书，依以为体。",
    "考是书《少帝纪》云：追册故妃张氏为皇后。《张从训传》亦云，高祖镇太原，为少帝娶从训长女为妃。",
    "世语曰：鲁遣五官掾降，弟韂横山筑阳平城以拒，王师不得进。",
    "此大夫命其妾子，以为母所慈，犹曰贵父命，为之三年，况天子命其子为列国王，命其所生母为国太妃，反自同公子为母练冠之与大功乎？轻重颠倒，不可之甚者也。《传》曰：始封之君，不臣诸父昆弟，则当服其亲服。若鲁卫列国，相为服期，判无疑矣。何以明之？《丧服》：君为姑姊妹女子嫁于国君者，《传》曰：何以大功？尊同也。",
    "守恩杀契丹使者，举镇来降。《宋史·李万超传》云：张从恩将弃城归契丹，会前骁卫将军王守恩服丧私第，从恩即委以后事遁去。及契丹使至，专领郡务，守恩遂无所预，万超奋然谓其部下曰：我辈垂饵虎口，苟延旦夕之命，今欲杀使保其城，非止逃生，亦足建勋业，汝曹能乎？众皆跃然喜曰：敢不唯命。遂率所部大噪入府署，杀其使，推守恩为帅，列状以闻。",
    "明年，王旅北讨关河。《经》曰：敬用五事：一曰貌，二曰言，三曰视，四曰听，五曰思。貌曰恭，言曰从，视曰明，听曰聪，思曰睿。",
    "董巴《志》曰：内常侍，右貂金珰，银附蝉，内书令亦同此。今宦者去貂，内史令金蝉右貂，纳言金蝉左貂。开皇时，加散骑常侍在门下者，皆有貂蝉，至是罢之。",
    "万木摇落而生华，阴阳黩也。《传》曰：天反时为灾。",
    "景仁弃宛陵，以腹心百人归吴越王钱镠，《新唐书·杨行密传》：渥求茂章亲兵不得，宣辇帷帟以行，茂章谩骂不与。逾年，遣兵五千袭之，茂章奔杭州。镠辟为两府行军司马，具以状闻。",
    "是则歌奏之义，当合经礼，考之古典，于制为雅。《书》曰：予欲闻六律五声八音，在治忽始。",
    "谚曰：树稼，达官怕。必有大臣当之，吾其死矣。十一月薨，时年六十三。上闻之，号叫失声，左右皆掩涕。",
    "清泰中，改安州节度使。及高祖即位，与契丹敦好，文进以尝背契丹，居不自安。马令《南唐书》：文进居数镇，颇有善政，兵民爱之。",
    "高祖曰：《论语》称：冉子退朝，孔子问曰：何晏也？对曰：有政。子曰：其事也。",
    "自古及今，德义不立而利用克宣，人庶不安而财货可保，因以兴邦固位者，未之有也。故曰：财散则人聚，财聚则人散。",
    "与鱼同占。京房《易飞候》曰：食禄不益圣化，天视以虫。虫无益于人而食万物也。",
    "及太祖北征，以候骑之误，落然无所具，而复壁垒荒圮，帑廪空竭，太祖怒，贬柳州司户，寻赐死于相州。《通鉴》：开化元年丙午，至相州，刺史李思安不意帝猝至，落然无具，坐削官爵。二年正月丁卯，帝至获嘉，追思李思安去岁供馈有阙，贬柳州司户，寻长流思安于崖州，赐死。邓季筠，宋州下邑人也。"
  ],
  "政治/诏谕事件": [
    "秋七月己丑，瓦剌也先寇大同，参将吴浩战死，下诏亲征。吏部尚书王直帅群臣谏，不听。癸巳，命郕王居守。",
    "戊辰，幸迎春苑。甲戌，诏：每年新及第进士及诸科闻喜宴，宜令宣徽院指挥排比。",
    "己丑，祈雪于會靈觀。丁酉，出知雜御史曹修古，御史郭勸、楊偕，推直官段少連。十二月甲寅，詔吏部銓：選人父母年八十以上者，權注近官。",
    "诏以弼保傅东宫，有老成之勤，赐帛千匹、绵千斤。迁尚书令。弼虽事务殷凑，而读书不辍，端谨慎密，口不言禁中之事，功名等于张黎而廉不及也。",
    "詔舉良吏，擢知乾州。",
    "庚午，旱，谕百官修省。五月甲申，诏内外官慎刑狱。",
    "十二月甲寅，諜言北界禁民妄傳起兵，帝諭大臣當自治，為安邊息民之計。",
    "二月己丑，从阿老瓦丁、燕公楠之请，以杨琏真加子宣政院使暗普为江浙行省左丞。诏：上都管仓库者无资品俸秩，故为盗诈，宜于六品、七品内委用，以俸给之。高丽国王王睶请易名曰昛，其签议府请升签议司，降二品印，从之。减河南、江浙海运米四十万石。",
    "里吏尝有过笞陈馀，陈馀欲起，张耳蹑之，使受笞。吏去，张耳乃引陈馀之桑下而数之曰：始吾与公言何如？今见小辱而欲死一吏乎？陈馀然之。秦诏书购求两人，两人亦反用门者以令里中。",
    "又詔：三省、樞密院獨班奏事日，無得過三班。若三省俱獨班，則樞密院當請奏事。其見任官召對訖，次日即朝辭回任聽旨。元祐中，宰臣呂大防言：昨垂簾聽政，惟許臺諫以二人同對，故不正之言無得以入。",
    "既而诏择义军为三等，阿鲁带奏：自去岁初置帅府，已按阅本军，去其冗食。部分既定，上下既亲，故能所向成功，此皆血战屡试而可者。父子兄弟自相救援，各顾其家，心一力齐，势不可离。",
    "訖太祖朝不起。太宗即位，詔授金紫光祿大夫、尚書兵部侍郎致仕。歲餘卒。",
    "丙子，遣近侍康末怛等十三人入城索兵器，为逻卒所害。丁丑，諲歙复叛，攻其城，破之。驾幸城中，諲歙请罪马前。诏以兵卫諲歙及族属以出。",
    "免西京今年丝银税。甲申，免高丽酒课。乙酉，宋夏贵攻蕲县。谕诸路管民官，毋令军马、使臣入州城、村居、镇市，扰及良民。",
    "其哀册曰：维上元元年，太岁庚子，六月己未朔，二十六日甲申，皇第十二子、持节凤翔等四州节度观察大使兴王佋，薨于中京内邸，殡于寝之西阶。粤八月丁亥，册赠皇太子，庙号恭懿。冬十一月庚寅，诏葬于长安之高阳原，礼也。",
    "壬辰，以新除征虏将军江夏王宝玄为郢州刺史。永明中，御史中丞沈渊表百官年登七十，皆令致仕，并穷困私门。庚子，诏曰：日者百司耆齿，许以自陈，东西二省，犹沾微俸，辞事私庭，荣禄兼谢，兴言爱老，实有矜怀。自缙绅年及，可一遵永明七年以前铨叙之科。",
    "封漆水郡王，迁上京留守，薨。诏以家贫，给葬具。",
    "宗明抗疏救，且曰：连坐非善政。今以一人妄言，必究主使，廷臣孰不惧？况名搒掠已极，当严冬或困毙，将为仁明累。帝大怒，谓宗明即其主使，并下诏狱，谪福建右参政。",
    "三月，矫诏使黄门孙虑斋至许昌以害太子。初，太子恐见鸩，恆自煮食于前。虑以告刘振，振乃徙太子于小坊中，绝不与食，宫中犹于墙壁上过食与太子。",
    "立命中使宣旨，令送本军，孟容系之不遣。中使再至，乃执奏曰：臣诚知不奉诏当诛，然臣职司辇毂，合为陛下弹抑豪强。",
    "乙丑，幸天开殿。己巳，诏罢来流水、混同江护逻地，与民耕牧。三月庚寅，以禁苑隙地分给百姓。戊申，以韩昉为翰林学士。",
    "诏大司马曹真、大将军司马宣王伐蜀。",
    "五月，诏曰：粤人之俗，好相攻击，前时秦徙中县之民南方三郡，使与百粤杂处。",
    "自晋以后，八座及郎中多不奏事。天监元年诏曰：自礼闱陵替，历兹永久，郎署备员，无取职事。糠粃文案，贵尚虚闲，空有趋墀之名，了无握兰之实。",
    "六年，詔諸道試官皆隔一郡選差，後又令歷三郡合符乃聽入院，防私弊也。帝欲令文士能射御，武臣知詩書，命討論殿最之法。",
    "庚戌，闽王王昶、威武军节度使王继恭遣僚佐林思、郑元弼等朝贡，致书于宰执，无人臣之礼。帝怒，诏令不受所贡，应诸州纲运，并令林思、郑元弼等押归本道。既而兵部员外郎李知损上疏，请禁锢使人，籍没纲运。",
    "及诏下讨贼，兵出，逗留不进，阴与承宗通谋，令军士潜怀贼号，又高其刍粟之价，售于度支，讽朝廷求宰相；且诬奏诸军与贼通，兵不可进。上深患之。",
    "疏入，帝震怒，抵之地，遍召大珰谕曰：册封贵妃，初非为东宫起见，科臣奈何讪朕！手击案者再。诸珰环跪叩首，怒稍解，遂降旨：贵妃敬奉勤劳，特加殊封。",
    "继祖子宁，宁子复。弘治五年诏曰：太庙配享诸功臣，其赠王者，皆佐皇祖平定天下，有大功。",
    "真君四年，从驾讨蠕蠕，战没。世祖悼惜之，诏求沓干子。",
    "及妹立为后，进封元妃。哀宗即位，诏尊为皇太后，号其宫曰慈圣。",
    "四色官四人，二人立於將軍之南，與繖、扇一列。宣敕放仗二人，在引駕官南。",
    "壬寅，营于滹沱北，诏休哥以骑兵绝宋兵，毋令入邢州；命太师王六谨侦候。癸卯，小校曷主遇宋辎重，引兵杀获甚众，并焚其刍粟。甲辰，诏南大王与休哥合势进讨，宰相安宁领迪离部及三克军殿。上率大军与宋将刘廷让、李敬源战于莫州，败之。",
    "尹皓、段凝辈素忌鄩，遂构其罪，言鄩逗留养寇，俾俟援兵，末帝以为然。及兵败，诏归洛，河南尹张宗奭承朝廷密旨，逼令饮鸩而卒。时年六十四，诏赠中书令。",
    "京城外，則庶官通用。神宗熙寧之制，非品官禁用青蓋，京城惟執政官及宗室許用。哲宗紹聖二年，詔在京官不得用涼扇。徽宗政和三年，以燕、越二王出入，百官不避，乃賜三接青羅繖一，紫羅大掌扇二，塗金花鞍韉，茶燎等物皆用塗金，遂為故事。",
    "峻年长于太祖二岁，太祖虽登大位，时以兄呼之，有时呼表字，不忘布衣之契也。峻以此益自负焉。广顺元年冬，刘崇与契丹围晋州，峻请行应援，太祖用为行营都部署，以徐州节度使王彦超为副。诏诸军并取峻节度，许峻以便宜从事，军行资用仰给于官，随行将吏得自选择。",
    "己未，詔淮南、江東、福建各權添置武臣提刑一員。辛酉，罷蘇、杭州造作局及御前綱運。乙丑，罷西北兵更戍。罷木石彩色等場務。",
    "庚子，詔求直言。御史中丞王陶乞許舉知縣資序人為御史裏行，從之。癸卯，王安石出知江寧府。",
    "丁巳，遣河南行省平章政事玥珞普华于西番为僧。己未，太阴犯垒壁阵。辛酉，赐宣让王帖木儿不花市宅钱四千锭，诏帖木儿不花王府官属，朝贺班次列于有司之右。",
    "帝手诏曰：适得太真表如此。今大事新定，朝廷须才，不有君子，其能国乎！方今外务差轻，欲停此事。彝上疏深自捴挹，内外之任并非所堪，但以坟柏在此郡，欲暂结名义，遂补彝宣城内史。",
    "筑图苏湖城，作迎驾殿。秋八月，陈时可、高庆民等言诸路旱蝗，诏免今年田租，仍停旧未输纳者，俟丰岁议之。",
    "皇太后诏有司复长安南北郊。四月己卯，葬延陵。赞曰：臣之姑充后宫为婕妤，父子昆弟侍帷幄，数为臣言：成帝善修容仪，升车正立，不内顾，不疾言，不亲指，临朝渊嘿，尊严若神，可谓穆穆天子之容者矣！博览古今，容受直辞。公卿称职，奏议可述。",
    "戊戌，詔：李純乃皇后親姪，可特除閤門宣贊舍人。十二月癸卯，帝率羣臣上壽皇聖帝玉牒、聖政、會要于重華宮。丙午，蠲歸正人賦役三年。",
    "七年七月，签宣德、西京、平阳、太原、陕西五路人匠充军，命各处管匠头目，除织匠及和林建宫殿一切合干人等外，应有回回、河西、汉儿匠人，并札鲁花赤及札也、种田人等，通验丁数，每二十人出军一名。八年七月，诏：燕京路保州等处，每二十户签军一名，令答不叶儿统领出军。",
    "因贺大定八年正旦，遣奏告使殿前太尉芭里昌祖等以仁孝章乞良医为得敬治疾，诏保全郎王师道佩银牌往焉。",
    "山东人饥，诏开仓振之。罢塞围作。遂西幸上党。",
    "定其成議，則民心固而河之順復有時，可以保其無害。詔：令吳安持同都水監丞鄭佑，與本路安撫、轉運、提刑司官，具圖、狀保明聞奏，即有未便，亦具利害來上。三月癸酉，監察御史郭知章言：河復故道，水之趨東，已不可遏。近日遣使按視，逐司議論未一。",
    "三年，后阴召诸弟议，欲立少子重元。重元以所谋白帝，帝收太后符玺，迁于庆州七括宫。",
    "歷開封府士、工、儀曹。詔納其女為康王妃。",
    "召张柔及其子弘范率兵二千诣京师。丙午，命诸王合必赤总督诸军，以不只爱不干及赵璧行中书省事于山东，宋子贞参议行中书省事，以董源、高逸民为左右司郎中，许便宜从事。真定、顺天、河间、平滦、大名、邢州、河南诸路兵皆会济南。以中书左丞阔阔、尚书怯烈门、宣抚游显行宣慰司于大名，洺滋、怀孟、彰德、卫辉、河南东西两路皆隶焉。",
    "尚书左仆射、宋国公萧瑀为太子少师。丙午，诏：齐故尚书仆射崔季舒、给事黄门侍郎郭遵、尚书右丞封孝琰等，昔仕鄴中，名位通显，志存忠谠，抗表极言，无救社稷之亡，遂见龙逢之酷。其季舒子刚、遵子云、孝琰子君遵，并以门遭时谴，淫刑滥及。宜从褒奖，特异常伦，可免内侍，量才别叙。",
    "文武百官素服纱帽，迎谒契丹主于郊次，俯伏俟罪，契丹主命起之，亲自慰抚。契丹主遂入大内，至昏出宫，是夜宿于赤堈。契丹主下诏，应晋朝臣僚一切仍旧，朝廷仪制并用汉礼。戊子，杀郑州防御使杨承勋，责以背父之罪，令左右脔割而死。",
    "三月癸亥，诏内外衆官九品以上，各荐一人。又诏求忠谠，无所隐讳。己巳，以新除翊左将军永阳王伯智爲尚书仆射。夏四月丙申，立皇子永康公胤爲皇太子，赐天下爲父后者爵一级，王公以下赉帛各有差。",
    "冬，十二月，己丑，诏曰：缘淮戍将，久处边劳，三元行始，宜沾恩庆。可遣中书舍人宣旨临会。后每岁皆如之。",
    "天子意欲遂困胡，乃下诏曰：高皇帝遗朕平城之忧，高后时单于书绝悖逆。昔齐襄公复九世之雠，春秋大之。是岁太初四年也。且鞮侯单于既立，尽归汉使之不降者。",
    "不从。尚书省奏上更定给发虎符制，著于令。庚戌，谕宰臣曰：诸路旱，或关执政。今惟大兴、宛平两县不雨，得非其守令之过欤？司空襄、平章政事万公、参知政事揆上表待罪。",
    "四十年秋，寇六万余骑犯居庸岔道口，应熊被围于南沟，中五枪堕马，参将胡镇杀数人夺之归。其冬，复为右都督，充总兵官，镇守大同。以招徕塞外人口，增俸一级。四十二年，寇大举犯畿辅，诏应熊等入援，诸镇兵尽集，见敌势盛，不敢击。",
    "丙子，诏尚书、御史大夫、左右丞、侍郎举任刺史者。",
    "夏四月丙寅，诏内外官行久任之法。五月辛丑，穆宗神主祔太庙。八月己巳，振山西灾。庚午，振淮、扬、徐水灾。",
    "诏江淮行省遣蒙古军五百、汉兵千人，从皇子镇南王镇杨州。执河间都转运使张庸，仍遣官钩考其事。",
    "甲申，诏骠骑大将军、尚书令李崇，中军将军、兼尚书右仆射元纂率骑十万讨蠕蠕，出塞三千余里，不及而还。秋七月辛亥，诏曰：达尊斯在，齿预一焉，崇敬黄耇，先代通训。故方叔以元老处位，充国缘自强见留。",
    "有旨：朕知沈明仁奸恶，其严鞫之。戊午，遣中书右丞相伯答沙持节授皇太子玉册。",
    "诏崇为使持节、都督陇右诸军事，率众数万讨之。崇槎山分进，出其不意，表里以袭。群氐皆弃灵珍散归，灵珍众减大半。",
    "诏曰：夫善著则祚远，勋彰故事殊。以宣孟之忠，蒙后晋国；子文之德，世嗣获存。",
    "詔改太府少卿，遷顯謨閣、知太平州，調江西轉運使。嘉定十一年卒於官，年六十四。",
    "十一年，兀朮恥順昌之敗，復謀再入，詔大合兵於淮西以待。",
    "成祖初，僧智光使其地。永乐四年遣使入贡，诏授灌顶国师，赐之诰。明年遣使入谢，封为护教王，赐金印、诰命，国师如故。",
    "夜自经死。宝秀至京，下诏狱。大学士赵志皋上言：顷臣卧病，闻中外人情汹汹，皆为矿税一事。南康守吴宝秀逮系时，其妻至投缳自尽，阖郡号呼，几成变乱。",
    "久之，召拜刑部尚书。开元九年，上幸东都，令充京师留守。",
    "秋七月，京师旱。诏中都官徒各除半刑，谪其未竟，五月已下皆免遣。丁巳，幸洛阳寺，录囚徒，举冤狱。收洛阳令下狱抵罪，司隶校尉、河南尹皆左降。",
    "二十一年遣使诣五国及鼻骨德、乌古、敌烈四部捕海东青鹘。道宗清宁二年诏二女古部与世预宰相、节度使之选者，免皮室军役。三年五国部长贡方物。八年吾独婉惕隐屯秃葛等乞岁贡马、驼，许之。",
    "丙辰，诏大都督、兼尚书仆射、行台源子恭率步骑一万出自西道，行台杨昱领都督李侃希等部募勇士八千往从东路，防讨之。",
    "兴元、凤翔、泾州、邠州岁荒，禁酒。庚子，敕各省平章为首者及汉人省臣一员，专意访求遗逸，苟得其人，先以名闻，而后致之。以江浙行中书省左丞高昉为中书参知政事。丁未，诏改元延祐。",
    "回鹘可汗王仁美进野马、独峰驼、玉团、冈砂等方物。甲戌，永寿长公主薨，辍朝一日。故泾州节度观察留后卢顺密赠右骁卫上将军。丁丑，诏禁止私下打造铸泻铜器。",
    "丙子，敕：北边使者，非军机毋给驿。丁未，置内正司，秩正三品，卿、少卿、丞各一员。戊申，升典内院秩正二品。",
    "诏假镇西将军、都督长孙稚讨双炽，平之。丙子，义阳王略改封东平王。卫大将军、西道都督元恆芝为车骑大将军、仪同三司。戊寅，诏复京兆王继本封江阳王。",
    "世宗显德四年夏四月癸未，诏曰：礼以缘情，恩以悼往，矧在友于之列，尤钟恻怆之情。故皇弟赠太保侗、赠司空信，景边初启，大年不登，俾予终鲜，实勤予怀。",
    "郭逵以簽書樞密宣撫陝西，詔令還都。陶言：韓琦置逵二府，至用太祖故事，出師劫制人主，琦必有姦言惑亂聖德。願罷逵為渭州。",
    "诏赠崇义军节度使，谥忠敬。",
    "八月丁酉，命开平守臣释奠于宣圣庙。成宗即位，诏曲阜林庙，上都、大都诸路府州县邑庙学、书院，赡学土地及贡士庄田，以供春秋二丁、朔望祭祀，修完庙宇。",
    "三月丁未，诏淮北义人率户口归国者，建其本属旧名，置立郡县，即隶近州，赋给田宅，唤订一无所预。",
    "豫皆上章极论之，咸获苏息。有诏灭苏、松官田重租，豫所辖华亭、上海二县，减去十之二三。正统中，九载考绩。民五千余人列状乞留，巡按御史以闻，命增二秩还任。",
    "立兴元等处宣慰使司都元帅府于兴元路。是岁，蓟州雨血。诏：凡有水田之处，设大兵农司，招集人夫，有警乘机进讨，无事栽植播种。",
    "灵太后令从之。寻除北海太守，有司以其更满，依例奏代。肃宗诏曰：光伯自莅海沂，清风远著，兼其兄光韶复能辞荣侍养，兄弟忠孝，宜有甄录。",
    "庚辰，以資政殿大學士賀允中為知樞密院事兼參知政事。辛巳，詔振淮東被水州縣。",
    "戊寅，帝以久旱，咸秩群神；自癸未不食至于乙酉，是夜澍雨大洽。丁亥，诏曰：炎阳爽节，秋另卷澍，在予之责，实深悚栗，故辍令膳三晨，以命上诉。灵鉴诚款，曲流云液。",
    "從之。崇寧元年，詔：大宗正丞，大理正，諸寺監丞，太學、武學、律學博士，太學正、錄，諸宮院、諸州教授，堂除外，其吏部闕不許占差已授未赴及初到任人。",
    "其速议升除。庚戌，上如顺州春水。癸丑，还都。丙辰，诏：自今官长不法，其僚佐不能纠正又不言上者，并坐之。",
    "长庆二年三月，召为兵部尚书。时裴度亦自太原入朝。以度招怀河朔功，复留度，与工部侍郎元稹相次拜平章事。度在太原时，尝上表论稹奸邪。",
    "」明年被疾，詔遣中使將太醫診視。六年，卒，年五十九。",
    "京城钱日加碎恶，鹅眼、铁锡、古文、綖环之类，每贯重不过三四斤。十一载二月，下敕曰：钱货之用，所以通有无；轻重之权，所以禁逾越。",
    "与玄稔诏曰：去岁灾兴分野，毒起徐方，蕞尔庸夫，称兵犯命，招谕不复，猖狂罔悛，胁从三州之人，污染万姓之俗。逆顺之理，邪正坐分，果有忠臣，悉歼逆党，再清郡邑，不举干戈。",
    "又尝梦收如平生，又敕有司特赐其家粟帛。贞观七年，赠定州刺史。永徽六年，又赠太常卿，陪葬昭陵。文集十卷。",
    "三月壬子朔，颁孔颖达《五经正义》于天下，每年明经令依此考试。丙辰，上御观德殿，陈逆人房遗爱等口马资财为五垛，引王公、诸亲、蕃客及文武九品己上射。夏四月戊子，林邑国王遣使来朝，贡驯象。壬寅，以旱避正殿，减膳，亲录系囚，遣使分省天下冤狱，诏文武官极言得失。",
    "帝谕锦衣朱希孝坐以纵通汉勾贼罪，复下选诏狱。",
    "紹興二十九年十月，帝諭樞密院事王綸曰：往年宰執嘗欲盡乾鑑湖，云可得十萬斛米。朕謂若遇歲旱，無湖水引灌，則所損未必不過之。凡事須遠慮可也。",
    "從之。乾道二年詔：自今非曾經兩任縣令，不得除監察御史。",
    "壬辰，以书谕明升。二年春正月乙巳，立功臣庙于鸡笼山。",
    "家奴德哥首永中尝与侍妾瑞云言：我得天下，以尔为妃，子为大王。袴、即康还奏，诏礼部尚书张暐复讯。永中父子皆死，时论冤之。",
    "建初中，复有告延与子男鲂造逆谋者，有司奏请槛车征诣廷尉诏狱。肃宗下诏曰：王前犯大逆，罪恶尤深，有同周之管、蔡，汉之淮南。经有正义，律有明刑。",
    "诏予赠恤。从子变蛟，自有传。周遇吉，锦州卫人。",
    "甲寅，诏宰臣宣谕御史，今后上封弹奏，人自陈论，不得群署章疏。戊午，宣武帅刘洽检校司空；以汴滑节度使李澄普滑州刺史，充郑滑节度使。加李纳司空。"
  ],
  "民事/宗教事件": [
    "己丑，祈雪于會靈觀。丁酉，出知雜御史曹修古，御史郭勸、楊偕，推直官段少連。十二月甲寅，詔吏部銓：選人父母年八十以上者，權注近官。",
    "帝由左门入，就丹陛上拜位。捧册宝官由殿左门入，至几筵前。导引官奏四拜，皇太孙、亲王、皇孙陪拜丹陛上，百官陪拜思善门外。帝由殿左门入，诣大行皇帝位前，跪进册、进宝。",
    "四孟月祭，尊为九宫贵神，礼次昊天上帝，而在太清宫太庙上。用牲牢、璧币，类于天地神祇。玄宗亲祀之。如有司行事，即宰相为之。",
    "虽并功施于人，列在祀典，无天子每月拜祭告朔之文。臣等谨检《礼论》及《三礼义宗》、《江都集礼》、《贞观礼》、《显庆礼》及祠令，并无天子每月告朔之事。若以为代无明堂，故无告朔之礼，则《江都集礼》、《贞观礼》、《显庆礼》及祠令，著祀五方上帝于明堂，即《孝经》宗祀文王于明堂也。此则无明堂而著其享祭，何为告朔独阙其文？若以君有明堂即合告朔，则周、秦有明堂，而经典正文，无天子每月告朔之事。",
    "四年春正月，郊祀高祖以配天，宗祀孝文以配上帝。",
    "冬十月辛丑朔，修佛事于大内。",
    "丙午，中书右丞相完泽及文武百官议上尊谥。壬寅，始为坛于都城南七里。甲辰，遣司徒兀都带、平章政事不忽木、左丞张九思，率百官请谥于南郊。五月戊午，遣摄太尉臣兀都带奉册上尊谥曰圣德神功文武皇帝，庙号世祖，国语尊称曰薛禅皇帝。",
    "二月辛丑，视朝。戊申，大祀天地于南郊。"
  ],
  "政治/推举事件": [
    "遂共推融为河西大将军，更以统为武威大守。",
    "朕与卿等共治天下，事有可否，即当面陈。卿等致位卿相，正行道扬名之时，偷安自便，徼幸一时，如后世何？群臣皆称万岁。十二年，改沁南军节度使，召为翰林学士承旨。丞相石琚致仕，上问：谁可代卿者？琚对曰：伯雄可。",
    "洪武十二年诏郡县举元遗民。布政使沈立本密言子中于朝，以币聘。使者至，子中太息曰：死晚矣。",
    "高祖入关，丞相府司录李纲荐珪贞谅有器识，引为世子府谘议参军。",
    "三年八月，廷推南京吏部尚书，以懋衡副李三才；推吏部左侍郎，以曹于汴副冯从吾。",
    "十二年，以佥都御史巡抚南、赣。居二年，乞休，因荐前都御史万镗、大理卿董天锡等十四人可用。吏部请从其言。",
    "太尉张禹荐补博士，稍迁陈留太守，坐法免。年七十八，卒于家。",
    "全忠秩满还乡里，事节度使李可举为牙将。时可举兵锋方盛，欲与镇人分易、定，遣全忠将兵攻之，为定州军大败于易水。",
    "正统中，再迁职方郎中。郕王监国，谦荐擢本部右侍郎。谦御寇城外，宁掌部事，命赴军中议方略。"
  ],
  "民事/其他事件": [
    "丁亥，猎炭山。",
    "乙未，第五琦开决汴河。五月丁酉朔。",
    "四年春正月壬辰朔，始用乐。丁未，讲武于榆林。二月己丑，阅稼于谷水。",
    "虽非其正，水尚有所游荡。时至而去，则填淤肥美，民耕田之。",
    "丙午，高丽、鄯善国并遣使朝贡。秋七月，田于棝阳。己卯，乐平王丕等五将东伐，至和龙，徙男女六千口而还。",
    "闰月癸酉，契丹遣使者来。己卯，阅稼于西苑。九月壬寅，行营招讨使左卫上将军陈晖克襄州，执其首恶李洪。丁未，保义军节度使王檀为潞州东面行营招讨使。",
    "辛卯，猎于贵泉谷。甲辰，猎于鱼龙川，献获于大安宫。"
  ],
  "地理/雷雨風": [
    "景德二年六月甲午，大風吹沙折木。八月，福州海上有颶風，壞廬舍。三年七月丙寅，京師大風。四年三月甲寅夕，京師大風，黃塵蔽天，自大名歷京畿，害桑稼，唐州尤甚。",
    "癸丑，有贼兵犯京城，刑部郎中不花守西门，夜，开门击退之。己未，刘福通遣周全引兵攻洛阳，守将登城，以大义责全，全愧谢退兵，刘福通杀之。丙寅，以完卜花、脱脱帖木儿为中书平章政事。是月，京师大水，蝗，民大饥。",
    "二年九月己酉、十月庚戌，雷。淳祐元年十二月丙寅，雷。二年九月己丑，雷。三年三月丙辰，雷。",
    "黎安道、方脱脱、雷一声皆伏诛。是月，京师大水。河决小流口，达于清河。",
    "巩昌路伏羌县大雨，山崩。",
    "九年閏正月，淫雨。淳熙二年夏，建康府霖雨，壞城郭。三年五月，淮、浙積雨損禾麥。",
    "四年八月丙子，京師暴風。景德二年六月甲午，大風吹沙折木。",
    "建中靖國元年二月，久雨，時欽聖憲肅皇后、欽慈皇后二陵方用工，詔京西祈晴。崇寧元年七月，久雨，壞京城廬舍，民多壓溺而死者。三年六月，久雨。四年五月，京師久雨。",
    "甲子，以大雨未止，放朝参两日。洛水涨泛二丈，庐舍居民有溺死者。以前濮州刺史武延翰为右领军上将军，前阶州刺史王宏贽为左千牛上将军。金、徐、安、颍等州大水，镇州旱。",
    "嘉禾四年七月，雨雹，又陨霜。案刘向说：雹者阴胁阳。是时吕壹作威用事，诋毁重臣，排陷无辜。",
    "四年春正月乙亥，大風。濬天長縣濠。癸未，日中有黑子。壬辰，雨雹。",
    "演与乌丸单于审登谋之，于是与浚期游蓟城南清泉水上。蓟城内西行有二道，演浚各从一道。演与浚欲合卤簿，因而图之。值天暴雨，兵器沾湿，不果而还。",
    "百姓愁怨之应也。太元六年六月，荆、江扬三州大水。太元十年夏，大水。",
    "戊午，大雨雹。以呂夷簡兼判樞密院事，章得象兼樞密使，晏殊加平章事。",
    "丁亥，以江浙行省平章政事只而瓦台为河南行省平章政事。东平雨雹如马首。六月戊申，命江浙拨赐僧道田还官征粮，以备军储。壬子，济南山崩，水涌。"
  ],
  "文化/撰写事件": [
    "南康筆代耕心鑑十卷干祿寶典二十七卷薛廷珪克家志九卷趙世繁忠孝錄五卷趙世逢幽居錄五卷臧嘉猷羽書集三卷呂延祚注文選三十卷劉允濟金門待詔集五卷僧惠淨續古今詩苑英華十卷孫翌正聲集三卷崔融珠英學士集五卷竇常南薰集三卷搜玉集一卷唐崔湜至融，凡三十七人，集者不知名。",
    "《圣寿乐》，高宗武后所作也。舞者百四十人。金铜冠，五色画衣。",
    "十六年，加授开府仪同三司，寻表请致仕，听解尚书右仆射，令以开府仪同三司依旧平章事。又正受诏与魏徵等集文学之士，撰《文思博要》一千二百卷，奏之，赐物千段。",
    "武德七年，始命孝孙及秘书监窦璡修定雅乐。孝孙又以陈、梁旧乐杂用吴、楚之音，周、齐旧乐多涉胡戎之伎，于是斟酌南北，考以古音，作《大唐雅乐》。以十二月各顺其律，旋相为宫，制十二乐，合三十二曲、八十四调。",
    "既而秃发傉檀入据姑臧，且渠蒙逊基宇稍广，于是慨然著《述志赋》焉，其辞曰：涉至虚以诞驾，乘有舆于本无，禀玄元而陶衍，承景灵之冥符。廕朝云之庵蔼，仰朗日之照煦。既敷既载，以育以成。幼希颜子曲肱之荣，游心上典，玩礼敦经。",
    "《天文占》一卷《天文占气书》一卷《天文集要钞》二卷《天文书》二卷梁有《杂天文书》二十五卷。《杂天文横占》一卷《天文横图》一卷高文洪撰。《天文集占图》十一卷梁有《天文五行图》十二卷，《天文杂占》十六卷，亡。《天文录》三十卷梁奉朝请祖恆撰。",
    "父刘家奴，官至节度使。孟简性颖悟。六岁，父晨出猎，俾赋《晓天星月诗》，孟简应声而成，父大奇之。",
    "太宗时，以太医给侍。尝撰《脉诀》、《针灸书》，行于世。年九十卒。王白，冀州人，明天文，善卜筮，晋司天少监，太宗入汴得之。",
    "丙寅，左羽林统军马希崇。案：此下有脱误。十二月壬申朔，史馆奏，请差官修撰世宗实录，从之。甲戌，改万岁殿为紫宸殿。",
    "《毛诗辨异》三卷晋给事郎杨乂撰。梁有《毛诗背隐义》二卷，宋中散大夫徐广撰；《毛诗引辨》一卷，宋奉朝请孙暢之撰；《毛诗释》一卷，宋金紫光禄大夫何偃撰；《毛诗检漏义》二卷，梁给事郎谢昙济撰；《毛诗总集》六卷，《毛诗隐义》十卷，并梁处士何胤撰。",
    "作张丞相列传第三十六。结言通使，约怀诸侯；诸侯咸亲，归汉为籓辅。作郦生陆贾列传第三十七。欲详知秦楚之事，维周緤常从高祖，平定诸侯。",
    "凡二十六年，復見渭，時人異之。朱昂著莫節婦傳紀其事。梁鼎字凝正，益州華陽人。",
    "作《卓行传》。萧札剌，字虚辇，北府宰相排押之弟。性介特，不事生业。"
  ],
  "战争/防守事件": [
    "時呂頤浩節制建業，劉光世領兵鎮江，浚遣人齎蠟書，約頤浩、光世以兵來會，而命俊分兵扼吳江。上疏請復辟。傅等謀除浚禮部尚書，命將所部詣行在，浚以大兵未集，未欲誦言討賊，乃託云張俊驟回，人情震讋，不可不少留以撫其軍。會韓世忠舟師抵常熟，張俊曰：世忠來，事濟矣。",
    "初，太祖沿边设卫，惟土著兵及有罪谪戍者。",
    "五月望，安战梅林，再败，退保雩都。廷麟乃散其兵，以六月入赣，与元吉凭城守。未几，援兵至，围暂解，已，复合。八月，水师战败，援师悉溃。",
    "又令人结平虏城戍将及素所厚张钦等。会有边警，参将仇钺、副总兵杨英帅兵出防御。",
    "宗弼再取河南，宋李兴据河南府。成引军入孟津。"
  ],
  "战争/刺杀事件": [
    "淮南王长杀辟阳侯审食其。五月，匈奴入居北地、河南为寇。上幸甘泉，遣丞相灌婴击匈奴，匈奴去。",
    "庚申，军将耶律敌烈等夜劫梁王雅里奔西北部，立以为帝，改元神历。辛酉，渡河，止于金肃军北。回离保为众所杀。六月，遣使册李乾顺为夏国皇帝。",
    "燕王乃身自迎战，安部将火耳灰挺槊大呼，直前刺王。马忽蹶，被擒。",
    "下有阙文为东京留守，嗜酒，颇怠于为政。友珪弑逆，并杀友文。末帝即位，尽复官爵。",
    "绐问童子，亦如之。于是登山四顾，悄无来人，尽杀童子，驱马臂鹰而还，取海都并病妪，归八剌忽之地止焉。海都稍长，纳真率八剌忽怯谷诸民，共立为君。",
    "时高拱当国，路楷、杨顺以构杀沈炼论死。拱欲为楷地，谓顺首祸，顺死，楷可勿坐。化取狱牍示拱曰：狱故无炼名。",
    "知温即跃马登舟渡河入西寨，以骑军尽杀乱者。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "甲辰，及泰宁军节度使慕容彦超战于刘子陂，彦超败，奔于兗州。郭允明反，弑隐帝于赵村。丙戌，威入京师，纵火大掠。",
    "今谋于戚籓，欲期安复，翻索从臣、国宝，欲以此为辞，为贼算天子耶！乃抽佩刀刺敬瑭，敬瑭亲将陈晖捍之，守荣与晖单战而死，洪进亦自刎。",
    "梁祖经营霸业，外则干戈屡动，内则帑庾俱虚，齐王悉心尽力，倾竭财资助之。其年八月，昭宗遇弑，辉王即位。",
    "丙戌，军士毁白撒别墅。斜捻阿不妄杀市人之过其门者以靖乱。丁亥，拜天于承天门下，出内府及两宫物赐军士。戊子，下令招军。",
    "其将行也，从数骑至营中，别其裨将李藏机，告以避契丹之意，将士皆拜为诀。天福元年十二月，乃杀行军司马冯知兆、节度副使杜重贵等，率其部众渡淮奔于金陵。",
    "齐王田荣兵败，走平原，平原人杀荣。",
    "二月，鱼山总领张瓛作乱，杀元帅完颜胡土降北。仲德累议讨之，德全不从，即领麾下十许人，亲劝民兵得三百人，径往鱼山，而从宜严禄已诛瓛反正，仲德抚慰军民而还。",
    "二年春二月己酉，贾后弑皇太后于金墉城。秋八月壬子，大赦。",
    "及曹操击谦，徐方不安。融乃将男女万口、马三千匹走广陵。广陵太守赵昱待以宾礼。融利广陵资货，遂乘酒酣杀昱，放兵大掠，因以过江，南奔豫章，杀郡守朱皓，入据其城。",
    "未行，属相州官军为史思明所败，东京震骇。元帅司徒郭子仪镇谷水，乃以瑱为陕州刺史，充陕、虢等州节度，并潼关防御、团练、镇守使。乾元三年四月十三日，襄州军将张维瑾、曹玠率众谋乱，杀刺史史翙。",
    "五月辛卯，杀鹿人札葛。壬辰，北府宰相萧海璃薨，辍朝，罢重五宴。六月己未，支解雉人寿哥、念古，杀鹿人四十四人。是夏，驻跸褭潭。",
    "昭宗见建等责之，行瑜、茂贞惶恐战汗不能语，独建前自陈述。乃杀宰相韦昭度、李磎等，谋废昭宗。会晋举兵且至，建等惧，乃还。晋兵问罪三镇，兵傅华州，建登城呼曰：弊邑未常失礼于大国，何为见攻？晋人曰：君以兵犯天子，杀大臣，是以讨也。",
    "令坤以詰孟俊，孟俊具伏，令坤乃殺之。慕容延釗，太原人。父章，襄州馬步軍都校、領開州刺史。",
    "丙戌，废皇太子为庶人，囚之上京。己丑，回鹘来贡。杀东京留守同知耶律回里不。",
    "贼见栾悦之，杀琪及其子而诱栾。栾奋起以头触贼而仆，骂曰：我岂为犬彘所污者哉。"
  ],
  "政治/登基事件": [
    "昪将篡国，召景归金陵为副都统。昪立，封齐王。",
    "庚申，军将耶律敌烈等夜劫梁王雅里奔西北部，立以为帝，改元神历。辛酉，渡河，止于金肃军北。回离保为众所杀。六月，遣使册李乾顺为夏国皇帝。",
    "乃以为应州节度使。晋高祖入立，罢为右卫大将军。",
    "镠卒，元瓘立，袭封吴越国王，玉册、金印，皆如镠故事。王延政自立于建州，闽中大乱，元瓘遣其将仰诠、薛万忠等攻之，逾年，大败而归。",
    "下有阙文为东京留守，嗜酒，颇怠于为政。友珪弑逆，并杀友文。末帝即位，尽复官爵。",
    "開寶中，禮部再奏為考試官，調滁州軍事推官。太宗即位，擢授太子左贊善大夫，知河南縣，通判滑、梓二州。",
    "绐问童子，亦如之。于是登山四顾，悄无来人，尽杀童子，驱马臂鹰而还，取海都并病妪，归八剌忽之地止焉。海都稍长，纳真率八剌忽怯谷诸民，共立为君。",
    "壬申，即皇帝位，大赦，改年为永兴元年。",
    "时以诸经舛缪，与同列李愚委学官田敏等，取西京郑覃所刊石经，雕为印版，流布天下，后进赖之。明宗崩，唐末帝嗣位，以道为山陵使，礼毕，出镇同州，循故事也。道为政闲澹，狱市无挠。一日，有上介胡饶，本出军吏，性粗犷，因事诟道于牙门，左右数报不应。",
    "梁祖经营霸业，外则干戈屡动，内则帑庾俱虚，齐王悉心尽力，倾竭财资助之。其年八月，昭宗遇弑，辉王即位。",
    "天子意欲遂困胡，乃下诏曰：高皇帝遗朕平城之忧，高后时单于书绝悖逆。昔齐襄公复九世之雠，春秋大之。是岁太初四年也。且鞮侯单于既立，尽归汉使之不降者。",
    "秋，魏将梅敷使张俭求见抚纳。南阳阴、酂筑阳、山都、中庐五县民五千家来附。冬，魏嗣王称尊号，改元为黄初。二年四月，刘备称帝于蜀。",
    "景宗即位，召见，对称旨，知可任以事，拜南院枢密使，寻加兼政事令。",
    "名，自命也；物，自定也。今適庶名反逆，此後晋其能毋乱乎？二十七年，穆侯卒，弟殇叔自立，太子仇出奔。殇叔三年，周宣王崩。",
    "长子顷襄王立，以其弟子兰为令尹。",
    "高祖践阼，授幽州道行营都部署。",
    "睿宗即位，又为金仙、玉真公主广营二观。先是，中宗时斜封受官人一切停任，凡数百千人，又有敕放令却上。",
    "摄政八年而尧崩。三年丧毕，让丹朱，天下归舜。",
    "太宗即位，遷右廂都指揮使、領本州團練使，遷雲州觀察使。太平興國四年，從征太原，領鎮州駐泊都鈐轄。"
  ],
  "政治/赈灾事件": [
    "秋七月癸丑，侍郎叶相振陕西饥。戊午，张孚敬罢。辛巳，郑王厚烷献白雀，荐之宗庙。",
    "丁丑，金、商、房三州饑，振之。",
    "夏四月丙寅，诏内外官行久任之法。五月辛丑，穆宗神主祔太庙。八月己巳，振山西灾。庚午，振淮、扬、徐水灾。",
    "顺州民饥，以钞四千锭赈之。夜，太阴犯星宿。癸亥，日赤如赭。甲子，太阴犯箕宿。",
    "秋七月壬戌，鄱阳民进书毁先贤，杖之，毁其书。丙寅，振江西、湖广水灾。",
    "庚辰，以資政殿大學士賀允中為知樞密院事兼參知政事。辛巳，詔振淮東被水州縣。",
    "京兆尹裴耀卿为黄门侍郎，前中书侍郎张九龄起复旧官，并同中书门下平章事。是岁，关中久雨害稼，京师饥，诏出太仓米二百万石给之。二十二年春正月癸亥朔，制古圣帝明皇、岳、渎、海镇用牲牢，余并以酒酺充奠。己巳，幸东都。",
    "建元元年春正月，改元，振恤鳏寡孤独。"
  ],
  "政治/迁官事件": [
    "时与允成等同以部曹争三王并封，又争拾遗事者，户部主事滁人贾岩，亦贬曹州判官。投劾归，卒。天启中，赠允成、纳陛光禄少卿，岩尚宝丞。诸寿贤，字延之，昆山人。",
    "曾祖偲，唐太原府祁县尉，累赠右仆射。",
    "贼平入朝，上赐宴麟德殿，赏赐珍玩名马，进位侍中，改许州刺史、忠武军节度、陈许蔡等州观察使。太和七年，改授河中尹、河中节度、晋磁隰观察等使。智兴因入朝。",
    "敬嗣晖，字唐臣，易州人。登天眷二年进士第，调怀安丞，迁弘政令，补尚书省令史。有才辩，海陵为宰相，爱之，及篡立，擢起居注，历谏议大夫、吏部侍郎、左宣徽使。贞元三年八月，尚食烹饪失宜，庖官各杖二百，嗣晖与同知宣徽院事乌居仁各杖有差。",
    "恬淡退静，不竞世利，在散辈十八年不易官。太和中，除太尉东阳王谘议参军而卒。",
    "莘之战，以功转代州刺史，充石岭关以北都知兵马使，稍迁振武节度使。",
    "十六年，加授开府仪同三司，寻表请致仕，听解尚书右仆射，令以开府仪同三司依旧平章事。又正受诏与魏徵等集文学之士，撰《文思博要》一千二百卷，奏之，赐物千段。",
    "起知安慶府、知黃州，遷淮西提點刑獄兼知黃州，加直寶章閣，仍舊職，奉鴻禧祠。特授將作監、京湖制置參議官，進直煥章閣、湖北安撫副使兼知峽州，兼歸峽施黔、南平軍、紹慶府鎮撫使，遷太府少卿、大理卿，進直龍圖閣。",
    "转河内太守。永初中，坐事抵罪，卒于家。",
    "嘗監西京稅院事，留守晏殊、夏竦皆謂曰：子有清識雅度，文約而理盡，卿相才也。知新息縣，累遷太常博士。",
    "大觀四年，升為望郡。",
    "攻拔吴枳里城，破涂中屯戍。赐骞兄子惺爵关中侯。咸宁初，迁太尉，转大司马。",
    "徙为上谷太守，匈奴日以合战。典属国公孙昆邪为上泣曰：李广才气，天下无双，自负其能，数与虏敌战，恐亡之。於是乃徙为上郡太守。後广转为边郡太守，徙上郡。",
    "是月，昌齡遷工部侍郎。八月己亥，都水監言：大河以就三山通流，正在通利之東，慮水溢為患。乞移軍城於大伾山、居山之間，以就高仰。",
    "七十旁无期亲及有疾废者，各赐粟帛。筑城之夫，给复一年。二年春正月壬申，以太保尉景为太傅，以骠骑大将军、开府仪同三司厍狄干为太保。",
    "一年卒，无子，绝後，国除，入于汉。遂既王赵二十六年，孝景帝时坐晁错以適削赵王常山之郡。吴楚反，赵王遂与合谋起兵。",
    "明宗立，益面縛請罪，明宗曰：爾盡忠節，又何罪也。改本直左廂都校。",
    "復召見閱武伎，又試策略于中書，條對數千言。自殿直進閤門祗候，未幾，除濠州兵馬都監。",
    "未几，知河中府，权河东南路宣抚副使。四年，迁元帅左监军兼陕西统军使。",
    "诏加太常少卿致仕，已而削夺。崇祯初，复官。志礼性淳朴，所居多政绩，亦以行谊称于乡。",
    "授左翼统军元帅。从征陈友谅，功多，进骠骑卫指挥使。从常遇春讨赣州，降熊天瑞，为赣州卫指挥使，节制岭南北新附诸郡。调兵克梅州、会昌、湘乡，悉平诸山寨。",
    "七年，遷右司郎官兼校正。日食，上言。",
    "旋改吏部侍郎，分知铨事，而圭素保廉守节，大著公平之誉。圭前为河南少尹日，有嵩山术士遗圭石药如斗，谓圭曰：服之可以延寿，然不可中辍，辍则疾作矣。",
    "擢太府少卿，總領淮東軍馬錢糧，繼升為卿。尋除直龍圖閣，帥浙東，知紹興府。入對，奏：徽州、南康軍月樁不如期，朝廷科降額，比年曰『權免一次』，來年督促如初，適足啟吏姦、重民害，乞明詔示。",
    "宣和，改檢校為左右衞將軍，領軍衞為天武都頭，威衞為神勇都頭，武衞為宣武都頭，驍衞為虎翼都頭；殳叉第一隊減六十，增第二隊至第五隊為一百。次後隊殳仗。殳叉分五隊：第一、第二，八十人；第三，一百人；第四，八十人；第五，一百六十人。",
    "又遷吏部員外郎兼直講。",
    "高祖遂并拜焉。稍迁尚书仪曹郎，转左民郎，行颍川郡。出为华州安定王征虏府长史。",
    "及景嗣位，累遷至中書舍人。晉開運末，閩越大亂，景遣謐與諫議大夫陳覺乘傳安撫，謐遂矯詔發數郡兵攻福州。及敗，引佩刀自刺，親吏制之，不死，長流舒州。",
    "遷翰林學士，知審官、刑院。李仲昌開六塔河，民被害，詔獄薄其罪。",
    "从庄宗袭契丹于幽州，收新州，历银枪效义都指挥使，再任武州刺史。同光初，契丹陷妫、儒、檀、顺、平、蓟六州，武州独全，改授蔚州刺史。天成初，历振武、昭武留后，寻授利州节度使，入为右卫上将军。",
    "雍熙初，累遷媯州刺史，繼領本州團練使。時州郡部送亡命者至闕，左右諷殺之，達奏曰：此類竄匿者衆，豈能盡殺之哉？不如赦之，以開其自新之路，且以成好生之德。",
    "贊討平李全，援王素諫仁宗却王德用進女事，以止備嬪御，世多稱之。以資政殿學士、提舉洞霄宮，進大學士。",
    "遷寶謨閣直學士。度以人物為己任，推挽不休，每曰：無以報國，惟有此耳。",
    "兴元、凤翔、泾州、邠州岁荒，禁酒。庚子，敕各省平章为首者及汉人省臣一员，专意访求遗逸，苟得其人，先以名闻，而后致之。以江浙行中书省左丞高昉为中书参知政事。丁未，诏改元延祐。",
    "丙子，敕：北边使者，非军机毋给驿。丁未，置内正司，秩正三品，卿、少卿、丞各一员。戊申，升典内院秩正二品。",
    "荊、湘既平，加檢校太尉。是冬，卒，年五十一。初，延釗與太祖友善，顯德末，太祖任殿前都點檢，延釗為副，常兄事延釗；及即位，每遣使勞問，猶以兄呼之。",
    "亮亦与达书曰：部分如流，趋舍罔滞，正方性也。其见贵重如此。八年，迁骠骑将军。以曹真欲三道向汉川，亮命严将二万人赴汉中。",
    "加泚实封五百户，赐窦氏名园、泾水上腴田及锦彩金银器，以安其意，时滔叛故也。壬午，贬御史大夫严郢为费州长史，杖杀左巡使、殿中侍御史郑詹。郢岁余卒。五月丙戌，增两税、盐榷钱，两税每贯增二百，盐每斗增一百。",
    "武少以经行著称，常教授于大泽中，不交时事，名显关西。延熹八年，长女选入掖庭，桓帝以为贵人，拜武郎中。其冬，贵人立为皇后，武迁越骑校尉，封槐里侯，五千户。",
    "坐漏泄禁中语，左授司刑少卿，出为并州长史。道病卒，赠相州刺史。",
    "积庆宫提辖司。延昌宫提辖司。彰愍宫提辖司。崇德宫提辖司。",
    "張九成謫邵州，交游皆絕，應辰時通問。及其喪父，言者猶攻之，而應辰不遠千里往弔，人皆危之。通判袁州，凡所予奪，人無異詞。",
    "丁亥，以江浙行省平章政事只而瓦台为河南行省平章政事。东平雨雹如马首。六月戊申，命江浙拨赐僧道田还官征粮，以备军储。壬子，济南山崩，水涌。",
    "居二年，徐绍吉、韩浚以京察夺其官。庭再迁郎中，被齮龁。引退，抑郁以死。又有闻喜李俸者，为刑部郎中。",
    "此必其黨欲以滅口，不然，何以不奉詔？遂乞召對面論，仁宗深器之。再遷殿中丞，策賢良方正入等，擢太常博士、通判陳州。",
    "八年，改給事中，權知開封府。"
  ],
  "战争/劫持事件": [
    "庚申，军将耶律敌烈等夜劫梁王雅里奔西北部，立以为帝，改元神历。辛酉，渡河，止于金肃军北。回离保为众所杀。六月，遣使册李乾顺为夏国皇帝。",
    "召公为保，周公为师，东伐淮夷，残奄，迁其君薄姑。",
    "又劫持群吏，厚饵之，使为己用。",
    "制才下，承宗以兵虏昌朝归镇州。丁卯，邠宁节度使、检校司空、同平章事高崇文卒。冬十月癸酉朔，以右羽林统军阎巨源为邠州刺史、邠宁庆节度使，以少府监崔颋为同州刺史、本州防御、长春宫等使、癸未，诏：成德军节度使王承宗顷在苫庐，潜窥戎镇。",
    "右丞张良佐、左丞商暠擒彦翚杀之，保保挟俦走纳哈出营。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "昭王三十四年，白起攻魏，拔华阳，走芒卯，而虏三晋将，斩首十三万。与赵将贾偃战，沈其卒二万人於河中。昭王四十三年，白起攻韩陉城，拔五城，斩首五万。"
  ],
  "政治/赦免事件": [
    "及收至，谓兄曰：若死者有知，得见父母，岂非至愿！乃延颈就刑，颜色不变，莫不伤之。初，京兆人脂习元升，与融相善，每戒融刚直。及被害，许下莫敢收者，习往抚尸曰：文举舍我死，吾何用生为？操闻大怒，将收习杀之，后得赦出。魏文帝深好融文辞，每叹曰：杨、班俦也。",
    "天册元年，吴郡言掘地得银，长一尺，广三分，刻上有年月字。于是大赦，改年。",
    "庚戌，如鱼儿泺。三月戊寅，募天德、镇武、东胜等处勇捷者，籍为军。甲午，肆赦。夏四月甲辰，谒庆陵。",
    "秋七月甲子，秦王凯旋，献俘于太庙。丁卯，大赦天下。",
    "元年四月乙卯，赦天下。乙巳，赐民爵一级。五月，除田半租，为孝文立太宗庙。令群臣无朝贺。",
    "乙巳，赦岐州，赐高年粟帛。十月丁巳，至自岐州。十一月丁亥，徙封旭轮为冀王，改名轮。",
    "丁亥，賜將士衣服錢帛。戊子，大赦，減死罪一等。壬辰，宴孟昶及其子弟於大明殿。"
  ],
  "政治/罢免事件": [
    "乃以为应州节度使。晋高祖入立，罢为右卫大将军。",
    "左右引逵使叩头，逵叱之曰：安有国家长吏为贼叩头！援怒，将斩之。绛吏民闻将杀逵，皆乘城呼曰：负要杀我贤君，宁俱死耳！左右义逵，多为请，遂得免。初，逵过皮氏，曰：争地先据者胜。及围急，知不免，乃使人间行送印绶归郡，且曰：急据皮氏。",
    "一子宗晖，开元初封湖阳郡王。初，重俊被害，宫府僚吏莫敢近者，永和丞甯嘉勖解衣裹重俊首号哭，时人义之。宗楚客闻而大怒，收付制狱，贬为平兴丞，寻卒。睿宗践祚，下制曰：宁嘉勖能重名节，事高栾、向，幽涂已往，生气凛然。",
    "言者交攻之，遂下吏，貶秩四等，安置隨州。會侯可以言水利入見，神宗問其事，對曰：种諤奉密旨取綏而獲罪，後何以使人？帝亦悔，復其官。韓絳宣撫陝西，用為鄜延鈐轄。絳城囉兀，規橫山，令諤將兵二萬出無定川，命諸將皆受節度，起河東兵會銀州。",
    "四月巳亥，幸翠微宫。五月戊午，贬李世勣为叠州都督。己巳，皇帝崩于含风殿，年五十三。庚午，奉大行御马舆还京师。",
    "天宝五载，右相李林甫构陷刑部尚书韦坚，斌以亲累贬巴陵太守，移临安太守，加银青光禄大夫。斌授五品时，兄陟为河东太守，堂兄由为右金吾将军，縚为太子少师，四人同时列戟，衣冠之盛，罕有其比。十四载，安禄山反，陷洛阳，斌为贼所得，伪授黄门侍郎，忧愤而卒。",
    "辛巳，光禄大夫韩寿卒。甲申，败将宇文述、于仲文等除名为民，斩尚书右丞刘士龙以谢天下。",
    "宗明抗疏救，且曰：连坐非善政。今以一人妄言，必究主使，廷臣孰不惧？况名搒掠已极，当严冬或困毙，将为仁明累。帝大怒，谓宗明即其主使，并下诏狱，谪福建右参政。",
    "敏政谪官，寅泰皆斥谴。",
    "十二月乙丑，牛僧孺罢。己巳，珍王諴薨。七年正月壬辰，罢吴、蜀冬贡茶。",
    "己未，詔淮南、江東、福建各權添置武臣提刑一員。辛酉，罷蘇、杭州造作局及御前綱運。乙丑，罷西北兵更戍。罷木石彩色等場務。",
    "九年，拜检校右仆射，兼兴元尹，充山南西道节度观察使，三岁受代。十二年，除太子少师。",
    "右武卫将军石懿、左武卫将军石训并停任。",
    "甲子，汰冗官。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "又魏文帝惧于见废，夙夜自祗，竟能自全。及至明帝，因母得罪，废为平原侯，为置家臣庶子，师友文学，皆取正人，共相匡矫。兢兢慎罚，事父以孝，父没，事母以谨，闻于天下，于今称之。",
    "延熹二年，大将军梁冀诛，广与司徒韩縯、司空孙朗坐不卫宫，皆减死一等，夺爵土，免为庶人。后拜太中大夫、太常。九年，复拜司徒。",
    "五月，立襄阳王尚为皇太孙。六月戌辰，大赦，增吏位二等。复封宾徒王晏为吴王。庚午，东莱王蕤、左卫将军王舆谋废齐王冏，事泄，蕤废为庶人，舆伏诛，夷三族。",
    "天启初，起历应天府丞。御史余文缙劾向高，及一元，遂落职。",
    "兀纳奏曰：臣在先朝，诏许日取帑钱十万为私费，臣未尝妄取一钱，肯借犀角乎！天祚愈怒，夺太傅官，降宁边州刺史，寻改临海军节度使。兀纳上书曰：自萧海里亡入女直，彼有轻朝廷心，宜益兵以备不虞。",
    "景云元年七月己巳，制自今授左右仆射、侍中、中书令、六尚书已上官听让，其余停让。追废皇后韦氏为庶人，安乐公主为悖逆庶人。丁丑，改太史监为太史局，隶秘书省。八月癸巳，新除集州刺史、谯王重福潜入东都构逆，州县讨平之。",
    "丙戌，废皇太子为庶人，囚之上京。己丑，回鹘来贡。杀东京留守同知耶律回里不。",
    "居二年，徐绍吉、韩浚以京察夺其官。庭再迁郎中，被齮龁。引退，抑郁以死。又有闻喜李俸者，为刑部郎中。",
    "数月追还，复知政事。宣宗即位，罢相，出为东都留守、东畿汝都防御使。",
    "及太祖北征，以候骑之误，落然无所具，而复壁垒荒圮，帑廪空竭，太祖怒，贬柳州司户，寻赐死于相州。《通鉴》：开化元年丙午，至相州，刺史李思安不意帝猝至，落然无具，坐削官爵。二年正月丁卯，帝至获嘉，追思李思安去岁供馈有阙，贬柳州司户，寻长流思安于崖州，赐死。邓季筠，宋州下邑人也。",
    "其后贬海陵为庶人。"
  ],
  "政治/追封事件": [
    "奕留台东都，又分知东都武部选事。十四载，安禄山犯东都，人吏奔散；奕在台独居，为贼所执，与李憕同见害。玄宗闻而愍之，赠兵部尚书。",
    "粤明日，追谥曰贞懿皇后，殡于内殿之西阶。十三年十月癸酉，乃命门下侍郎、同平章事常衮持节册命。以其月二十五日丁酉，迁座于庄陵，礼也。",
    "语未竟，帝曰：微汝言，几误疑赐。赐固善人，才短耳。命予葬祭。洪熙元年赠太子少保，谥文安。",
    "九月丙戌，龙骧将军杨佺期击氐帅杨佛嵩于潼谷，败之。冬十月，姚苌死，子兴嗣伪位。十九年夏六月壬子，追尊会稽王太妃郑氏为简文宣太后。秋七月，荆、徐二州大水，伤秋稼，遣使振恤之。",
    "明年，追号后父真为车骑将军、舞阳宣德侯，因封后母兴为舞阳君。时王美人任娠，畏后，乃服药欲除之，而胎安不动，又数梦负日而行。四年，生皇子协，后遂鸩杀美人。帝大怒，欲废后，诸宦官固请得止。",
    "二十三年薨。无子。黄初二年追进爵，谥曰戴公。以彭城王据子范奉整后。",
    "宁康初，追赠特进、光禄大夫，加散骑常侍，谥曰靖。长子恪，领军将军。恪子欣之，豫章太守，秩中二千石。欣之弟欢之，广州刺史。",
    "又二年卒，年八十有三。赠太子太傅。",
    "广汉殇王广德，年二岁薨。咸宁初追加封谥，齐王攸以第五子赞绍封。薨，攸更以第二子寔嗣广德。乐安平王鉴，字大明，初封临泗亭侯。",
    "出为武定军节度使，及代，军民请留。后同知枢密院事，兼南府宰相、门下侍郎、平章事。致仕，卒。追赠中书令，谥文宪。",
    "赠建威将军、平州刺史、乐城子，谥曰定。祐从子虬，字神虎。",
    "乙酉，赠恤冤陷诸臣。夏四月癸巳，赐刘若宰等进士及第、出身有差。甲午，袁崇焕为兵部尚书，督师蓟、辽。"
  ],
  "政治/抓捕事件": [
    "奕留台东都，又分知东都武部选事。十四载，安禄山犯东都，人吏奔散；奕在台独居，为贼所执，与李憕同见害。玄宗闻而愍之，赠兵部尚书。",
    "瑾发之，捕节下狱。",
    "高祖崩，梓宫达鲁阳，乃行遗诏。北海王详奉宣遗旨，长秋卿白整等入授后药。后走呼不肯引决，曰：官岂有此也，是诸王辈杀我耳！整等执持，强之，乃含椒而尽。殡以后礼。",
    "开平元年，马殷发兵攻彦恭，恃堑为阻，逾年不能破。三年，彦恭奔于杨行密，马殷擒其弟彦雄等七人送于梁，斩于汴市，彦恭卒于淮南，澧、朗遂入于楚。钟传钟传，洪州高安人也。事州为小校，黄巢攻掠江淮，所在盗起，往往据州县。",
    "丁酉，彦威至青州，追擒之。有司上言：庄宗祔庙，懿祖祧迁，准例舍故而讳新，懿祖例不讳，忌日不行香。从之。壬子，襄州节度使刘训加检校太傅，以伪蜀右仆射、中书侍郎、平章事、赵国公张格为太子宾客，充三司副使，从任圜请也。",
    "天会三年，大举伐宋，余睹为元帅右都监，宋兵四万救太原，余睹、屋里海逆击于汾河北，擒其帅郝仲连、张关索，统制马忠，杀万余人。",
    "二月，豫州刺史尧雄攻扬州，拔之，擒宝炬义州刺史韩显、扬州长史丘岳，送京师。丙辰，遣兼散骑常侍郑伯猷使于萧衍。三月，齐献武王固请解大丞相，诏从之。夏四月庚寅，曲赦畿内。"
  ],
  "政治/充军事件": [
    "庚申，签河南路寄居官民充军。辛酉，徙晋阳公郭文振兵于孟州。甲子，徙权平阳公史咏兵于解州、河中府。",
    "宗预，字德艳，南阳安众人也。建安中，随张飞入蜀。",
    "七年七月，签宣德、西京、平阳、太原、陕西五路人匠充军，命各处管匠头目，除织匠及和林建宫殿一切合干人等外，应有回回、河西、汉儿匠人，并札鲁花赤及札也、种田人等，通验丁数，每二十人出军一名。八年七月，诏：燕京路保州等处，每二十户签军一名，令答不叶儿统领出军。",
    "庚戌，帝至汴梁，伯颜等扈从北行。以前翰林学士承旨阿不海牙为河南行省平章政事。发平滦民堑迁民镇，以御辽东军。",
    "未几，倭寇益肆。乃增设金山参将，分守苏、松海防，寻改为副总兵，调募江南、北徐、邳官民兵充战守，而杭、嘉、湖亦增参将及兵备道。三十三年，调拨山东民兵及青州水陆枪手千人赴淮、扬，听总督南直军务都御史张经调用。",
    "成都路民屯：世祖至元十三年，签阴阳人四十户，办纳屯粮。二十二年，续签泸州编民九十七户，充屯田户。三十一年，续签千户高德所管民一十四户。保宁万户府军屯：世祖至元二十六年，保宁府言：本管军人，一户或二丁三丁，父兄子弟应役，实为重并，若又迁于成都屯种，去家隔远，逃匿必多。",
    "甲辰，赐国王和童金二百五十两、银七百五十两。立皇太子卫率府，发军千五百人修五台山佛寺。",
    "每语人云但道我好，虽知妄言，故胜道恶。务进忌前，不顾后患，时人以此恶之。至于学术精微，当时莫及。子崇祖，武定中，太尉外兵参军。"
  ],
  "人生/出生": [
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。"
  ],
  "政治/叛变事件": [
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "一年卒，无子，绝後，国除，入于汉。遂既王赵二十六年，孝景帝时坐晁错以適削赵王常山之郡。吴楚反，赵王遂与合谋起兵。",
    "廖永安被执，谢再兴叛降士诚，会太祖与陈友谅相持，未暇及也。友谅亦遣使约士诚夹攻太祖，而士诚欲守境观变，许使者，卒不行。",
    "三月，命速不台等围南京，金主遣其弟曹王讹可入质。帝还，留速不台守河南。夏四月，出居庸，避暑官山。高丽叛，杀所置官吏，徙居江华岛。",
    "孝昌初，值刺史元法僧据州外叛，元恢招聚同志，潜规克复，事泄，为法僧所害。时人伤惜之。",
    "安南将军、湘州刺史华皎谋反，丙申，以中抚大将军淳于量为使持节、征南大将军，总率舟师以讨之。六月壬寅，以中军大将军、司空徐度进号车骑将军，总督京邑众军，步道袭湘州。闰月癸巳，以云麾将军新安王伯固为丹阳尹。秋七月戊申，立皇子至泽为皇太子，赐天下为父后者爵一级，王公卿士已下赉帛各有差。"
  ],
  "日常/更名事件": [
    "建炎元年六月，生于南京。拜檢校少保、集慶軍節度使，封魏國公。金人侵淮南，帝幸臨安，會苗傅、劉正彥作亂，逼帝禪位于旉，改元明受。",
    "初，知祥与璋俱有异志，而重诲信言事者，以璋尽忠于国，独知祥可疑，重诲犹欲倚璋以图知祥。是岁九月，董璋先反，攻破阆州，擒李仁矩杀之。是月应圣节，知祥开宴，东北望再拜，俯伏呜咽，泣下沾襟，士卒皆为之歔欷，明日遂举兵反。是秋，明宗改封琼华公主为福庆长公主，有司言前世公主受封，皆未出降，无遣使就籓册命之仪。",
    "延祐六年，降掌饮司为局。至治三年罢。泰定四年复立。天历二年，改嘉酝局，提点二员，大使二员，副使二员，书史一员，书吏四人。",
    "九月乙卯，冀州大都督府复为魏州，魏州复为冀州。壬寅，沛王贤徙封雍王。冬十月己未，皇太子监国。",
    "本名隆范，后避玄宗连名，改单称范。初封郑王，寻改封卫王。长寿二年，随例却入閤，徙封巴陵郡王，累授尚食奉御。",
    "武德四年析置平晋县，以新野置新州，寻废新州，以新野来属。六年省平晋县。又领深阳县，贞观元年省，乾元元年省新野，皆入焉。",
    "二十四年二月改名珙。",
    "是以大朝会宰臣承旨，草制诏学士承旨，若无区别，何表等威？除翰林承旨外，殿前承旨宜改为殿直；密院承旨宜改为承宣；御史台、三司、阁门、客省所有承旨，并令别定其名。",
    "至元十三年，改千户为江川州。二十年，降为县。阳宗。",
    "秋，魏将梅敷使张俭求见抚纳。南阳阴、酂筑阳、山都、中庐五县民五千家来附。冬，魏嗣王称尊号，改元为黄初。二年四月，刘备称帝于蜀。",
    "本治思蒙水口，武德八年，移于今治，属眉州也。绵州上隋金山郡。武德元年，改为绵州，领巴西、昌隆、涪城、魏城、金山、万安、神泉七县。",
    "成帝建始二年省技巧、六厩官。王莽改水衡都尉曰予虞。初，御羞、上林、衡官及铸钱皆属少府。内史，周官，秦因之，掌治京师。",
    "乙巳，赦岐州，赐高年粟帛。十月丁巳，至自岐州。十一月丁亥，徙封旭轮为冀王，改名轮。",
    "冬十月丁酉，幸温泉宫。改临淄郡为济南郡。十一月己巳，还京。十二月辛未，赞善大夫杜有邻、著作郎王曾、左骁卫兵曹柳勣等为李林甫所构，并下狱死。",
    "景云元年七月己巳，制自今授左右仆射、侍中、中书令、六尚书已上官听让，其余停让。追废皇后韦氏为庶人，安乐公主为悖逆庶人。丁丑，改太史监为太史局，隶秘书省。八月癸巳，新除集州刺史、谯王重福潜入东都构逆，州县讨平之。",
    "习入朝京师，监军杨彦朗知留后事，昂以公事至府上谒，赞者以彦朗讳石，更其姓曰右。昂趋于庭，仰责彦朗曰：内侍奈何以私害公！昂姓石，非右也。",
    "建元元年春正月，改元，振恤鳏寡孤独。",
    "遣尚书郎邓芝固好于吴，吴王孙权与蜀和亲使聘，是岁通好。三年春，务农殖谷，闭关息民。三年春三月，丞相亮南征四郡，四郡皆平。改益州郡为建宁郡，分建宁、永昌郡为云南郡，又分建宁、臧柯为兴古郡。"
  ],
  "人生/高中": [
    "敬嗣晖，字唐臣，易州人。登天眷二年进士第，调怀安丞，迁弘政令，补尚书省令史。有才辩，海陵为宰相，爱之，及篡立，擢起居注，历谏议大夫、吏部侍郎、左宣徽使。贞元三年八月，尚食烹饪失宜，庖官各杖二百，嗣晖与同知宣徽院事乌居仁各杖有差。",
    "子守孚，进士，刑部郎中。",
    "天庆八年中进士丙科，授秘书省校书郎，至大定府金源令。归朝为御前承应文字。",
    "嗣复七八岁时已能秉笔为文。年二十，进士擢第。二十一，又登博学宏词科，释褐秘书省校书郎。"
  ],
  "政治/贿赂事件": [
    "国祥乃重贿冯保固求复，自强力持不可，卒以中旨许之。",
    "及洪累授方镇，纳赂不满士良之志，士良怒，遣人上书论洪非太后之亲，又以萧本者为太后弟。从谏深知内宫之故，乃自潞府飞章论之曰：臣闻造伪以乱真者，匹夫知之尚不可，况天下皆知乎？执疏以为亲者，在匹夫之家尚不可，况处大国之朝乎？臣受国恩深，奉公心切，知有此失，安敢不言！伏唯皇帝陛下仁及万方，孝敦九族，而推心无党，唯理是求。微臣所以不避直言，切论深事。"
  ],
  "日常/许诺事件": [
    "国祥乃重贿冯保固求复，自强力持不可，卒以中旨许之。",
    "遷寶謨閣直學士。度以人物為己任，推挽不休，每曰：無以報國，惟有此耳。"
  ],
  "民事/欢呼事件": [
    "左右引逵使叩头，逵叱之曰：安有国家长吏为贼叩头！援怒，将斩之。绛吏民闻将杀逵，皆乘城呼曰：负要杀我贤君，宁俱死耳！左右义逵，多为请，遂得免。初，逵过皮氏，曰：争地先据者胜。及围急，知不免，乃使人间行送印绶归郡，且曰：急据皮氏。"
  ],
  "战争/调兵事件": [
    "是月，帝徵兵于湘州刺史河东王誉，誉拒命。",
    "阿木郎觇其单弱，请边臣调赤斤、罕东兵，夜袭破其城，牙兰遁去，斩获甚多，有诏奖赉。",
    "是冬，驻跸金川。鵩乾亨元年春正月乙酉，遣挞马长寿使宋，问兴师伐刘继元之故。",
    "从宗弼袭康王，即渡淮，阿鲁补以兵四千留和州，总督江、淮间戍将，以讨未附郡县。遂攻下太平州，隳其城。庐州叛，以偏师讨之，败其骑六千，擒三校。",
    "世让伪许之，因告城中曰：贼兵多少，极于此矣。宜善自固，以图安全。举重其执节，竟不之害。太宗时屯兵高墌，世让潜遣宝逃归，言贼中虚实；高祖嘉之，赐其家帛千匹。",
    "改知太平兼提領江、淮茶鹽所，轉荊湖制置大使、知江陵府兼夔路策應大使，兼京湖屯田大使，帶行京湖安撫制置大使。拜觀文殿學士，職任如舊，兼總領湖廣江西京西財賦、湖北京西軍馬錢粮。淵調兵二萬往援川蜀，其後力戰于白河、沮河、玉泉。",
    "十二年春二月，亮由斜谷出，始以流马运。秋八月，亮卒渭滨。",
    "埜堕马几殆，或劝留怀来城就医。埜曰：至尊在行，敢托疾自便乎？车驾次宣府，朱勇败没。埜请疾驱入关，严兵为殿。不报。"
  ],
  "日常/推辞拒绝": [
    "是月，帝徵兵于湘州刺史河东王誉，誉拒命。",
    "勖皆力辞不受。",
    "汉遣国子祭酒田敏使于楚，假道荆南，从诲问敏中国虚实，以为契丹之后，兵食皆殚，意欲以诮敏，敏为言：杜重威悉以晋戈甲降虏，虏置之镇州，未尝以北，而晋兵皆汉有也。从诲不悦。敏以印本《五经》遗从诲，从诲谢曰：予之所识，不过《孝经》十八章尔。"
  ],
  "民事/迁徙事件": [
    "晋高祖辟为河阳节度掌书记，其后常以自从。高祖自太原徙天平，不受命，而有异谋，以问将佐，将佐皆恐惧不敢言，独维翰与刘知远赞成之，因使维翰为书求援于契丹。耶律德光已许诺，而赵德钧亦以重赂啖德光，求助己以篡唐。高祖惧事不果，乃遣维翰往见德光，为陈利害甚辩，德光意乃决，卒以灭唐而兴晋，维翰之力也。",
    "餘皆北遷。",
    "秦民初言令不便者有来言令便者，卫鞅曰此皆乱化之民也，尽迁之於边城。",
    "己未，命兵士遷河東民萬戶于山東。庚申，分命使臣率兵赴鎮、潞。壬戌，駕還。"
  ],
  "战争/受降事件": [
    "会车驾西征，元昊乞降，帝以前后反覆，遣滴冽往觇诚否。因为元昊陈述祸福，听命乃还。",
    "顷之，拜抚军将军。是岁，吴将步阐来降，假亮节都督诸军事以纳之。",
    "滇王离难西南夷，举国降，请置吏入朝。於是以为益州郡，赐滇王王印，复长其民。西南夷君长以百数，独夜郎、滇受王印。滇小邑，最宠焉。",
    "二年正月庚寅，辽双州节度使张崇降。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "举进士，为史思明判官，历事思明、朝义，常掌兵事。朝义之败，说降于军前，郭子仪爱其才，留于幕下。累授长安令、秘书少监，迁吏部侍郎、太子詹事，以才干称。谈者或以宰相许之，金吾将军裴儆谓谏议大夫柳载曰：以鄙夫所度，说得祸不久矣。",
    "二月，鱼山总领张瓛作乱，杀元帅完颜胡土降北。仲德累议讨之，德全不从，即领麾下十许人，亲劝民兵得三百人，径往鱼山，而从宜严禄已诛瓛反正，仲德抚慰军民而还。",
    "览此忠至，弥以慰怀。及萧铣将董景珍以长沙来降，命绍率兵应之。以破铣功，拜其子智仁为温州刺史，委以招慰。时萧铣遣其将杨道生围硖州，绍纵兵击破之。",
    "元景退走。十一月，车驾从东安山出下邳，义隆邹山戍主、鲁阳阳平二郡太守崔邪利降。楚王建、南康侯杜道俊进军清西，至留建成。",
    "纵不从，投道福于涪。"
  ],
  "战争/逃逸事件": [
    "阿木郎觇其单弱，请边臣调赤斤、罕东兵，夜袭破其城，牙兰遁去，斩获甚多，有诏奖赉。",
    "李嗣源坏夹城东北隅，率先掩击，梁军大恐，南向而奔，投戈委甲，噎塞行路，斩万余级，获其将副招讨使符道昭洎大将三百人，刍粟百万。梁招讨使康怀英得百余骑，出天井关而遁。",
    "维果攻为翅，会淮军适至，维遁退。",
    "十二月己未，突厥复攻茹茹，茹茹举国南奔。",
    "诏崇为使持节、都督陇右诸军事，率众数万讨之。崇槎山分进，出其不意，表里以袭。群氐皆弃灵珍散归，灵珍众减大半。",
    "齐王田荣兵败，走平原，平原人杀荣。",
    "及曹操击谦，徐方不安。融乃将男女万口、马三千匹走广陵。广陵太守赵昱待以宾礼。融利广陵资货，遂乘酒酣杀昱，放兵大掠，因以过江，南奔豫章，杀郡守朱皓，入据其城。",
    "桂州刺史李承進棄城亦奔。",
    "景隆屡大败，奔德州，诸军皆溃。明年正月，燕王攻大同，景隆引军出紫荆关往救，无功而还。帝虑景隆权尚轻，遣中官赍玺书赐黄钺弓矢，专征伐。",
    "世让伪许之，因告城中曰：贼兵多少，极于此矣。宜善自固，以图安全。举重其执节，竟不之害。太宗时屯兵高墌，世让潜遣宝逃归，言贼中虚实；高祖嘉之，赐其家帛千匹。",
    "亮遣参军卜靖赴之，败走。朱彤至梁州，亮望风奔散，于是坚遂有梁益二州。",
    "阴使聂翁壹为间，亡入匈奴，谓单于曰：吾能斩马邑令丞吏，以城降，财物可尽得。单于爱信之，以为然，许聂翁壹。聂翁壹乃还，诈斩死罪囚，县其头马邑城，示单于使者为信。"
  ],
  "战争/出征事件": [
    "召公为保，周公为师，东伐淮夷，残奄，迁其君薄姑。",
    "言者交攻之，遂下吏，貶秩四等，安置隨州。會侯可以言水利入見，神宗問其事，對曰：种諤奉密旨取綏而獲罪，後何以使人？帝亦悔，復其官。韓絳宣撫陝西，用為鄜延鈐轄。絳城囉兀，規橫山，令諤將兵二萬出無定川，命諸將皆受節度，起河東兵會銀州。",
    "太宗遂引军于河南以讨徐圆朗。",
    "行次镇州，闻北主已毙，其党尚据镇阳，遂与李筠、白再荣之俦合谋力战，尽逐契丹，据有镇阳。时汉祖已建号于河东，诏以福进为北面行营马步都虞候，寻拜曹州防御使、检校太保。太祖出镇于鄴，将谋北伐，奏以福进自随。",
    "四年，又亲征渤海。天显元年，灭渤海国，地方五千里，兵数十万，五京、十五府、六十二州，尽有其众，契丹益大。会同初，太宗灭唐立晋，晋献燕、代十六州，民众兵强，莫之能御矣。",
    "是月，自将南伐。九月壬辰，阅诸道兵于渔阳西枣林淀。是月，赵延寿与晋张彦泽战于定州，败之。冬十一月戊子朔，进围镇州。",
    "未行，属相州官军为史思明所败，东京震骇。元帅司徒郭子仪镇谷水，乃以瑱为陕州刺史，充陕、虢等州节度，并潼关防御、团练、镇守使。乾元三年四月十三日，襄州军将张维瑾、曹玠率众谋乱，杀刺史史翙。",
    "丙午，高丽、鄯善国并遣使朝贡。秋七月，田于棝阳。己卯，乐平王丕等五将东伐，至和龙，徙男女六千口而还。",
    "及太祖北征，以候骑之误，落然无所具，而复壁垒荒圮，帑廪空竭，太祖怒，贬柳州司户，寻赐死于相州。《通鉴》：开化元年丙午，至相州，刺史李思安不意帝猝至，落然无具，坐削官爵。二年正月丁卯，帝至获嘉，追思李思安去岁供馈有阙，贬柳州司户，寻长流思安于崖州，赐死。邓季筠，宋州下邑人也。",
    "太宗即位，遷右廂都指揮使、領本州團練使，遷雲州觀察使。太平興國四年，從征太原，領鎮州駐泊都鈐轄。",
    "遣尚书郎邓芝固好于吴，吴王孙权与蜀和亲使聘，是岁通好。三年春，务农殖谷，闭关息民。三年春三月，丞相亮南征四郡，四郡皆平。改益州郡为建宁郡，分建宁、永昌郡为云南郡，又分建宁、臧柯为兴古郡。"
  ],
  "战争/战败事件": [
    "召公为保，周公为师，东伐淮夷，残奄，迁其君薄姑。",
    "隆运总宿卫事，太后益宠任之。统和元年，加开府仪同三司，兼政事令。四年，宋遣曹彬、米信将十万众来侵，隆运从太后出师败之，加守司空，封楚国公。",
    "明年，张士诚将吕珍围安丰，林儿告急于太祖。太祖曰：安丰破则士诚益强。遂亲帅师往救，而珍已入城杀福通。太祖击走珍，以林儿归，居之滁州。",
    "攻拔吴枳里城，破涂中屯戍。赐骞兄子惺爵关中侯。咸宁初，迁太尉，转大司马。",
    "五月望，安战梅林，再败，退保雩都。廷麟乃散其兵，以六月入赣，与元吉凭城守。未几，援兵至，围暂解，已，复合。八月，水师战败，援师悉溃。",
    "从庄宗袭契丹于幽州，收新州，历银枪效义都指挥使，再任武州刺史。同光初，契丹陷妫、儒、檀、顺、平、蓟六州，武州独全，改授蔚州刺史。天成初，历振武、昭武留后，寻授利州节度使，入为右卫上将军。",
    "是月，自将南伐。九月壬辰，阅诸道兵于渔阳西枣林淀。是月，赵延寿与晋张彦泽战于定州，败之。冬十一月戊子朔，进围镇州。",
    "齐王田荣兵败，走平原，平原人杀荣。",
    "詔未下而京城陷。",
    "元景退走。十一月，车驾从东安山出下邳，义隆邹山戍主、鲁阳阳平二郡太守崔邪利降。楚王建、南康侯杜道俊进军清西，至留建成。",
    "辛巳，贺若弼进据钟山，顿白土冈之东南。甲申，后主遣众军与弼合战，众军败绩。"
  ],
  "战争/起兵事件": [
    "十二月甲寅，諜言北界禁民妄傳起兵，帝諭大臣當自治，為安邊息民之計。",
    "言者交攻之，遂下吏，貶秩四等，安置隨州。會侯可以言水利入見，神宗問其事，對曰：种諤奉密旨取綏而獲罪，後何以使人？帝亦悔，復其官。韓絳宣撫陝西，用為鄜延鈐轄。絳城囉兀，規橫山，令諤將兵二萬出無定川，命諸將皆受節度，起河東兵會銀州。",
    "天宝五载，右相李林甫构陷刑部尚书韦坚，斌以亲累贬巴陵太守，移临安太守，加银青光禄大夫。斌授五品时，兄陟为河东太守，堂兄由为右金吾将军，縚为太子少师，四人同时列戟，衣冠之盛，罕有其比。十四载，安禄山反，陷洛阳，斌为贼所得，伪授黄门侍郎，忧愤而卒。",
    "既而璋果败。知祥与诸将率师拒之，战于汉州之弥牟镇。",
    "方斗时，杰潜师捣仪真，得功兵颇伤，而所俱行三百骑皆殁。遂诉于朝，愿与杰决一死战。可法命监军万元吉和解之，不可。会得功有母丧，可法来吊，语之曰：土桥之役，无智愚皆知杰不义。",
    "明年，张士诚将吕珍围安丰，林儿告急于太祖。太祖曰：安丰破则士诚益强。遂亲帅师往救，而珍已入城杀福通。太祖击走珍，以林儿归，居之滁州。",
    "沛公引兵击阳城，使张良以韩司徒降下韩故地，得信，以为韩将，将其兵从沛公入武关。",
    "秋八月甲戌，吴杰及永定侯张铨率致仕武臣，备倭广东。乙亥，遣国子监生分行天下。督吏民修水利。丙戌，阶、文军乱，都督甯正为平羌将军讨之。",
    "一年卒，无子，绝後，国除，入于汉。遂既王赵二十六年，孝景帝时坐晁错以適削赵王常山之郡。吴楚反，赵王遂与合谋起兵。",
    "石敬瑭反，废帝欲北征，重美谓宜持重，固请毋行。废帝心惮敬瑭，初不欲往，闻重美言，以为然，而刘延皓与刘延朗等迫之不已，废帝遂如河阳，留重美守京师。京师震恐，居民皆出城以藏窜，门者禁止之。",
    "以州初置，境逼巴獠，给羽林虎贲三百人，进号冠军将军。及高肇伐蜀，假竖眼征虏将军、持节，领步兵三万先讨北巴。萧衍闻大军西伐，遣其宁州刺史任太洪从阴平偷路入益州北境，欲扰动氐蜀，以绝运路。乘国讳班师，遂扇诱土民，奄破东洛、除口二戍，因此诈言南军继至，氐蜀信之，翕然从逆。",
    "丙辰，太常寺少卿兼翰林院侍读学士刘定之入阁预机务。是月，断藤峡贼复起。",
    "及景嗣位，累遷至中書舍人。晉開運末，閩越大亂，景遣謐與諫議大夫陳覺乘傳安撫，謐遂矯詔發數郡兵攻福州。及敗，引佩刀自刺，親吏制之，不死，長流舒州。",
    "故齐王建孙田安，项羽方渡河救赵，田安下济北数城，引兵降项羽，项羽立田安为济北王，治博阳。田荣以负项梁不肯出兵助楚、赵攻秦，故不得王；赵将陈馀亦失职，不得王：二人俱怨项王。顼王既归，诸侯各就国，田荣使人将兵助陈馀，令反赵地，而荣亦发兵以距击田都，田都亡走楚。",
    "安南将军、湘州刺史华皎谋反，丙申，以中抚大将军淳于量为使持节、征南大将军，总率舟师以讨之。六月壬寅，以中军大将军、司空徐度进号车骑将军，总督京邑众军，步道袭湘州。闰月癸巳，以云麾将军新安王伯固为丹阳尹。秋七月戊申，立皇子至泽为皇太子，赐天下为父后者爵一级，王公卿士已下赉帛各有差。",
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "六年，琬还住涪，拜平前监军、镇北大将军，统汉中。七年春，魏大将军曹爽率步骑十余万向汉川，前锋已在骆谷。时汉中守兵不满三万，诸将大惊。",
    "二月，鱼山总领张瓛作乱，杀元帅完颜胡土降北。仲德累议讨之，德全不从，即领麾下十许人，亲劝民兵得三百人，径往鱼山，而从宜严禄已诛瓛反正，仲德抚慰军民而还。",
    "今军外勒戎旅，内存国朝。朕嘉将军之意，今耀湛为博士。诸葛亮复出祁山，诏合督诸将西至略阳，亮还保祁山，合追至木门，与亮军交战，飞矢中合右膝，薨，谥曰壮侯。子雄嗣。",
    "庚申，杭州兵变。",
    "宗弼再取河南，宋李兴据河南府。成引军入孟津。",
    "赏未均洽，每疚厥心。可悉依旧准，并下注职。五月壬午，太尉、江州刺史桂阳王休范举兵反。庚寅，内外戒严。",
    "三月甲辰朔，收卢台军。乙丑，收古北口。",
    "癸未，大军发邓州，趋京师，骑二万，步十三万，骑帅蒲察定住，蒲察答吉卜，郎将按忒木，忠孝军总领夹谷爱答、内族达鲁欢，总领夹谷移特剌，提控步军临淄郡王张惠，殄寇都尉完颜阿排、高英、樊泽，中军陈和尚，与恒山公武仙、杨沃衍军合。是日，次五朵山下，取鸦路，北兵以三千骑尾之，遂驻营待杨武。杨武至，知申、裕两州已降。",
    "世宗从太祖于魏，后留京师，太祖举兵，汉诛其族家属，后见杀。",
    "景隆驰至德州，会兵进营河间。燕王闻之喜，语诸将曰：李九江，纨绮少年耳，易与也。遂命世子居守，戒勿出战，而自引兵援永平，直趋大宁。"
  ],
  "日常/埋葬事件": [
    "粤明日，追谥曰贞懿皇后，殡于内殿之西阶。十三年十月癸酉，乃命门下侍郎、同平章事常衮持节册命。以其月二十五日丁酉，迁座于庄陵，礼也。",
    "太祖方事汉高祖于太原，天福中妃卒，遂葬太原之近郊。",
    "甲寅，大行皇帝迁殡于太极殿西阶。秋八月甲午，群臣上谥曰武皇帝，庙号高祖。"
  ],
  "民事/修建事件": [
    "至是，兵部请敕边将修补。科臣又言，垣上宜筑高台，建庐以栖火器。",
    "明昌末，修北边壕堑，立堡塞，以劳进官三阶，授大理正。",
    "天下州县所设猎户：腹里打捕户，总计四千四百二十三户。",
    "夏四月癸丑朔，築靖夏城、制戎城。錄呂餘慶後。",
    "筑图苏湖城，作迎驾殿。秋八月，陈时可、高庆民等言诸路旱蝗，诏免今年田租，仍停旧未输纳者，俟丰岁议之。",
    "秩满将归，群蛮追送，赂遗甚多，轸一无所受，去如初至。又除池阳令，为雍州十一郡最。百姓生为立祠，得罪者无怨言。累迁尚书郎。",
    "累迁侍讲学士，擢詹事，掌翰林院。疏请早建东宫。十九年，拜礼部右侍郎，领詹事府事。明年，改吏部，进左侍郎，教习庶吉士。",
    "废帝即位，追尊魏氏为皇太后，议建陵寝，而太原石敬瑭反，乃于京师河南府东立寝宫。清泰三年六月丙寅，遣工部尚书崔俭奉上皇太后宝册，谥曰宣宪。",
    "遂用黄孔昭例，赠礼部尚书，谥文庄。乡人建祠，与陆九渊、吴澄、吴与弼、陈九川并祀，曰五贤祠，学者称疏山先生。仁度，字继疏。万历十七年进士。",
    "辛巳，修皇太后仪仗。",
    "三月壬申，葬肃皇帝于永陵。乙酉，土蛮犯辽阳，指挥王承德战殁。夏四月丙戌朔，享太庙。",
    "甲辰，赐国王和童金二百五十两、银七百五十两。立皇太子卫率府，发军千五百人修五台山佛寺。",
    "壬辰，以书谕明升。二年春正月乙巳，立功臣庙于鸡笼山。"
  ],
  "日常/会见事件": [
    "凡正、至、圣节、朝会，及册拜、接见蕃臣，仪鸾司陈设仪仗。",
    "初，九淵嘗與朱熹會鵝湖，論辨所學多不合。",
    "时国宝从弟绪说国宝，因恭入觐相王，伏兵杀之，国宝不许。而道子亦欲辑和内外，深布腹心于恭，冀除旧恶。",
    "趣刻印，先生因行佩之矣。食其未行，张良从外来谒。汉王方食，曰：子房前！客有为我计桡楚权者。",
    "文字往来，其间甚密。及裴度求觐，无计沮之，即令讦武昭事，以暴扬其迹。再荣既告，李仲言诫汇曰：言武昭与李程同谋则活，否则尔死。",
    "开运四年，希范卒，年四十九，谥曰文昭。希广立。希广字德丕，希范同母弟也。希范平生恶拓拔常谏诤，常入谒，希范呼阍者指常曰：吾不欲见此人，勿复内也。",
    "继麟曰：郭公功倍于我，尚为人构陷，吾若得面天颜，自陈肝膈，则流言者获罪矣。四年正月，继麟入觐。景进谓庄宗曰：河中人有告变者，言继麟与崇韬谋叛，闻崇韬死，又与李存乂构松逆，当断不断，祸不旋踵。群阉异口同辞，庄宗骇惑不能决。",
    "復召見閱武伎，又試策略于中書，條對數千言。自殿直進閤門祗候，未幾，除濠州兵馬都監。",
    "文武百官素服纱帽，迎谒契丹主于郊次，俯伏俟罪，契丹主命起之，亲自慰抚。契丹主遂入大内，至昏出宫，是夜宿于赤堈。契丹主下诏，应晋朝臣僚一切仍旧，朝廷仪制并用汉礼。戊子，杀郑州防御使杨承勋，责以背父之罪，令左右脔割而死。",
    "高祖遂并拜焉。稍迁尚书仪曹郎，转左民郎，行颍川郡。出为华州安定王征虏府长史。",
    "庚申，右军中尉王守澄，宣召郑注对于浴殿门。是夜，彗星出东方，长三尺，芒耀甚猛。十二月丙戌夜，月掩昴。九年三月乙卯，京师地震。",
    "夏四月丙子，谒高庙。丁丑，谒世祖庙。",
    "文公二年，自十有二月不雨，至于秋七月。文公即位，天子使叔服会葬，毛伯赐命。又会晋侯于戚。",
    "三月壬子朔，颁孔颖达《五经正义》于天下，每年明经令依此考试。丙辰，上御观德殿，陈逆人房遗爱等口马资财为五垛，引王公、诸亲、蕃客及文武九品己上射。夏四月戊子，林邑国王遣使来朝，贡驯象。壬寅，以旱避正殿，减膳，亲录系囚，遣使分省天下冤狱，诏文武官极言得失。",
    "景隆驰至德州，会兵进营河间。燕王闻之喜，语诸将曰：李九江，纨绮少年耳，易与也。遂命世子居守，戒勿出战，而自引兵援永平，直趋大宁。",
    "丁亥，賜將士衣服錢帛。戊子，大赦，減死罪一等。壬辰，宴孟昶及其子弟於大明殿。"
  ],
  "地理/日食": [
    "是月，更定《大明律》。九月丙寅朔，日有食之。冬十一月丙寅，宣德侯金镇等练兵湖广。",
    "秋七月辛亥朔，日有食之。甲寅，遣使视诸道禾稼。辛酉，南院枢密使室昉为中京留守，加尚父。",
    "十一月癸未朔，日有蚀之。",
    "建和元年春正月辛亥朔，日有食之。",
    "明复而止。贞元三年八月，日有食之，有司将伐鼓，德宗不许。太常卿董晋言：伐鼓所以责阴而助阳也，请听有司依经伐鼓。不报，由是其礼遂废。"
  ],
  "政治/免税事件": [
    "元平章刘益以辽东降。是月，蠲太平、镇江、宁国田租。",
    "免西京今年丝银税。甲申，免高丽酒课。乙酉，宋夏贵攻蕲县。谕诸路管民官，毋令军马、使臣入州城、村居、镇市，扰及良民。",
    "元年四月乙卯，赦天下。乙巳，赐民爵一级。五月，除田半租，为孝文立太宗庙。令群臣无朝贺。",
    "甲午，免江西被灾秋粮。冬十月甲子，阅京营将领骑射于西苑。戊幸南海子。十一月丁酉，阅随操武臣骑射于西苑。",
    "郑綮罢。李茂贞陷阆州。八月，杨守亮伏诛。癸巳，减京畿、兴元、洋金商州赋役。"
  ],
  "人生/辞官": [
    "十二月己酉，太子太师侯益以本官致仕。。",
    "使百姓危心，非此焉在？飏于是惭怒而退。岐终恐久获罪，以疾去官。",
    "再过凤翔，硃宏昭拒而不纳，重诲惧，急骑奔程，未至京师，制授河中帅。既至镇，心不自安，遂请致仕。",
    "以母忧去官，寻召复旧职。宋攻夏，李乾顺遣使求和解，帝命俨如宋平之，拜参知政事。",
    "十二年，以佥都御史巡抚南、赣。居二年，乞休，因荐前都御史万镗、大理卿董天锡等十四人可用。吏部请从其言。",
    "中敏上言曰：仍岁大旱，非圣德不至，直以宋申锡之冤滥，郑注之奸弊。今致雨之方，莫若斩郑注而雪申锡。士大夫皆危之，疏留中不下。明年，中敏谢病归洛阳。",
    "丙戌，司徒尔硃彦伯以旱逊位。",
    "己酉，南府宰相赵徽致仕。秋七月戊辰，如秋山。癸酉，柳城郡王霞抹薨。"
  ],
  "政治/诬陷事件": [
    "天宝五载，右相李林甫构陷刑部尚书韦坚，斌以亲累贬巴陵太守，移临安太守，加银青光禄大夫。斌授五品时，兄陟为河东太守，堂兄由为右金吾将军，縚为太子少师，四人同时列戟，衣冠之盛，罕有其比。十四载，安禄山反，陷洛阳，斌为贼所得，伪授黄门侍郎，忧愤而卒。",
    "行人司副熊开元廷劾延儒纳贿状，触帝怒，与给事中姜埰俱廷杖，下诏狱。",
    "冬十月丁酉，幸温泉宫。改临淄郡为济南郡。十一月己巳，还京。十二月辛未，赞善大夫杜有邻、著作郎王曾、左骁卫兵曹柳勣等为李林甫所构，并下狱死。",
    "应历三年，或诬安抟与齐王罨撒葛谋乱，系狱死。"
  ],
  "政治/出使事件": [
    "辨松江知府黄子威诬。奏减浙东濒海渔课。巡按陕西。",
    "成祖初，僧智光使其地。永乐四年遣使入贡，诏授灌顶国师，赐之诰。明年遣使入谢，封为护教王，赐金印、诰命，国师如故。",
    "乙未，契丹使耶律防、陳覬來求御容。戊戌，淮水溢。遣張昪報使契丹。"
  ],
  "政治/判案事件": [
    "辨松江知府黄子威诬。奏减浙东濒海渔课。巡按陕西。",
    "十一月丙辰，犯左執法，又入太微。"
  ],
  "战争/围攻事件": [
    "及讨渤海，破扶余城，斜涅赤从太子大元帅率众夜围忽汗城，大諲歙降。已而复叛，命诸将分地攻之。诘旦，斜涅赤感励士伍，鼓噪登陴，敌震慑，莫敢御，遂破之。天显中卒，年七十，居佐命功臣之一。",
    "十二年冬，小王子以五万骑自榆林入寇，围总兵王勋等于应州。帝幸阳和，亲部署，督诸将往援，殊死战，敌稍却。",
    "李嗣源坏夹城东北隅，率先掩击，梁军大恐，南向而奔，投戈委甲，噎塞行路，斩万余级，获其将副招讨使符道昭洎大将三百人，刍粟百万。梁招讨使康怀英得百余骑，出天井关而遁。",
    "明年，张士诚将吕珍围安丰，林儿告急于太祖。太祖曰：安丰破则士诚益强。遂亲帅师往救，而珍已入城杀福通。太祖击走珍，以林儿归，居之滁州。",
    "九月，围宪于舒。",
    "峻年长于太祖二岁，太祖虽登大位，时以兄呼之，有时呼表字，不忘布衣之契也。峻以此益自负焉。广顺元年冬，刘崇与契丹围晋州，峻请行应援，太祖用为行营都部署，以徐州节度使王彦超为副。诏诸军并取峻节度，许峻以便宜从事，军行资用仰给于官，随行将吏得自选择。",
    "魏公子无忌者，魏昭王子少子而魏安釐王异母弟也。昭王薨，安釐王即位，封公子为信陵君。是时范睢亡魏相秦，以怨魏齐故，秦兵围大梁，破魏华阳下军，走芒卯。魏王及公子患之。",
    "贼分屯南北两山，用木石塞道。应元率文豸战其南，得功率副将林报国战其北，河南兵又扼华阳关，贼遂大败，光玉遁免。元斌至军，檄除可变、可受罪，授以官，报先后首功三千人。及杨嗣昌督师襄阳，令元斌、应元戍荆门，护献陵。",
    "览此忠至，弥以慰怀。及萧铣将董景珍以长沙来降，命绍率兵应之。以破铣功，拜其子智仁为温州刺史，委以招慰。时萧铣遣其将杨道生围硖州，绍纵兵击破之。",
    "壬子，刘武周进围晋州。"
  ],
  "民事/射箭事件": [
    "茂雨射营中，中霸前酒樽，霸安坐不动。军吏皆曰：茂前日已破，今易击也。"
  ],
  "日常/跟随事件": [
    "御史台催班，通事舍人引太尉及群臣就位。",
    "授南京礼科给事中。武宗嗣位，复先朝所汰诸冗费，蕃等力争，不纳。后起江西参议，从都御史陈金讨平东乡寇。嘉靖时，累官工部右侍郎。",
    "甲辰，有星大如三斗，出太微端门，流入翼，声若风鼓幡旗。丁未，追赵、陈、越、代、滕五王入朝。己酉，大渐。御正下大夫刘昉，与内史上大夫郑译矫制，以随国公坚受遗辅政。",
    "从者三十有四人，服同前队。",
    "帝捧神主由殿中门出，奉安舆内。执事捧衣冠置舆后随。"
  ],
  "人生/继承": [
    "镠卒，元瓘立，袭封吴越国王，玉册、金印，皆如镠故事。王延政自立于建州，闽中大乱，元瓘遣其将仰诠、薛万忠等攻之，逾年，大败而归。",
    "子蒲，袭爵。后有大功，及宠幸贵臣薨，赙送终礼，皆依俊故事，无得逾之者。初，俊既卒，太宗命其妻桓氏曰：夫生既共荣，没宜同穴，能殉葬者可任意。桓氏乃缢而死，遂合葬焉。",
    "授南京礼科给事中。武宗嗣位，复先朝所汰诸冗费，蕃等力争，不纳。后起江西参议，从都御史陈金讨平东乡寇。嘉靖时，累官工部右侍郎。",
    "魏公子无忌者，魏昭王子少子而魏安釐王异母弟也。昭王薨，安釐王即位，封公子为信陵君。是时范睢亡魏相秦，以怨魏齐故，秦兵围大梁，破魏华阳下军，走芒卯。魏王及公子患之。",
    "及景嗣位，累遷至中書舍人。晉開運末，閩越大亂，景遣謐與諫議大夫陳覺乘傳安撫，謐遂矯詔發數郡兵攻福州。及敗，引佩刀自刺，親吏制之，不死，長流舒州。",
    "从庄宗袭契丹于幽州，收新州，历银枪效义都指挥使，再任武州刺史。同光初，契丹陷妫、儒、檀、顺、平、蓟六州，武州独全，改授蔚州刺史。天成初，历振武、昭武留后，寻授利州节度使，入为右卫上将军。",
    "无子，以弟颐长子琳为嗣。琳仕至东阳太守。恬、颐并历卿守。琳少子文，骠骑谘议参军史臣曰：夫太刚则折，至察无徒，以之为政，则害于而国；用之行己，则凶于乃家。",
    "无子，弟新宁王鼐钧嗣，薨。子康王鼎渭嗣，崇祯二年薨。再传至孙传齐。",
    "明年，卒，年七十二。太宗痛惜久之，赠尚书右仆射，谥曰忠。子寿袭爵。太宗幸洛阳宫，思通忠节，拜其少子诠果毅都尉，赐束帛以恤其家焉。"
  ],
  "人生/婚嫁": [
    "考是书《少帝纪》云：追册故妃张氏为皇后。《张从训传》亦云，高祖镇太原，为少帝娶从训长女为妃。",
    "为人美姿貌，大音声，言事辩慧。太守奇其才，以女妻之。后从涿郡卢植学于缑氏山中，略见书传。举上计吏。",
    "思敬前为真定尹，其子取部民女为妾。至是，其兄乞离异，其妾畏思敬在相位，不敢去。"
  ],
  "政治/监督事件": [
    "十二年冬，小王子以五万骑自榆林入寇，围总兵王勋等于应州。帝幸阳和，亲部署，督诸将往援，殊死战，敌稍却。",
    "秋八月甲戌，吴杰及永定侯张铨率致仕武臣，备倭广东。乙亥，遣国子监生分行天下。督吏民修水利。丙戌，阶、文军乱，都督甯正为平羌将军讨之。",
    "御史中丞陳堅以讒者言，劾震去；讒者，乃怨震者也。遂奉雲臺祠。賈似道罷相，以宗正寺簿召，將與俞浙並為監察御史，有內戚畏震直，止之，而浙亦以直言去。"
  ],
  "战争/追击事件": [
    "从徐达击叛将祝宗、康泰，复南昌。",
    "居厚至华州东城，华州将娄敬思疑其有异，剖舆视之，见其兵。居厚遂击杀敬思，以兵攻西城，不克而反。",
    "绍闻，惧为患，募遣追之，皆莫敢逼，遂归张杨。道经陈留，太守张邈遣使迎之，相待甚厚，临别把臂言誓。邈字孟卓，东平人，少以侠闻。",
    "边将阿鲁带率兵诘之，夏厢官吴明契、信陵都、卜祥、徐余立等伏兵三千于润中，阿鲁带口中流矢而死，取其弓甲而去。"
  ],
  "战争/驻扎事件": [
    "壬寅，营于滹沱北，诏休哥以骑兵绝宋兵，毋令入邢州；命太师王六谨侦候。癸卯，小校曷主遇宋辎重，引兵杀获甚众，并焚其刍粟。甲辰，诏南大王与休哥合势进讨，宰相安宁领迪离部及三克军殿。上率大军与宋将刘廷让、李敬源战于莫州，败之。",
    "朝廷以劳拜参知政事。天兴元年春，大兵驻郑州海滩寺，遣使招哀宗降。复以奴申往乞和。不许，攻汴益急。",
    "次小辽口。使中都留守宗宪先往。"
  ],
  "战争/伏击事件": [
    "兆轻兵倍道从河梁西涉渡，掩袭京邑。先是，河边人梦神谓己曰：尔朱家欲渡河，用尔作氵垒波津令，为之缩水脉。",
    "从宗弼袭康王，即渡淮，阿鲁补以兵四千留和州，总督江、淮间戍将，以讨未附郡县。遂攻下太平州，隳其城。庐州叛，以偏师讨之，败其骑六千，擒三校。",
    "衆皆奮。金人攻三觜，彥仙戰佯北，金人追之，伏發，掩殺千計，分兵四出，下五十餘壁。初，金人得陝，用降者守之，使招集散亡，彥仙陰遣士廁其間，金人不覺。",
    "诏崇为使持节、都督陇右诸军事，率众数万讨之。崇槎山分进，出其不意，表里以袭。群氐皆弃灵珍散归，灵珍众减大半。",
    "酋大怒，敛众入城，设伏城旁。众饥甚，悉下山攻城。伏发，众大败，先后死者二万五千人。酋寻出令，诸所掠华人赀，悉封识贮库。",
    "师厚先率步骑数千人，设伏于唐店。文礼大掠而旋，士皆卷甲束兵，夜凯歌，行至唐店，师厚伏兵四面围合，杀戮殆尽，文礼单骑仅免。自尔犹对诸将大言，或让之曰：唐店之功，不须多伐。文礼大惭。",
    "边将阿鲁带率兵诘之，夏厢官吴明契、信陵都、卜祥、徐余立等伏兵三千于润中，阿鲁带口中流矢而死，取其弓甲而去。",
    "辛巳，贺若弼进据钟山，顿白土冈之东南。甲申，后主遣众军与弼合战，众军败绩。"
  ],
  "地理/流星雨": [
    "其六月壬戌，蓬星见西南，在房南，去房可二丈，大如二斗器，色白；癸亥，在心东北，可长丈所；甲子，在尾北，可六丈；丁卯，在箕北，近汉，稍小，且去时，大如桃。壬申去，凡十日。占曰：蓬星出，必有乱臣。房、心间，天子宫也。",
    "庚申，右军中尉王守澄，宣召郑注对于浴殿门。是夜，彗星出东方，长三尺，芒耀甚猛。十二月丙戌夜，月掩昴。九年三月乙卯，京师地震。",
    "甲辰，有星大如三斗，出太微端门，流入翼，声若风鼓幡旗。丁未，追赵、陈、越、代、滕五王入朝。己酉，大渐。御正下大夫刘昉，与内史上大夫郑译矫制，以随国公坚受遗辅政。",
    "十二月壬寅，太白从行在填星西南二尺五寸斗度。七年二月辛巳，太白从行入羽林。十月癸酉，太白在岁星南，相去一尺六寸，从在箕度为合。",
    "甲辰，河南府有大星夜见南方，光如昼。丁未，大星陨，照夜如昼，及旦，黑气晦暗如夜。",
    "十二月丙寅，自乙夜至曙，星流如雨。大历二年九月乙丑，昼有星如一斗器，色黄，有尾长六丈余，出南方，没于东北。东北于中国，则幽州分也。三年九月乙亥，有星大如斗，北流，有光烛地，占为贵使。"
  ],
  "战争/投奔事件": [
    "开平元年，马殷发兵攻彦恭，恃堑为阻，逾年不能破。三年，彦恭奔于杨行密，马殷擒其弟彦雄等七人送于梁，斩于汴市，彦恭卒于淮南，澧、朗遂入于楚。钟传钟传，洪州高安人也。事州为小校，黄巢攻掠江淮，所在盗起，往往据州县。",
    "时霍彦威所将镇州兵五千人独不乱，闻帝既出，相率归帝。诘朝，帝登城掩泣曰：国家患难，一至于此！来日归籓上章，徐图再举。安重诲、霍彦威等曰：此言非便也。"
  ],
  "日常/形象描写": [
    "次九队，妇女二十人，冠金梳翠花钿，绣衣，执花鞚稍子鼓，舞唱前曲，与前队相和。"
  ],
  "政治/囚禁事件": [
    "寻擒天光、度律于河桥。西北大行台长孙稚、都督贾显智等率骑入京师，执尔朱世隆、彦伯，斩于都街；囚送天光、度律于齐献武王。辛未，前废帝骠骑大将军、行济州事侯景据城降，仍除仪同三司、兼尚书仆射、南道大行台、济州刺史。",
    "帝谕锦衣朱希孝坐以纵通汉勾贼罪，复下选诏狱。",
    "丙戌，废皇太子为庶人，囚之上京。己丑，回鹘来贡。杀东京留守同知耶律回里不。"
  ],
  "日常/书信事件": [
    "亮亦与达书曰：部分如流，趋舍罔滞，正方性也。其见贵重如此。八年，迁骠骑将军。以曹真欲三道向汉川，亮命严将二万人赴汉中。",
    "秦王恐其为变，乃赐文信侯书曰：君何功於秦？秦封君河南，食十万户。"
  ],
  "民事/增税事件": [
    "加泚实封五百户，赐窦氏名园、泾水上腴田及锦彩金银器，以安其意，时滔叛故也。壬午，贬御史大夫严郢为费州长史，杖杀左巡使、殿中侍御史郑詹。郢岁余卒。五月丙戌，增两税、盐榷钱，两税每贯增二百，盐每斗增一百。"
  ],
  "政治/阅兵事件": [
    "甲午，免江西被灾秋粮。冬十月甲子，阅京营将领骑射于西苑。戊幸南海子。十一月丁酉，阅随操武臣骑射于西苑。"
  ],
  "地理/海汛": [
    "七年七月，密云山水骤涨，军器、文卷、房屋俱没。成化三年六月，江夏水决江口堤岸，迄汉阳，长八百五十丈有奇。五年，湖广大水。"
  ]
}